---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/01_mer
> ge_all_data.log
  log type:  text
 opened on:  19 Feb 2026, 13:39:09

. 
. * -----------------------------------------------------------------------------
> -
. * 1. FRED CPI
. * -----------------------------------------------------------------------------
> -
. capture mkdir "${FRED_DATA}"

. freduse CPIAUCSL, clear

. export delimited using "${FRED_DATA}/CPIAUCSL.csv", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw data/FRED/CPIAUC
> SL.csv saved

. display "Saved FRED CPIAUCSL to ${FRED_DATA}/CPIAUCSL.csv"
Saved FRED CPIAUCSL to /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Ra
> w data/FRED/CPIAUCSL.csv

. clear

. 
. * -----------------------------------------------------------------------------
> -
. * 2. Merge 2022 flows (01_1), then 2020 trust (01_2), then 2002–2020 flows (01_
> 3–01_12)
. * -----------------------------------------------------------------------------
> -
. * Run sub-scripts without capture so the first real error surfaces (which scrip
> t/command failed)
. display "=== 01_1: Merging 2022 flows ==="
=== 01_1: Merging 2022 flows ===

. do "${RAW_DATA}/01_1_merge_flow_2022.do"

. * 01_1_merge_flow_2022.do
. * Merge 2022 flow variables from h22e3a into RAND longitudinal.
. * Variable names from old repo (Chp2-BeliefsandTrust_Old): h22e3a uses lowercas
> e (hhidpn, sr050, sr073, etc.).
. * Scratch file in RAW_DATA. Final output to CLEANED.
. 
. * Do not use -clear all-: it wipes globals (RAW_DATA, CLEANED) set by 00_config
> .
. clear

. set more off

. local scratch "${RAW_DATA}/_merge_scratch.dta"

. capture mkdir "${CLEANED}"

. 
. * Load longitudinal
. use "${HRS_DATA}/_randhrs1992_2022v1.dta", clear

. 
. * Load 2022 fat file: h22e3a uses lowercase. Flow vars + flag vars. Public stoc
> k: SR072 (flag), SR073 (amount).
. preserve

. use hhidpn sr050 sr055 sr063 sr064 sr072 sr073 sr030 sr035 sr045 sq171_1 sq171_
> 2 sq171_3 sr007 sr013 sr024 ///
>     sr049 sr061 sr062 sr028 sr029 sq170_1 sq170_2 sq170_3 sr002 using "${HRS_DA
> TA}/h22e3a.dta", clear

. save "`scratch'", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. 
. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        29,378
        from master                    29,378  
        from using                          0  

    Matched                            15,856  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. capture mkdir "${CLEANED}"

. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_1: Merged 2022 flows. Saved " _N " obs to all_data_merged.dta"
01_1: Merged 2022 flows. Saved 45234 obs to all_data_merged.dta

. 
end of do-file

. 
. display "=== 01_2: Merging 2020 trust (rv557-rv570) ==="
=== 01_2: Merging 2020 trust (rv557-rv570) ===

. do "${RAW_DATA}/01_2_merge_trust_2020.do"

. * 01_2_merge_trust_2020.do
. * Merge 2020 trust (rv557-rv570) from h20f1a. Uses project scratch file.
. * Merge key: hhidpn (per long_merge_in_trust_2020.do in old repo). Input: ${CLE
> ANED}/all_data_merged.dta
. 
. * Do not use -clear all-: it wipes globals (RAW_DATA, CLEANED) set by 00_config
> .
. clear

. set more off

. 
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. 
. preserve

. use hhidpn rv557 rv558 rv559 rv560 rv561 rv562 rv563 rv564 rv565 rv566 rv567 rv
> 568 rv569 rv570 using "${HRS_DATA}/h20f1a.dta", clear

. rename (rv557 rv558 rv559 rv560 rv561 rv562 rv563 rv564 rv565 rv566 rv567 rv568
>  rv569 rv570) ///
>        (rv557_2020 rv558_2020 rv559_2020 rv560_2020 rv561_2020 rv562_2020 rv563
> _2020 rv564_2020 ///
>         rv565_2020 rv566_2020 rv567_2020 rv568_2020 rv569_2020 rv570_2020)

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. 
. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        29,511
        from master                    29,511  
        from using                          0  

    Matched                            15,723  
    -----------------------------------------

. capture erase "`scratch'"

. 
. * Recode HRS special values to missing for r557-r570 (trust). Per codebook RV57
> 0: -8 Web non-response, 8 DK/NA, 9 RF.
. * We remove -9 -8 8 9 98 99 (and 9998 ... 99999999) so 99 and all DK/NA/RF are 
> missing for *r557-*r570.
. local trustvars rv557_2020 rv558_2020 rv559_2020 rv560_2020 rv561_2020 rv562_20
> 20 rv563_2020 rv564_2020 rv565_2020 rv566_2020 rv567_2020 rv568_2020 rv569_2020
>  rv570_2020

. local miss -9 -8 8 9 98 99 9998 9999 999998 999999 9999998 9999999 99999998 999
> 99999

. foreach v of local trustvars {
  2.     foreach m of local miss {
  3.         quietly replace `v' = . if `v' == `m'
  4.     }
  5. }

. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_2: Merged 2020 trust (rv557-rv570). Saved " _N " obs"
01_2: Merged 2020 trust (rv557-rv570). Saved 45234 obs

. 
end of do-file

. 
. display "=== 01_3–01_12: Merging 2002–2020 flows ==="
=== 01_3–01_12: Merging 2002–2020 flows ===

. do "${RAW_DATA}/01_3_merge_flow_2002.do"

. * 01_3_merge_flow_2002.do — merge 2002 flow vars from h02f2c (prefix H). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn hr050 hr055 hr063 hr064 hr072 hr073 hr030 hr035 hr045 hq171_1 hq171_
> 2 hq171_3 hr007 hr013 hr024 ///
>     hr049 hr061 hr062 hr028 hr029 hq170_1 hq170_2 hq170_3 hr002 using "${HRS_DA
> TA}/h02f2c.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        27,069
        from master                    27,069  
        from using                          0  

    Matched                            18,165  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_3: Merged 2002 flows. N = " _N
01_3: Merged 2002 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_4_merge_flow_2004.do"

. * 01_4_merge_flow_2004.do — merge 2004 flow vars from h04f1c (prefix J). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn jr050 jr055 jr063 jr064 jr072 jr073 jr030 jr035 jr045 jq171_1 jq171_
> 2 jq171_3 jr007 jr013 jr024 ///
>     jr049 jr061 jr062 jr028 jr029 jq170_1 jq170_2 jq170_3 jr002 using "${HRS_DA
> TA}/h04f1c.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        25,105
        from master                    25,105  
        from using                          0  

    Matched                            20,129  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_4: Merged 2004 flows. N = " _N
01_4: Merged 2004 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_5_merge_flow_2006.do"

. * 01_5_merge_flow_2006.do — merge 2006 flow vars from h06f4b (prefix K). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn kr050 kr055 kr063 kr064 kr072 kr073 kr030 kr035 kr045 kq171_1 kq171_
> 2 kq171_3 kr007 kr013 kr024 ///
>     kr049 kr061 kr062 kr028 kr029 kq170_1 kq170_2 kq170_3 kr002 using "${HRS_DA
> TA}/h06f4b.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        26,765
        from master                    26,765  
        from using                          0  

    Matched                            18,469  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_5: Merged 2006 flows. N = " _N
01_5: Merged 2006 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_6_merge_flow_2008.do"

. * 01_6_merge_flow_2008.do — merge 2008 flow vars from h08f3b (prefix L). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn lr050 lr055 lr063 lr064 lr072 lr073 lr030 lr035 lr045 lq171_1 lq171_
> 2 lq171_3 lr007 lr013 lr024 ///
>     lr049 lr061 lr062 lr028 lr029 lq170_1 lq170_2 lq170_3 lr002 using "${HRS_DA
> TA}/h08f3b.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        28,017
        from master                    28,017  
        from using                          0  

    Matched                            17,217  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_6: Merged 2008 flows. N = " _N
01_6: Merged 2008 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_7_merge_flow_2010.do"

. * 01_7_merge_flow_2010.do — merge 2010 flow vars from hd10f6b (prefix M). Fat f
> iles use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn mr050 mr055 mr063 mr064 mr072 mr073 mr030 mr035 mr045 mq171_1 mq171_
> 2 mq171_3 mr007 mr013 mr024 ///
>     mr049 mr061 mr062 mr028 mr029 mq170_1 mq170_2 mq170_3 mr002 using "${HRS_DA
> TA}/hd10f6b.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        23,200
        from master                    23,200  
        from using                          0  

    Matched                            22,034  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_7: Merged 2010 flows. N = " _N
01_7: Merged 2010 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_8_merge_flow_2012.do"

. * 01_8_merge_flow_2012.do — merge 2012 flow vars from h12f3a (prefix N). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn nr050 nr055 nr063 nr064 nr072 nr073 nr030 nr035 nr045 nq171_1 nq171_
> 2 nq171_3 nr007 nr013 nr024 ///
>     nr049 nr061 nr062 nr028 nr029 nq170_1 nq170_2 nq170_3 nr002 using "${HRS_DA
> TA}/h12f3a.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        24,680
        from master                    24,680  
        from using                          0  

    Matched                            20,554  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_8: Merged 2012 flows. N = " _N
01_8: Merged 2012 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_9_merge_flow_2014.do"

. * 01_9_merge_flow_2014.do — merge 2014 flow vars from h14f2b (prefix O). Fat fi
> les use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn or050 or055 or063 or064 or072 or073 or030 or035 or045 oq171_1 oq171_
> 2 oq171_3 or007 or013 or024 ///
>     or049 or061 or062 or028 or029 oq170_1 oq170_2 oq170_3 or002 using "${HRS_DA
> TA}/h14f2b.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        26,487
        from master                    26,487  
        from using                          0  

    Matched                            18,747  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_9: Merged 2014 flows. N = " _N
01_9: Merged 2014 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_10_merge_flow_2016.do"

. * 01_10_merge_flow_2016.do — merge 2016 flow vars from h16f2c (prefix P). Fat f
> iles use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn pr050 pr055 pr063 pr064 pr072 pr073 pr030 pr035 pr045 pq171_1 pq171_
> 2 pq171_3 pr007 pr013 pr024 ///
>     pr049 pr061 pr062 pr028 pr029 pq170_1 pq170_2 pq170_3 pr002 using "${HRS_DA
> TA}/h16f2c.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        24,322
        from master                    24,322  
        from using                          0  

    Matched                            20,912  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_10: Merged 2016 flows. N = " _N
01_10: Merged 2016 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_11_merge_flow_2018.do"

. * 01_11_merge_flow_2018.do — merge 2018 flow vars from h18f2c (prefix Q). Fat f
> iles use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn qr050 qr055 qr063 qr064 qr072 qr073 qr030 qr035 qr045 qq171_1 qq171_
> 2 qq171_3 qr007 qr013 qr024 ///
>     qr049 qr061 qr062 qr028 qr029 qq170_1 qq170_2 qq170_3 qr002 using "${HRS_DA
> TA}/h18f2c.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        28,088
        from master                    28,088  
        from using                          0  

    Matched                            17,146  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_11: Merged 2018 flows. N = " _N
01_11: Merged 2018 flows. N = 45234

. 
end of do-file

. do "${RAW_DATA}/01_12_merge_flow_2020.do"

. * 01_12_merge_flow_2020.do — merge 2020 flow vars from h20f1a (prefix R). Fat f
> iles use lowercase + hhidpn.
. local scratch "${RAW_DATA}/_merge_scratch.dta"

. use "${CLEANED}/all_data_merged.dta", clear

. preserve

. use hhidpn rr050 rr055 rr063 rr064 rr072 rr073 rr030 rr035 rr045 rq171_1 rq171_
> 2 rq171_3 rr007 rr013 rr024 ///
>     rr049 rr061 rr062 rr028 rr029 rq170_1 rq170_2 rq170_3 rr002 using "${HRS_DA
> TA}/h20f1a.dta", clear

. save "`scratch'", replace
(file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta not found)
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Raw
    data/_merge_scratch.dta saved

. restore

. merge 1:1 hhidpn using "`scratch'", nogen

    Result                      Number of obs
    -----------------------------------------
    Not matched                        29,511
        from master                    29,511  
        from using                          0  

    Matched                            15,723  
    -----------------------------------------

. capture erase "`scratch'"

. * Special-value recode and flag-based 0 fill done in 02_process_flows.do (proce
> ssing step).
. 
. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "01_12: Merged 2020 flows. N = " _N
01_12: Merged 2020 flows. N = 45234

. 
end of do-file

. 
. * -----------------------------------------------------------------------------
> -
. * 5. Clean missing value codes for rv557-rv570: -9 and -8 only
. * -----------------------------------------------------------------------------
> -
. use "${CLEANED}/all_data_merged.dta", clear

. capture unab allrv : rv*_*

. if _rc == 0 {
.     foreach v of local allrv {
  2.         quietly replace `v' = . if inlist(`v', -9, -8)
  3.     }
. }

. save "${CLEANED}/all_data_merged.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned
    data/all_data_merged.dta saved

. display "Saved ${CLEANED}/all_data_merged.dta  (N = " _N ")"
Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Cleaned data/all_da
> ta_merged.dta  (N = 45234)

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/01_mer
> ge_all_data.log
  log type:  text
 closed on:  19 Feb 2026, 13:43:28
---------------------------------------------------------------------------------
