-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 opened on:  10 Feb 2026, 18:19:07

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_ready
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' r5_annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg r5_annual_avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_returns_income.do and 03_p
> rep_controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004
---------+------------------------------------------------------------------------------------------
       N |     13839      6934     13566      6713     14186     12995      6427     12697      6230
    Mean |  .3396622  .1886169  .1090722  .1307731  .1848722  .3029203  .3083907  .1063545  .1851812
      SD |  1.541005  1.047375  .5250122  .6565495  .6326632  1.425314  1.182581  .5481141  .6781613
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1        -1 -.7609543
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4259265 -.9086369 -.7999173 -.5451412 -.4799117
     p50 |  .0079683         0  .0660036  .0164603  .0789075  .0157756  .0709268  .0595106  .0654357
     p95 |  2.649658  1.823048  .7460757  1.196811  1.084809  2.464102  2.002999  .7507762  1.227771
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.682331  1.910959  2.631804
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292  10.61895  15.65697
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006  r5_~2006  r1_~2008  r2_~2008  r3_~2008
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7247     13772      6970     14292     13155      6735     12823
    Mean |  .1946736  .3239473  .3262825  .1479926  .1959171  .2383437  .3333812  .2615255  .0191759
      SD |  .5880471   1.65343  1.302864  .5879566  .6819433  .6626324  1.586558  1.017483   .464199
      p1 | -.6775097        -1        -1        -1 -.8039658 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5387344 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .0996786  .0940058  .0821008  .1186374  .0074907  .0602312         0
     p95 |  1.077448  2.403116  1.966479  .8641539  1.289254  1.201723  2.605551  1.923765  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  11.12834  69.89464  20.25135  25.27468  10.50237  14.88412  24.93995  13.09965  8.354143
----------------------------------------------------------------------------------------------------

   Stats |  r4_~2008  r5_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012
---------+------------------------------------------------------------------------------------------
       N |      6496     13284     11929      6129     11528      5926     11889     14018      7136
    Mean |  .1597092  .1434432  .2243223  .2312687 -.0333831  .0935677  .1037757  .2596012  .2308468
      SD |  .6429026  .5836195  1.549668  1.086622  .4485891  .5855996  .7769028  1.478589  1.170044
      p1 | -.7961735  -.729281        -1        -1        -1   -.78236 -.7930839        -1        -1
      p5 | -.5368095  -.460196        -1 -.8267949 -.7113249 -.5530107 -.4903043        -1        -1
     p50 |  .0477834   .046832 -.0526641  .0166924 -.0398133  .0052885  .0022376         0  .0369716
     p95 |  1.168572         1  2.278028  1.910762  .5374122  1.003842  .9920661  2.397546  1.898196
     p99 |  2.958517  2.421445   6.64635  5.125684   1.44949  2.430641  2.381849  6.472728   4.91608
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.647382  13.60593   30.6291  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228
----------------------------------------------------------------------------------------------------

   Stats |  r3_~2012  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014  r1_~2016
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6358     12496      5995     13041     11136
    Mean |  .0174181  .1159706  .1481473   .335425  .2840321  .0870768  .1730203  .2021447  .3009084
      SD |   .532927  .5818238  .6913277  1.675398  1.183632  .5695118  .6421902  .6832872   1.59319
      p1 |        -1 -.8756493 -.8179602        -1        -1        -1  -.839531 -.7965277        -1
      p5 | -.6600654 -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4508806        -1
     p50 |         0  .0354307  .0380672  .0207523  .0836325  .0297761  .0702015  .0806482  .0012243
     p95 |  .6457015  1.054829  1.070086  2.563706  1.994054  .8126539  1.193482  1.204541   2.57398
     p99 |  2.056931  2.367306  2.741768         7  5.403124  2.162278  2.785142  2.921935  6.937254
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.732125  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519  29.41156
----------------------------------------------------------------------------------------------------

   Stats |  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r5_~2018
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |  .2866775  .0837633  .1576778  .2086831  .3332256  .2998575   .104337  .1756961  .2293031
      SD |  1.235879  .5333981  .6894531  .7069182  1.850102  1.457984  .5772518  .6775247  .8541944
      p1 |        -1        -1  -.872792 -.8306918        -1        -1        -1 -.8559418 -.8102633
      p5 |        -1 -.6181187 -.5585142 -.4634546        -1        -1 -.6358617 -.5635265 -.4896031
     p50 |  .0422847   .041465  .0503055  .0761038  .0067374  .0613111  .0508033  .0707762  .0935655
     p95 |  2.027925  .7663522  1.141799  1.274624  2.676955  2.162278  .8257419  1.263184  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359    11.498  17.07862  52.74273
----------------------------------------------------------------------------------------------------

   Stats |  r1_~2020  r2_~2020  r3_~2020  r4_~2020  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022
---------+------------------------------------------------------------------------------------------
       N |      9539      4966      9911      4674     10395      8330      4431      8523      4152
    Mean |  .3558075  .2642764  .1003054   .145126  .2187182  .3785716  .3445914  .2032635   .200118
      SD |   1.64541  1.230544  .5717823  .6135485  .7287121  1.836335  1.412149  .6688735  .7291838
      p1 |        -1        -1        -1 -.7833597 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5397827 -.4672046        -1 -.8036039 -.5690029 -.5210837
     p50 |  .0319569  .0421834  .0488088  .0438695  .0764125  .0382838  .0887893  .1319231   .081766
     p95 |    2.8735  2.134042  .7888544  1.186608  1.353798  2.751666  1.974895  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.489861  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  28.18904   21.9638  14.09967  7.063589  26.14854  41.09515  24.23998  12.82027  13.01873
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+------------------------------------------------------------
       N |      9168     27784     15130     25975     14548     28341
    Mean |  .3230414   .256425  .2003307  .0566878  .1467673  .2208084
      SD |  .8597685  1.070319  .8406199  .4089999  .5165544  .5209462
      p1 | -.7842487        -1        -1        -1 -.9247556  -.770246
      p5 | -.4266178        -1        -1 -.6348516 -.5162661 -.3306858
     p50 |  .1545613  .1139262  .1155588  .0598376  .0958943  .1226826
     p95 |  1.609422  1.766544  1.458741  .5475788  .8874586  1.034315
     p99 |  3.653171  4.221698  2.872983  1.326594  1.988103  2.141008
     Min |        -1        -1        -1        -1        -1        -1
     Max |  19.67032  26.80398  16.80075  10.78983  13.01873  13.45894
----------------------------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(31,395 missing values generated)
(139 real changes made, 139 to missing)
(38,300 missing values generated)
(69 real changes made, 69 to missing)
(31,668 missing values generated)
(137 real changes made, 137 to missing)
(38,521 missing values generated)
(133 real changes made, 133 to missing)
(31,048 missing values generated)
(283 real changes made, 283 to missing)
(32,239 missing values generated)
(129 real changes made, 129 to missing)
(38,807 missing values generated)
(64 real changes made, 64 to missing)
(32,537 missing values generated)
(128 real changes made, 128 to missing)
(39,004 missing values generated)
(125 real changes made, 125 to missing)
(31,880 missing values generated)
(266 real changes made, 266 to missing)
(31,087 missing values generated)
(141 real changes made, 141 to missing)
(37,987 missing values generated)
(72 real changes made, 72 to missing)
(31,462 missing values generated)
(139 real changes made, 139 to missing)
(38,264 missing values generated)
(138 real changes made, 138 to missing)
(30,942 missing values generated)
(284 real changes made, 284 to missing)
(32,079 missing values generated)
(131 real changes made, 131 to missing)
(38,499 missing values generated)
(68 real changes made, 68 to missing)
(32,411 missing values generated)
(133 real changes made, 133 to missing)
(38,738 missing values generated)
(127 real changes made, 127 to missing)
(31,950 missing values generated)
(264 real changes made, 264 to missing)
(33,305 missing values generated)
(119 real changes made, 119 to missing)
(39,105 missing values generated)
(61 real changes made, 61 to missing)
(33,706 missing values generated)
(113 real changes made, 113 to missing)
(39,308 missing values generated)
(120 real changes made, 120 to missing)
(33,345 missing values generated)
(236 real changes made, 236 to missing)
(31,216 missing values generated)
(139 real changes made, 139 to missing)
(38,098 missing values generated)
(70 real changes made, 70 to missing)
(31,529 missing values generated)
(137 real changes made, 137 to missing)
(38,449 missing values generated)
(133 real changes made, 133 to missing)
(31,181 missing values generated)
(280 real changes made, 280 to missing)
(32,698 missing values generated)
(123 real changes made, 123 to missing)
(38,876 missing values generated)
(62 real changes made, 62 to missing)
(32,738 missing values generated)
(120 real changes made, 120 to missing)
(39,239 missing values generated)
(118 real changes made, 118 to missing)
(32,193 missing values generated)
(260 real changes made, 260 to missing)
(34,098 missing values generated)
(111 real changes made, 111 to missing)
(39,525 missing values generated)
(57 real changes made, 57 to missing)
(34,103 missing values generated)
(111 real changes made, 111 to missing)
(39,803 missing values generated)
(108 real changes made, 108 to missing)
(33,536 missing values generated)
(232 real changes made, 232 to missing)
(34,107 missing values generated)
(111 real changes made, 111 to missing)
(39,650 missing values generated)
(55 real changes made, 55 to missing)
(33,892 missing values generated)
(114 real changes made, 114 to missing)
(39,956 missing values generated)
(104 real changes made, 104 to missing)
(33,397 missing values generated)
(236 real changes made, 236 to missing)
(35,695 missing values generated)
(95 real changes made, 95 to missing)
(40,268 missing values generated)
(49 real changes made, 49 to missing)
(35,323 missing values generated)
(97 real changes made, 97 to missing)
(40,560 missing values generated)
(92 real changes made, 92 to missing)
(34,839 missing values generated)
(206 real changes made, 206 to missing)
(36,904 missing values generated)
(83 real changes made, 83 to missing)
(40,803 missing values generated)
(43 real changes made, 43 to missing)
(36,711 missing values generated)
(84 real changes made, 84 to missing)
(41,082 missing values generated)
(81 real changes made, 81 to missing)
(36,066 missing values generated)
(183 real changes made, 183 to missing)
(17,450 missing values generated)
(277 real changes made, 277 to missing)
(30,104 missing values generated)
(151 real changes made, 151 to missing)
(19,259 missing values generated)
(258 real changes made, 258 to missing)
(30,686 missing values generated)
(291 real changes made, 291 to missing)
(16,893 missing values generated)
(567 real changes made, 567 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |     13700      6865     13429      6580     13903     12866      6363     12569      6105
    Mean |   .234503   .122962  .0762108  .1007462  .1517041  .2073775  .2311523  .0704277  .1545074
      SD |  1.053662  .7571327  .3746522  .4885875  .4301164  .9695387  .7897159  .3727929  .4824247
      p1 |        -1        -1        -1 -.7165536 -.6031034        -1        -1        -1 -.6629001
      p5 | -.8940194        -1 -.5337476 -.5328462 -.3938097  -.909955 -.8104528 -.5480539 -.4491307
     p50 |  .0030075 -.0002003  .0623424  .0164483   .078838  .0114411  .0677879  .0567245  .0653036
     p95 |  2.275186  1.645751  .6745392  1.069663  .9708241  2.104151   1.74649  .6532796  1.113249
     p99 |  4.878539   3.08899  1.349153  1.894763   1.81029  4.291616  3.346033  1.265686  1.967221
     Min |        -1        -1        -1 -.8113064 -.6937918        -1        -1        -1 -.7609543
     Max |  6.844645  4.196152   1.95804  2.508917  2.675682   6.20243  4.682331  1.886751  2.599531
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+------------------------------------------------------------------------------------------
       N |     13088     14006      7175     13633      6832     14008     13024      6667     12690
    Mean |  .1663922  .2123221  .2335815  .1133527  .1656299  .2065837   .222764  .1993413 -.0106435
      SD |  .4130015  1.013846   .805237  .3978831  .4956153  .4734921  1.082296   .797455  .3357504
      p1 | -.5775652        -1        -1        -1 -.7152146 -.6210918        -1        -1        -1
      p5 | -.3647329 -.9552786        -1   -.53709 -.5040994  -.382586 -.9814037        -1 -.5728476
     p50 |  .0955945  .0142974  .0954451  .0897247  .0821008  .1186374  .0037938  .0561177         0
     p95 |  .9705163  2.162278    1.7313  .7593289   1.17409  1.100651  2.318147  1.690725        .5
     p99 |  1.729282  4.482554  3.527693  1.435843   1.92632  2.116775  5.123724   3.57802  1.081666
     Min | -.6775097        -1        -1        -1 -.8039658 -.7141943        -1        -1        -1
     Max |  2.477198  6.877563  5.449806  1.997601  2.572623  2.817026  7.103497  4.775812  1.618615
----------------------------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+------------------------------------------------------------------------------------------
       N |      6369     13020     11810      6068     11415      5806     11653     13879      7066
    Mean |  .1313931  .1168596  .1142589  .1605346 -.0602623  .0663088  .0700509  .1579306  .1539962
      SD |  .4903433  .4161425  .9846474  .7950852  .3371213  .4357159  .4233839  .9919995  .7990525
      p1 | -.6909023 -.6301772        -1        -1        -1 -.7130088 -.6761512        -1        -1
      p5 | -.4961685 -.4254837        -1 -.8294865 -.7247271 -.5239541 -.4573978        -1        -1
     p50 |  .0478437   .046832 -.0577547  .0130995 -.0419514  .0048732  .0022376         0  .0346923
     p95 |  1.073239  .9183278  1.999839    1.6603  .4687215  .8959416  .8695556  2.140838  1.688816
     p99 |  1.983203  1.774887  4.467073  3.617967  .9245009   1.54951  1.780887  4.477226  3.472136
     Min | -.7961735  -.729281        -1        -1        -1   -.78236 -.7930839        -1        -1
     Max |  2.958517  2.421445   6.64635  5.125684   1.44949  2.420211  2.381849  6.472728   4.91608
----------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+------------------------------------------------------------------------------------------
       N |     13568      6652     13773     12413      6296     12376      5877     12781     11025
    Mean | -.0182825  .0927415  .1126598   .224372  .2054428  .0497987  .1457014  .1695496  .1899521
      SD |  .3663141  .4524688  .4481693  1.057766  .8209029  .3990992  .4850465   .469675  1.064889
      p1 |        -1 -.7622113 -.6843536        -1        -1        -1 -.7452426 -.6623611        -1
      p5 | -.6619383 -.5455132 -.4572772        -1        -1 -.6006097 -.5081345 -.4111944        -1
     p50 |         0  .0354257  .0380672  .0148892  .0804491  .0281452  .0702015  .0806482         0
     p95 |  .5445931  .9449568  .9621417  2.282276  1.736177  .7230061  1.039986  1.077699  2.163683
     p99 |  1.236068  1.739428  1.920432  4.720776  3.729455  1.483277  2.035128  2.041671   4.91608
     Min |        -1 -.8756493 -.8179602        -1        -1        -1  -.839531 -.7965277        -1
     Max |  2.056931  2.367306  2.741768         7  5.403124  2.162278  2.785142  2.921935  6.937254
----------------------------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------------------------------------
       N |      5652     11020      5323     11466     11016      5529     11228      5174     11601
    Mean |  .2024728   .049653  .1258495  .1738184  .2117889   .207383  .0661651  .1472323  .1912799
      SD |  .8861669  .3909237   .475475  .4900443  1.103074   .863933  .4016166  .5005108  .5108821
      p1 |        -1        -1 -.7235945 -.6819202        -1        -1        -1  -.742163 -.6893688
      p5 |        -1 -.6205847 -.5143228  -.423343        -1        -1 -.6439655 -.5295392 -.4510124
     p50 |   .040833  .0397505  .0503055  .0761038  .0027707   .059222  .0488088  .0707762  .0935655
     p95 |   1.72826  .6747417     1.038  1.155597   2.34109  1.987195  .7320508  1.132743  1.197188
     p99 |  4.477226  1.345208  1.967014  2.181124  4.945587  3.966555  1.469818  2.047872  2.199792
     Min |        -1        -1  -.872792 -.8306918        -1        -1        -1 -.8559418 -.8102633
     Max |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301   2.22933   2.97907  3.083912
----------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |      9444      4917      9814      4582     10189      8247      4388      8439      4071
    Mean |   .244405  .1832918  .0640239  .1182089  .1859051  .2503438  .2422629   .160803  .1636371
      SD |  1.140538   .840394  .3961029  .4688841  .5158326   1.14561  .8620021  .4512171  .5006977
      p1 |        -1        -1        -1 -.7042663 -.6525958        -1        -1        -1 -.6898303
      p5 |        -1        -1 -.6013846 -.5029499 -.4343146        -1 -.8080499 -.5874315 -.4776279
     p50 |  .0255319  .0378473  .0478737  .0438695  .0764125  .0318477  .0849115   .129159  .0817462
     p95 |  2.424665  1.893441  .6903085  1.058981  1.208397  2.374056  1.713591  .9272482  1.090786
     p99 |  5.204837  3.799028   1.48998  1.847608  2.290862  5.448488  4.293156  1.730301  2.210039
     Min |        -1        -1        -1 -.7833597 -.7675047        -1        -1        -1 -.8203947
     Max |  7.575514  5.287554  2.162278  2.489861  3.106588  7.660254  6.271499  2.546681     2.833
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------
       N |      8985     27507     14979     25717     14257     27774
    Mean |  .2780923  .1868483  .1522798  .0346006  .1279839    .20017
      SD |  .5730132  .7435077  .6331342  .3247381  .3768656  .3722524
      p1 | -.6309601        -1        -1        -1 -.7714634 -.6090735
      p5 | -.3808035        -1        -1 -.6428571 -.4693966 -.2802292
     p50 |  .1544941  .1100575  .1119479  .0585784  .0958677  .1226713
     p95 |  1.428056  1.594414  1.318205  .4855696  .7907887  .9475073
     p99 |  2.582455  2.932882  2.213023   .942162  1.492362  1.584801
     Min | -.7842487        -1        -1        -1 -.9247556  -.770246
     Max |  3.652204  4.221698  2.872983  1.326594  1.976095   2.13823
----------------------------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004
---------+------------------------------------------------------------------------------------------
       N |     13839      6934     13566      6713     14186     12995      6427     12697      6230
    Mean |  .3396622  .1886169  .1090722  .1307731  .1848722  .3029203  .3083907  .1063545  .1851812
      SD |  1.541005  1.047375  .5250122  .6565495  .6326632  1.425314  1.182581  .5481141  .6781613
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1        -1 -.7609543
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4259265 -.9086369 -.7999173 -.5451412 -.4799117
     p50 |  .0079683         0  .0660036  .0164603  .0789075  .0157756  .0709268  .0595106  .0654357
     p95 |  2.649658  1.823048  .7460757  1.196811  1.084809  2.464102  2.002999  .7507762  1.227771
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.682331  1.910959  2.631804
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292  10.61895  15.65697
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006  r5_~2006  r1_~2008  r2_~2008  r3_~2008
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7247     13772      6970     14292     13155      6735     12823
    Mean |  .1946736  .3239473  .3262825  .1479926  .1959171  .2383437  .3333812  .2615255  .0191759
      SD |  .5880471   1.65343  1.302864  .5879566  .6819433  .6626324  1.586558  1.017483   .464199
      p1 | -.6775097        -1        -1        -1 -.8039658 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5387344 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .0996786  .0940058  .0821008  .1186374  .0074907  .0602312         0
     p95 |  1.077448  2.403116  1.966479  .8641539  1.289254  1.201723  2.605551  1.923765  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  11.12834  69.89464  20.25135  25.27468  10.50237  14.88412  24.93995  13.09965  8.354143
----------------------------------------------------------------------------------------------------

   Stats |  r4_~2008  r5_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012
---------+------------------------------------------------------------------------------------------
       N |      6496     13284     11929      6129     11528      5926     11889     14018      7136
    Mean |  .1597092  .1434432  .2243223  .2312687 -.0333831  .0935677  .1037757  .2596012  .2308468
      SD |  .6429026  .5836195  1.549668  1.086622  .4485891  .5855996  .7769028  1.478589  1.170044
      p1 | -.7961735  -.729281        -1        -1        -1   -.78236 -.7930839        -1        -1
      p5 | -.5368095  -.460196        -1 -.8267949 -.7113249 -.5530107 -.4903043        -1        -1
     p50 |  .0477834   .046832 -.0526641  .0166924 -.0398133  .0052885  .0022376         0  .0369716
     p95 |  1.168572         1  2.278028  1.910762  .5374122  1.003842  .9920661  2.397546  1.898196
     p99 |  2.958517  2.421445   6.64635  5.125684   1.44949  2.430641  2.381849  6.472728   4.91608
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.647382  13.60593   30.6291  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228
----------------------------------------------------------------------------------------------------

   Stats |  r3_~2012  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014  r1_~2016
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6358     12496      5995     13041     11136
    Mean |  .0174181  .1159706  .1481473   .335425  .2840321  .0870768  .1730203  .2021447  .3009084
      SD |   .532927  .5818238  .6913277  1.675398  1.183632  .5695118  .6421902  .6832872   1.59319
      p1 |        -1 -.8756493 -.8179602        -1        -1        -1  -.839531 -.7965277        -1
      p5 | -.6600654 -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4508806        -1
     p50 |         0  .0354307  .0380672  .0207523  .0836325  .0297761  .0702015  .0806482  .0012243
     p95 |  .6457015  1.054829  1.070086  2.563706  1.994054  .8126539  1.193482  1.204541   2.57398
     p99 |  2.056931  2.367306  2.741768         7  5.403124  2.162278  2.785142  2.921935  6.937254
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.732125  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519  29.41156
----------------------------------------------------------------------------------------------------

   Stats |  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r5_~2018
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |  .2866775  .0837633  .1576778  .2086831  .3332256  .2998575   .104337  .1756961  .2293031
      SD |  1.235879  .5333981  .6894531  .7069182  1.850102  1.457984  .5772518  .6775247  .8541944
      p1 |        -1        -1  -.872792 -.8306918        -1        -1        -1 -.8559418 -.8102633
      p5 |        -1 -.6181187 -.5585142 -.4634546        -1        -1 -.6358617 -.5635265 -.4896031
     p50 |  .0422847   .041465  .0503055  .0761038  .0067374  .0613111  .0508033  .0707762  .0935655
     p95 |  2.027925  .7663522  1.141799  1.274624  2.676955  2.162278  .8257419  1.263184  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359    11.498  17.07862  52.74273
----------------------------------------------------------------------------------------------------

   Stats |  r1_~2020  r2_~2020  r3_~2020  r4_~2020  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022
---------+------------------------------------------------------------------------------------------
       N |      9539      4966      9911      4674     10395      8330      4431      8523      4152
    Mean |  .3558075  .2642764  .1003054   .145126  .2187182  .3785716  .3445914  .2032635   .200118
      SD |   1.64541  1.230544  .5717823  .6135485  .7287121  1.836335  1.412149  .6688735  .7291838
      p1 |        -1        -1        -1 -.7833597 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5397827 -.4672046        -1 -.8036039 -.5690029 -.5210837
     p50 |  .0319569  .0421834  .0488088  .0438695  .0764125  .0382838  .0887893  .1319231   .081766
     p95 |    2.8735  2.134042  .7888544  1.186608  1.353798  2.751666  1.974895  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.489861  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  28.18904   21.9638  14.09967  7.063589  26.14854  41.09515  24.23998  12.82027  13.01873
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+------------------------------------------------------------
       N |      9168     27784     15130     25975     14548     28341
    Mean |  .3230414   .256425  .2003307  .0566878  .1467673  .2208084
      SD |  .8597685  1.070319  .8406199  .4089999  .5165544  .5209462
      p1 | -.7842487        -1        -1        -1 -.9247556  -.770246
      p5 | -.4266178        -1        -1 -.6348516 -.5162661 -.3306858
     p50 |  .1545613  .1139262  .1155588  .0598376  .0958943  .1226826
     p95 |  1.609422  1.766544  1.458741  .5475788  .8874586  1.034315
     p99 |  3.653171  4.221698  2.872983  1.326594  1.988103  2.141008
     Min |        -1        -1        -1        -1        -1        -1
     Max |  19.67032  26.80398  16.80075  10.78983  13.01873  13.45894
----------------------------------------------------------------------

. 
. * Winsorized names: stub_win_YYYY so 10_build_panel reshape long finds r1_annual_win_*, r4_annual_win_*, 
> r5_annual_win_*
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         if regexm("`v'", "_([0-9]{4})$") {
  8.             local vyear = regexs(1)
  9.             local vstub = regexr("`v'", "_[0-9]{4}$", "")
 10.             capture drop `vstub'_win_`vyear'
 11.             gen double `vstub'_win_`vyear' = `v'
 12.             replace `vstub'_win_`vyear' = `p1' if `vstub'_win_`vyear' < `p1' & !missing(`vstub'_win_`v
> year')
 13.             replace `vstub'_win_`vyear' = `p99' if `vstub'_win_`vyear' > `p99' & !missing(`vstub'_win_
> `vyear')
 14.             local retwin "`retwin' `vstub'_win_`vyear'"
 15.         }
 16.         else {
 17.             capture drop `v'_win
 18.             gen double `v'_win = `v'
 19.             replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 20.             replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 21.             local retwin "`retwin' `v'_win"
 22.         }
 23.     }
 24. }
(31,395 missing values generated)
(0 real changes made)
(139 real changes made)
(38,300 missing values generated)
(0 real changes made)
(69 real changes made)
(31,668 missing values generated)
(0 real changes made)
(137 real changes made)
(38,521 missing values generated)
(66 real changes made)
(67 real changes made)
(31,048 missing values generated)
(141 real changes made)
(142 real changes made)
(32,239 missing values generated)
(0 real changes made)
(129 real changes made)
(38,807 missing values generated)
(0 real changes made)
(64 real changes made)
(32,537 missing values generated)
(0 real changes made)
(128 real changes made)
(39,004 missing values generated)
(62 real changes made)
(63 real changes made)
(31,880 missing values generated)
(132 real changes made)
(134 real changes made)
(31,087 missing values generated)
(0 real changes made)
(141 real changes made)
(37,987 missing values generated)
(0 real changes made)
(72 real changes made)
(31,462 missing values generated)
(0 real changes made)
(139 real changes made)
(38,264 missing values generated)
(69 real changes made)
(69 real changes made)
(30,942 missing values generated)
(142 real changes made)
(142 real changes made)
(32,079 missing values generated)
(0 real changes made)
(131 real changes made)
(38,499 missing values generated)
(0 real changes made)
(68 real changes made)
(32,411 missing values generated)
(0 real changes made)
(133 real changes made)
(38,738 missing values generated)
(64 real changes made)
(63 real changes made)
(31,950 missing values generated)
(132 real changes made)
(132 real changes made)
(33,305 missing values generated)
(0 real changes made)
(119 real changes made)
(39,105 missing values generated)
(0 real changes made)
(61 real changes made)
(33,706 missing values generated)
(0 real changes made)
(113 real changes made)
(39,308 missing values generated)
(59 real changes made)
(61 real changes made)
(33,345 missing values generated)
(118 real changes made)
(118 real changes made)
(31,216 missing values generated)
(0 real changes made)
(139 real changes made)
(38,098 missing values generated)
(0 real changes made)
(70 real changes made)
(31,529 missing values generated)
(0 real changes made)
(137 real changes made)
(38,449 missing values generated)
(66 real changes made)
(67 real changes made)
(31,181 missing values generated)
(140 real changes made)
(140 real changes made)
(32,698 missing values generated)
(0 real changes made)
(123 real changes made)
(38,876 missing values generated)
(0 real changes made)
(62 real changes made)
(32,738 missing values generated)
(0 real changes made)
(120 real changes made)
(39,239 missing values generated)
(59 real changes made)
(59 real changes made)
(32,193 missing values generated)
(130 real changes made)
(130 real changes made)
(34,098 missing values generated)
(0 real changes made)
(111 real changes made)
(39,525 missing values generated)
(0 real changes made)
(57 real changes made)
(34,103 missing values generated)
(0 real changes made)
(111 real changes made)
(39,803 missing values generated)
(54 real changes made)
(54 real changes made)
(33,536 missing values generated)
(116 real changes made)
(116 real changes made)
(34,107 missing values generated)
(0 real changes made)
(111 real changes made)
(39,650 missing values generated)
(0 real changes made)
(55 real changes made)
(33,892 missing values generated)
(0 real changes made)
(114 real changes made)
(39,956 missing values generated)
(52 real changes made)
(52 real changes made)
(33,397 missing values generated)
(118 real changes made)
(118 real changes made)
(35,695 missing values generated)
(0 real changes made)
(95 real changes made)
(40,268 missing values generated)
(0 real changes made)
(49 real changes made)
(35,323 missing values generated)
(0 real changes made)
(97 real changes made)
(40,560 missing values generated)
(46 real changes made)
(46 real changes made)
(34,839 missing values generated)
(103 real changes made)
(103 real changes made)
(36,904 missing values generated)
(0 real changes made)
(83 real changes made)
(40,803 missing values generated)
(0 real changes made)
(43 real changes made)
(36,711 missing values generated)
(0 real changes made)
(84 real changes made)
(41,082 missing values generated)
(40 real changes made)
(41 real changes made)
(36,066 missing values generated)
(91 real changes made)
(92 real changes made)
(17,450 missing values generated)
(0 real changes made)
(277 real changes made)
(30,104 missing values generated)
(0 real changes made)
(151 real changes made)
(19,259 missing values generated)
(0 real changes made)
(258 real changes made)
(30,686 missing values generated)
(145 real changes made)
(146 real changes made)
(16,893 missing values generated)
(283 real changes made)
(284 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |     13839      6934     13566      6713     14186     12995      6427     12697      6230
    Mean |  .3011539  .1634941  .0953002  .1158142  .1687722  .2668898  .2754771  .0889824  .1704482
      SD |  1.239727  .8549975  .4179342  .5475666  .5029369   1.13311   .901556  .4139833  .5460955
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1        -1 -.7609543
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4259265 -.9086369 -.7999173 -.5451412 -.4799117
     p50 |  .0079683         0  .0660036  .0164603  .0789075  .0157756  .0709268  .0595106  .0654357
     p95 |  2.649658  1.823048  .7460757  1.196811  1.084809  2.464102  2.002999  .7507762  1.227771
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.682331  1.910959  2.631804
     Min |        -1        -1        -1 -.8113064 -.6937918        -1        -1        -1 -.7609543
     Max |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.682331  1.910959  2.631804
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7247     13772      6970     14292     13155      6735     12823
    Mean |  .1813771   .278753  .2854054  .1323946  .1798595  .2233716  .2912837  .2457926  .0065366
      SD |  .4777217  1.206663  .9537506  .4384954  .5542911  .5436838  1.275345  .9171129  .3737956
      p1 | -.6775097        -1        -1        -1 -.8039658 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5387344 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .0996786  .0940058  .0821008  .1186374  .0074907  .0602312         0
     p95 |  1.077448  2.403116  1.966479  .8641539  1.289254  1.201723  2.605551  1.923765  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min | -.6775097        -1        -1        -1 -.8039658 -.7141943        -1        -1        -1
     Max |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
----------------------------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+------------------------------------------------------------------------------------------
       N |      6496     13284     11929      6129     11528      5926     11889     14018      7136
    Mean |  .1496728  .1313518   .179421  .2099511 -.0454634  .0821969  .0844291   .220547  .2007094
      SD |  .5669265  .4789747  1.175284  .9321084  .3669636  .5004744  .4857283  1.168684  .9233212
      p1 | -.7961735  -.729281        -1        -1        -1   -.78236 -.7930839        -1        -1
      p5 | -.5368095  -.460196        -1 -.8267949 -.7113249 -.5530107 -.4903043        -1        -1
     p50 |  .0477834   .046832 -.0526641  .0166924 -.0398133  .0052885  .0022376         0  .0369716
     p95 |  1.168572         1  2.278028  1.910762  .5374122  1.003842  .9920661  2.397546  1.898196
     p99 |  2.958517  2.421445   6.64635  5.125684   1.44949  2.430641  2.381849  6.472728   4.91608
     Min | -.7961735  -.729281        -1        -1        -1   -.78236 -.7930839        -1        -1
     Max |  2.958517  2.421445   6.64635  5.125684   1.44949  2.430641  2.381849  6.472728   4.91608
----------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6358     12496      5995     13041     11136
    Mean |  .0024621  .1057823  .1295807  .2908527   .256128   .070085  .1619814  .1873566   .257207
      SD |  .4188875  .5106501  .5235092  1.246577  .9634451  .4474334  .5554295   .548368  1.253791
      p1 |        -1 -.8756493 -.8179602        -1        -1        -1  -.839531 -.7965277        -1
      p5 | -.6600654 -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4508806        -1
     p50 |         0  .0354307  .0380672  .0207523  .0836325  .0297761  .0702015  .0806482  .0012243
     p95 |  .6457015  1.054829  1.070086  2.563706  1.994054  .8126539  1.193482  1.204541   2.57398
     p99 |  2.056931  2.367306  2.741768         7  5.403124  2.162278  2.785142  2.921935  6.937254
     Min |        -1 -.8756493 -.8179602        -1        -1        -1  -.839531 -.7965277        -1
     Max |  2.056931  2.367306  2.741768         7  5.403124  2.162278  2.785142  2.921935  6.937254
----------------------------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |   .261529  .0702787  .1394711  .1915975  .2796762  .2627762   .087912  .1652487  .2101317
      SD |  1.059876   .439928  .5358224  .5680483  1.289207  1.023494  .4541565  .5780907  .5906437
      p1 |        -1        -1  -.872792 -.8306918        -1        -1        -1 -.8559418 -.8102633
      p5 |        -1 -.6181187 -.5585142 -.4634546        -1        -1 -.6358617 -.5635265 -.4896031
     p50 |  .0422847   .041465  .0503055  .0761038  .0067374  .0613111  .0508033  .0707762  .0935655
     p95 |  2.027925  .7663522  1.141799  1.274624  2.676955  2.162278  .8257419  1.263184  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1  -.872792 -.8306918        -1        -1        -1 -.8559418 -.8102633
     Max |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
----------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |      9539      4966      9911      4674     10395      8330      4431      8523      4152
    Mean |  .3174164   .233656  .0845597  .1326769   .205398  .3241761  .3007727  .1843175  .1805164
      SD |  1.348276  .9766672  .4450098  .5279058  .5949536  1.356852  1.041758  .5070959   .570291
      p1 |        -1        -1        -1 -.7833597 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5397827 -.4672046        -1 -.8036039 -.5690029 -.5210837
     p50 |  .0319569  .0421834  .0488088  .0438695  .0764125  .0382838  .0887893  .1319231   .081766
     p95 |    2.8735  2.134042  .7888544  1.186608  1.353798  2.751666  1.974895  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.489861  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1 -.7833597 -.7675047        -1        -1        -1 -.8203947
     Max |  7.575514  5.287554  2.162278  2.489861  3.106588  7.660254  6.271499  2.546681     2.833
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann~n  r2_ann~n  r3_ann~n  r4_ann~n  r5_ann~n
---------+------------------------------------------------------------
       N |      9168     27784     15130     25975     14548     28341
    Mean |  .3014163  .2270748  .1794329  .0474335   .136159  .2099287
      SD |  .6684087  .8414201  .6855663  .3475965  .4299918  .4276169
      p1 | -.7842487        -1        -1        -1 -.9247556  -.770246
      p5 | -.4266178        -1        -1 -.6348516 -.5162661 -.3306858
     p50 |  .1545613  .1139262  .1155588  .0598376  .0958943  .1226826
     p95 |  1.609422  1.766544  1.458741  .5475788  .8874586  1.034315
     p99 |  3.653171  4.221698  2.872983  1.326594  1.988103  2.141008
     Min | -.7842487        -1        -1        -1 -.9247556  -.770246
     Max |  3.653171  4.221698  2.872983  1.326594  1.988103  2.141008
----------------------------------------------------------------------

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_processed.dta
    saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta"
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_re
> ady_processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 closed on:  10 Feb 2026, 18:19:10
-----------------------------------------------------------------------------------------------------------
