---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_pro
> cessing_returns.log
  log type:  text
 opened on:  20 Feb 2026, 09:57:27

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_re
> ady
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' r5_
> annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg r5_annual_
> avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_
> returns_income.do and 03_prep_controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004
---------+----------------------------------------------------------------------
       N |     13839      6934     13566     13167     14209     12995      6427
    Mean |  .3396622  .1886169  .1090722  .3441784  .1758168  .3029203  .3083907
      SD |  1.541005  1.047375  .5250122  1.066634  .6228046  1.425314  1.182581
      p1 |        -1        -1        -1       -.9 -.7018664        -1        -1
      p5 | -.8911069        -1 -.5302583 -.6025773 -.4351646 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036    .08775  .0740954  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  2.114903  1.056174  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  4.525698  2.642344   6.20243  4.682331
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  15.50959  14.16723  25.46074  23.66292
--------------------------------------------------------------------------------

   Stats |  r3_~2004  r4_~2004  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006
---------+----------------------------------------------------------------------
       N |     12697     12385     13366     14147      7247     13772     13549
    Mean |  .1063545  .3914669  .1848193  .3239473  .3262825  .1479926  .4057343
      SD |  .5481141  1.072081  .5759689   1.65343  1.302864  .5879566  1.186242
      p1 |        -1 -.8868629 -.6837722        -1        -1        -1 -.9169884
      p5 | -.5451412 -.5665139 -.4042445 -.9483774        -1 -.5327307 -.6140775
     p50 |  .0595106  .1222444   .091249    .02053  .0996786  .0940058   .134864
     p95 |  .7507762  2.210815  1.050164  2.403116  1.966479  .8641539  2.172381
     p99 |  1.910959  4.666095  2.382784  6.877563  5.449806         2  5.120621
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  10.61895  16.32705  11.12834  69.89464  20.25135  25.27468  30.59211
--------------------------------------------------------------------------------

   Stats |  r5_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r5_~2008  r1_~2010
---------+----------------------------------------------------------------------
       N |     14312     13155      6735     12823     12502     13301     11929
    Mean |  .2268021  .3333812  .2615255  .0191759  .3942215  .1339386  .2243223
      SD |  .6592481  1.586558  1.017483   .464199  1.170403  .5776432  1.549668
      p1 | -.7306978        -1        -1        -1 -.9858579 -.7459685        -1
      p5 |  -.434101 -.9728337        -1 -.5686689 -.6261711 -.4665254        -1
     p50 |  .1129115  .0074907  .0602312         0  .1029324  .0423491 -.0526641
     p95 |  1.173106  2.605551  1.923765  .5811388  2.382963  .9808171  2.278028
     p99 |  2.817026  7.103497  4.800067  1.645751  5.332716  2.351145   6.64635
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  14.88412  24.93995  13.09965  8.354143  20.92797  13.60593   30.6291
--------------------------------------------------------------------------------

   Stats |  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012  r3_~2012
---------+----------------------------------------------------------------------
       N |      6129     11528     11306     11911     14018      7136     13705
    Mean |  .2312687 -.0333831  .2955035  .0939005  .2596012  .2308468  .0174181
      SD |  1.086622  .4485891  1.021396   .769818  1.478589  1.170044   .532927
      p1 |        -1        -1        -1   -.81623        -1        -1        -1
      p5 | -.8267949 -.7113249 -.6516088  -.496569        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0519827 -.0020664         0  .0369716         0
     p95 |  1.910762  .5374122  2.070179  .9569281  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  4.533714  2.326034  6.472728   4.91608  2.056931
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.19091  6.905694  15.04419  38.86622  32.21445  23.73228  7.732125
--------------------------------------------------------------------------------

   Stats |  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014
---------+----------------------------------------------------------------------
       N |     13243     14094     12536      6358     12496     11915     13090
    Mean |  .3347952  .1391659   .335425  .2840321  .0870768  .4324908  .1903294
      SD |  1.097774  .6899023  1.675398  1.183632  .5695118  1.166639  .6762376
      p1 |        -1 -.8300676        -1        -1        -1        -1 -.8306906
      p5 |  -.687526 -.5049804        -1        -1 -.5983903 -.6518703 -.4654775
     p50 |  .0822393  .0331484  .0207523  .0836325  .0297761  .1303745  .0754287
     p95 |  2.187779  1.054892  2.563706  1.994054  .8126539  2.494483  1.173184
     p99 |  4.434283  2.752777         7  5.403124  2.162278  5.215666  2.890794
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.27347  15.16014   53.0643  19.52766  10.63329  16.24622  16.48519
--------------------------------------------------------------------------------

   Stats |  r1_~2016  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018
---------+----------------------------------------------------------------------
       N |     11136      5709     11131     10487     11736     11127      5584
    Mean |  .3009084  .2866775  .0837633  .4201167  .1959939  .3332256  .2998575
      SD |   1.59319  1.235879  .5333981  1.233215  .6946864  1.850102  1.457984
      p1 |        -1        -1        -1        -1  -.858614        -1        -1
      p5 |        -1        -1 -.6181187 -.6770104  -.474818        -1        -1
     p50 |  .0012243  .0422847   .041465  .1051415  .0698138  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  2.464102  1.247625  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  5.178511  2.937395  7.017027  5.831301
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  29.41156  14.40202  9.148892  19.92291  12.13144  69.73189   58.4359
--------------------------------------------------------------------------------

   Stats |  r3_~2018  r4_~2018  r5_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------
       N |     11342     10483     11852      9539      4966      9911      9106
    Mean |   .104337  .4330157  .2129774  .3558075  .2642764  .1003054  .4540526
      SD |  .5772518  1.407289  .8426477   1.64541  1.230544  .5717823  1.388361
      p1 |        -1        -1 -.8493572        -1        -1        -1        -1
      p5 | -.6358617 -.7418011 -.5052658        -1        -1 -.5948098 -.6634611
     p50 |  .0508033   .118034  .0879593  .0319569  .0421834  .0488088  .1166198
     p95 |  .8257419  2.525499  1.299666    2.8735  2.134042  .7888544  2.588175
     p99 |  2.229795   5.12507  2.994329  7.575514  5.287554  2.162278  5.540472
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |    11.498  69.75614  52.74273  28.18904   21.9638  14.09967  30.34833
--------------------------------------------------------------------------------

   Stats |  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r5_~2022  r1_ann~g
---------+----------------------------------------------------------------------
       N |     10412      8330      4431      8523      8031      9183     27784
    Mean |  .2035568  .3785716  .3445914  .2032635  .5208448  .3040901   .256425
      SD |  .7214714  1.836335  1.412149  .6688735  1.443754  .8388391  1.070319
      p1 | -.8245884        -1        -1        -1        -1  -.825767        -1
      p5 | -.4864791        -1 -.8036039 -.5690029 -.6818938 -.4483227        -1
     p50 |  .0703343  .0382838  .0887893  .1319231  .1564856  .1474449  .1139262
     p95 |  1.320919  2.751666  1.974895  1.009975  2.838558   1.54951  1.766544
     p99 |  3.080809  7.660254  6.271499  2.546681  6.071068  3.530093  4.221698
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  26.14854  41.09515  24.23998  12.82027  25.58872  19.67032  26.80398
--------------------------------------------------------------------------------

   Stats |  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+----------------------------------------
       N |     15130     25975     26137     28327
    Mean |  .2003307  .0566878  .4014641  .2010574
      SD |  .8406199  .4089999  .8661099  .5163372
      p1 |        -1        -1        -1 -.8585786
      p5 |        -1 -.6348516 -.6150036 -.3675445
     p50 |  .1155588  .0598376  .2234342  .1140366
     p95 |  1.458741  .5475788  1.744271  .9831793
     p99 |  2.872983  1.326594  3.252513  2.080162
     Min |        -1        -1        -1        -1
     Max |  16.80075  10.78983  30.59211  17.47053
--------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(31,395 missing values generated)
(139 real changes made, 139 to missing)
(38,300 missing values generated)
(69 real changes made, 69 to missing)
(31,668 missing values generated)
(137 real changes made, 137 to missing)
(32,067 missing values generated)
(263 real changes made, 263 to missing)
(31,025 missing values generated)
(284 real changes made, 284 to missing)
(32,239 missing values generated)
(129 real changes made, 129 to missing)
(38,807 missing values generated)
(64 real changes made, 64 to missing)
(32,537 missing values generated)
(128 real changes made, 128 to missing)
(32,849 missing values generated)
(246 real changes made, 246 to missing)
(31,868 missing values generated)
(266 real changes made, 266 to missing)
(31,087 missing values generated)
(141 real changes made, 141 to missing)
(37,987 missing values generated)
(72 real changes made, 72 to missing)
(31,462 missing values generated)
(139 real changes made, 139 to missing)
(31,685 missing values generated)
(270 real changes made, 270 to missing)
(30,922 missing values generated)
(286 real changes made, 286 to missing)
(32,079 missing values generated)
(131 real changes made, 131 to missing)
(38,499 missing values generated)
(68 real changes made, 68 to missing)
(32,411 missing values generated)
(133 real changes made, 133 to missing)
(32,732 missing values generated)
(251 real changes made, 251 to missing)
(31,933 missing values generated)
(267 real changes made, 267 to missing)
(33,305 missing values generated)
(119 real changes made, 119 to missing)
(39,105 missing values generated)
(61 real changes made, 61 to missing)
(33,706 missing values generated)
(113 real changes made, 113 to missing)
(33,928 missing values generated)
(113 real changes made, 113 to missing)
(33,323 missing values generated)
(238 real changes made, 238 to missing)
(31,216 missing values generated)
(139 real changes made, 139 to missing)
(38,098 missing values generated)
(70 real changes made, 70 to missing)
(31,529 missing values generated)
(137 real changes made, 137 to missing)
(31,991 missing values generated)
(132 real changes made, 132 to missing)
(31,140 missing values generated)
(282 real changes made, 282 to missing)
(32,698 missing values generated)
(123 real changes made, 123 to missing)
(38,876 missing values generated)
(62 real changes made, 62 to missing)
(32,738 missing values generated)
(120 real changes made, 120 to missing)
(33,319 missing values generated)
(119 real changes made, 119 to missing)
(32,144 missing values generated)
(260 real changes made, 260 to missing)
(34,098 missing values generated)
(111 real changes made, 111 to missing)
(39,525 missing values generated)
(57 real changes made, 57 to missing)
(34,103 missing values generated)
(111 real changes made, 111 to missing)
(34,747 missing values generated)
(104 real changes made, 104 to missing)
(33,498 missing values generated)
(234 real changes made, 234 to missing)
(34,107 missing values generated)
(111 real changes made, 111 to missing)
(39,650 missing values generated)
(55 real changes made, 55 to missing)
(33,892 missing values generated)
(114 real changes made, 114 to missing)
(34,751 missing values generated)
(104 real changes made, 104 to missing)
(33,382 missing values generated)
(236 real changes made, 236 to missing)
(35,695 missing values generated)
(95 real changes made, 95 to missing)
(40,268 missing values generated)
(49 real changes made, 49 to missing)
(35,323 missing values generated)
(97 real changes made, 97 to missing)
(36,128 missing values generated)
(91 real changes made, 91 to missing)
(34,822 missing values generated)
(209 real changes made, 209 to missing)
(36,904 missing values generated)
(83 real changes made, 83 to missing)
(40,803 missing values generated)
(43 real changes made, 43 to missing)
(36,711 missing values generated)
(84 real changes made, 84 to missing)
(37,203 missing values generated)
(80 real changes made, 80 to missing)
(36,051 missing values generated)
(182 real changes made, 182 to missing)
(17,450 missing values generated)
(277 real changes made, 277 to missing)
(30,104 missing values generated)
(151 real changes made, 151 to missing)
(19,259 missing values generated)
(258 real changes made, 258 to missing)
(19,097 missing values generated)
(262 real changes made, 262 to missing)
(16,907 missing values generated)
(565 real changes made, 565 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13700      6865     13429     12904     13925     12866      6363
    Mean |   .234503   .122962  .0762108  .2884248  .1438009  .2073775  .2311523
      SD |  1.053662  .7571327  .3746522   .779671    .42654  .9695387  .7897159
      p1 |        -1        -1        -1  -.775996 -.6142551        -1        -1
      p5 | -.8940194        -1 -.5337476 -.5628135 -.4006476  -.909955 -.8104528
     p50 |  .0030075 -.0002003  .0623424  .0877427  .0740954  .0114411  .0677879
     p95 |  2.275186  1.645751  .6745392   1.90037   .951013  2.104151   1.74649
     p99 |  4.878539   3.08899  1.349153  3.312772  1.785165  4.291616  3.346033
     Min |        -1        -1        -1       -.9 -.7018664        -1        -1
     Max |  6.844645  4.196152   1.95804  4.517971  2.642344   6.20243  4.682331
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12569     12139     13100     14006      7175     13633     13279
    Mean |  .0704277  .3381421   .158086  .2123221  .2335815  .1133527  .3427765
      SD |  .3727929  .8001644  .4058035  1.013846   .805237  .3978831  .8205799
      p1 |        -1 -.7566895  -.586569        -1        -1        -1 -.8047678
      p5 | -.5480539 -.5281526 -.3688987 -.9552786        -1   -.53709 -.5763912
     p50 |  .0567245  .1222444   .091249  .0142974  .0954451  .0897247   .134864
     p95 |  .6532796  1.983421  .9482939  2.162278    1.7313  .7593289   1.95478
     p99 |  1.265686  3.474868  1.670561  4.482554  3.527693  1.435843  3.548155
     Min |        -1 -.8868629 -.6837722        -1        -1        -1 -.9169884
     Max |  1.886751  4.666095  2.382784  6.877563  5.449806  1.997601  5.120621
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14026     13024      6667     12690     12251     13034     11810
    Mean |  .1948451   .222764  .1993413 -.0106435  .3332023  .1077282  .1142589
      SD |  .4658779  1.082296   .797455  .3357504  .8604346  .4102449  .9846474
      p1 |  -.630859        -1        -1        -1 -.8194809 -.6416493        -1
      p5 | -.3929992 -.9814037        -1 -.5728476  -.589992 -.4322028        -1
     p50 |  .1129115  .0037938  .0561177         0  .1029129  .0423271 -.0577547
     p95 |  1.073826  2.318147  1.690725        .5  2.150517  .8989471  1.999839
     p99 |  2.072133  5.123724   3.57802  1.081666   3.72789  1.761116  4.467073
     Min | -.7306978        -1        -1        -1 -.9858579 -.7459685        -1
     Max |  2.817026  7.103497  4.775812  1.618615  5.274552   2.35106   6.64635
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6068     11415     11193     11673     13879      7066     13568
    Mean |  .1605346 -.0602623    .23197   .060589  .1579306  .1539962 -.0182825
      SD |  .7950852  .3371213  .7825364  .4128546  .9919995  .7990525  .3663141
      p1 |        -1        -1        -1 -.6853733        -1        -1        -1
      p5 | -.8294865 -.7247271 -.6550009 -.4613697        -1        -1 -.6619383
     p50 |  .0130995 -.0419514  .0462552 -.0020664         0  .0346923         0
     p95 |    1.6603  .4687215  1.828427  .8413706  2.140838  1.688816  .5445931
     p99 |  3.617967  .9245009  3.298837  1.742665  4.477226  3.472136  1.236068
     Min |        -1        -1        -1   -.81623        -1        -1        -1
     Max |  5.125684   1.44949  4.533714  2.326034  6.472728   4.91608  2.056931
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |     13111     13812     12413      6296     12376     11796     12830
    Mean |  .2667245  .1031025   .224372  .2054428  .0497987  .3614039  .1583216
      SD |  .8137963  .4425337  1.057766  .8209029  .3990992  .9019562  .4651098
      p1 |        -1  -.692331        -1        -1        -1        -1    -.6961
      p5 | -.6901713 -.4662201        -1        -1 -.6006097 -.6547947 -.4259304
     p50 |  .0782554  .0331385  .0148892  .0804491  .0281452  .1252444  .0754287
     p95 |  2.001333  .9473848  2.282276  1.736177  .7230061  2.303029  1.045029
     p99 |  3.437342  1.875878  4.720776  3.729455  1.483277  3.758151  2.034885
     Min |        -1 -.8300676        -1        -1        -1        -1 -.8306906
     Max |  4.434283    2.7461         7  5.403124  2.162278  5.215666  2.890794
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11025      5652     11020     10383     11502     11016      5529
    Mean |  .1899521  .2024728   .049653  .3414385  .1622037  .2117889   .207383
      SD |  1.064889  .8861669  .3909237  .9064482  .4837056  1.103074   .863933
      p1 |        -1        -1        -1        -1   -.70829        -1        -1
      p5 |        -1        -1 -.6205847 -.6810207 -.4357225        -1        -1
     p50 |         0   .040833  .0397505  .0991605  .0698138  .0027707   .059222
     p95 |  2.163683   1.72826  .6747417  2.253204  1.114882   2.34109  1.987195
     p99 |   4.91608  4.477226  1.345208  3.975339  2.143566  4.945587  3.966555
     Min |        -1        -1        -1        -1  -.858614        -1        -1
     Max |  6.937254  6.117423  2.117991  5.178511  2.937395  7.017027  5.831301
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11228     10379     11616      9444      4917      9814      9015
    Mean |  .0661651  .3513526  .1757819   .244405  .1832918  .0640239  .3643244
      SD |  .4016166  .9340576  .4986106  1.140538   .840394  .3961029  .9508985
      p1 |        -1        -1 -.7113563        -1        -1        -1        -1
      p5 | -.6439655 -.7427447 -.4679533        -1        -1 -.6013846 -.6683375
     p50 |  .0488088  .1138357  .0879593  .0255319  .0378473  .0478737  .1114759
     p95 |  .7320508  2.306856  1.145462  2.424665  1.893441  .6903085  2.317469
     p99 |  1.469818         4   2.15119  5.204837  3.799028   1.48998  4.158294
     Min |        -1        -1 -.8493572        -1        -1        -1        -1
     Max |   2.22933   5.12507  2.994329  7.575514  5.287554  2.162278  5.540472
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     10203      8247      4388      8439      7951      9001     27507
    Mean |  .1709862  .2503438  .2422629   .160803  .4281977  .2613418  .1868483
      SD |  .5073389   1.14561  .8620021  .4512171  1.017677  .5591866  .7435077
      p1 | -.6827772        -1        -1        -1        -1 -.6712362        -1
      p5 | -.4487405        -1 -.8080499 -.5874315 -.6837722 -.4048675        -1
     p50 |  .0703271  .0318477  .0849115   .129159  .1509554  .1474449  .1100575
     p95 |  1.167948  2.374056  1.713591  .9272482  2.560768  1.373815  1.594414
     p99 |  2.215456  5.448488  4.293156  1.730301  4.477408  2.538135  2.932882
     Min | -.8245884        -1        -1        -1        -1  -.825767        -1
     Max |   3.07862  7.660254  6.271499  2.546681  6.071068  3.530093  4.221698
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------
       N |     14979     25717     25875     27762
    Mean |  .1522798  .0346006  .3521277  .1812476
      SD |  .6331342  .3247381  .6475129  .3652695
      p1 |        -1        -1        -1 -.6659341
      p5 |        -1 -.6428571  -.619618 -.3121626
     p50 |  .1119479  .0585784  .2188395  .1140363
     p95 |  1.318205  .4855696  1.622073  .8970708
     p99 |  2.213023   .942162  2.449638  1.523754
     Min |        -1        -1        -1 -.8585786
     Max |  2.872983  1.326594   3.25218  2.080162
--------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004
---------+----------------------------------------------------------------------
       N |     13839      6934     13566     13167     14209     12995      6427
    Mean |  .3396622  .1886169  .1090722  .3441784  .1758168  .3029203  .3083907
      SD |  1.541005  1.047375  .5250122  1.066634  .6228046  1.425314  1.182581
      p1 |        -1        -1        -1       -.9 -.7018664        -1        -1
      p5 | -.8911069        -1 -.5302583 -.6025773 -.4351646 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036    .08775  .0740954  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  2.114903  1.056174  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  4.525698  2.642344   6.20243  4.682331
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  15.50959  14.16723  25.46074  23.66292
--------------------------------------------------------------------------------

   Stats |  r3_~2004  r4_~2004  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006
---------+----------------------------------------------------------------------
       N |     12697     12385     13366     14147      7247     13772     13549
    Mean |  .1063545  .3914669  .1848193  .3239473  .3262825  .1479926  .4057343
      SD |  .5481141  1.072081  .5759689   1.65343  1.302864  .5879566  1.186242
      p1 |        -1 -.8868629 -.6837722        -1        -1        -1 -.9169884
      p5 | -.5451412 -.5665139 -.4042445 -.9483774        -1 -.5327307 -.6140775
     p50 |  .0595106  .1222444   .091249    .02053  .0996786  .0940058   .134864
     p95 |  .7507762  2.210815  1.050164  2.403116  1.966479  .8641539  2.172381
     p99 |  1.910959  4.666095  2.382784  6.877563  5.449806         2  5.120621
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  10.61895  16.32705  11.12834  69.89464  20.25135  25.27468  30.59211
--------------------------------------------------------------------------------

   Stats |  r5_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r5_~2008  r1_~2010
---------+----------------------------------------------------------------------
       N |     14312     13155      6735     12823     12502     13301     11929
    Mean |  .2268021  .3333812  .2615255  .0191759  .3942215  .1339386  .2243223
      SD |  .6592481  1.586558  1.017483   .464199  1.170403  .5776432  1.549668
      p1 | -.7306978        -1        -1        -1 -.9858579 -.7459685        -1
      p5 |  -.434101 -.9728337        -1 -.5686689 -.6261711 -.4665254        -1
     p50 |  .1129115  .0074907  .0602312         0  .1029324  .0423491 -.0526641
     p95 |  1.173106  2.605551  1.923765  .5811388  2.382963  .9808171  2.278028
     p99 |  2.817026  7.103497  4.800067  1.645751  5.332716  2.351145   6.64635
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  14.88412  24.93995  13.09965  8.354143  20.92797  13.60593   30.6291
--------------------------------------------------------------------------------

   Stats |  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012  r3_~2012
---------+----------------------------------------------------------------------
       N |      6129     11528     11306     11911     14018      7136     13705
    Mean |  .2312687 -.0333831  .2955035  .0939005  .2596012  .2308468  .0174181
      SD |  1.086622  .4485891  1.021396   .769818  1.478589  1.170044   .532927
      p1 |        -1        -1        -1   -.81623        -1        -1        -1
      p5 | -.8267949 -.7113249 -.6516088  -.496569        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0519827 -.0020664         0  .0369716         0
     p95 |  1.910762  .5374122  2.070179  .9569281  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  4.533714  2.326034  6.472728   4.91608  2.056931
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.19091  6.905694  15.04419  38.86622  32.21445  23.73228  7.732125
--------------------------------------------------------------------------------

   Stats |  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014
---------+----------------------------------------------------------------------
       N |     13243     14094     12536      6358     12496     11915     13090
    Mean |  .3347952  .1391659   .335425  .2840321  .0870768  .4324908  .1903294
      SD |  1.097774  .6899023  1.675398  1.183632  .5695118  1.166639  .6762376
      p1 |        -1 -.8300676        -1        -1        -1        -1 -.8306906
      p5 |  -.687526 -.5049804        -1        -1 -.5983903 -.6518703 -.4654775
     p50 |  .0822393  .0331484  .0207523  .0836325  .0297761  .1303745  .0754287
     p95 |  2.187779  1.054892  2.563706  1.994054  .8126539  2.494483  1.173184
     p99 |  4.434283  2.752777         7  5.403124  2.162278  5.215666  2.890794
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.27347  15.16014   53.0643  19.52766  10.63329  16.24622  16.48519
--------------------------------------------------------------------------------

   Stats |  r1_~2016  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018
---------+----------------------------------------------------------------------
       N |     11136      5709     11131     10487     11736     11127      5584
    Mean |  .3009084  .2866775  .0837633  .4201167  .1959939  .3332256  .2998575
      SD |   1.59319  1.235879  .5333981  1.233215  .6946864  1.850102  1.457984
      p1 |        -1        -1        -1        -1  -.858614        -1        -1
      p5 |        -1        -1 -.6181187 -.6770104  -.474818        -1        -1
     p50 |  .0012243  .0422847   .041465  .1051415  .0698138  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  2.464102  1.247625  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  5.178511  2.937395  7.017027  5.831301
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  29.41156  14.40202  9.148892  19.92291  12.13144  69.73189   58.4359
--------------------------------------------------------------------------------

   Stats |  r3_~2018  r4_~2018  r5_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------
       N |     11342     10483     11852      9539      4966      9911      9106
    Mean |   .104337  .4330157  .2129774  .3558075  .2642764  .1003054  .4540526
      SD |  .5772518  1.407289  .8426477   1.64541  1.230544  .5717823  1.388361
      p1 |        -1        -1 -.8493572        -1        -1        -1        -1
      p5 | -.6358617 -.7418011 -.5052658        -1        -1 -.5948098 -.6634611
     p50 |  .0508033   .118034  .0879593  .0319569  .0421834  .0488088  .1166198
     p95 |  .8257419  2.525499  1.299666    2.8735  2.134042  .7888544  2.588175
     p99 |  2.229795   5.12507  2.994329  7.575514  5.287554  2.162278  5.540472
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |    11.498  69.75614  52.74273  28.18904   21.9638  14.09967  30.34833
--------------------------------------------------------------------------------

   Stats |  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r5_~2022  r1_ann~g
---------+----------------------------------------------------------------------
       N |     10412      8330      4431      8523      8031      9183     27784
    Mean |  .2035568  .3785716  .3445914  .2032635  .5208448  .3040901   .256425
      SD |  .7214714  1.836335  1.412149  .6688735  1.443754  .8388391  1.070319
      p1 | -.8245884        -1        -1        -1        -1  -.825767        -1
      p5 | -.4864791        -1 -.8036039 -.5690029 -.6818938 -.4483227        -1
     p50 |  .0703343  .0382838  .0887893  .1319231  .1564856  .1474449  .1139262
     p95 |  1.320919  2.751666  1.974895  1.009975  2.838558   1.54951  1.766544
     p99 |  3.080809  7.660254  6.271499  2.546681  6.071068  3.530093  4.221698
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  26.14854  41.09515  24.23998  12.82027  25.58872  19.67032  26.80398
--------------------------------------------------------------------------------

   Stats |  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+----------------------------------------
       N |     15130     25975     26137     28327
    Mean |  .2003307  .0566878  .4014641  .2010574
      SD |  .8406199  .4089999  .8661099  .5163372
      p1 |        -1        -1        -1 -.8585786
      p5 |        -1 -.6348516 -.6150036 -.3675445
     p50 |  .1155588  .0598376  .2234342  .1140366
     p95 |  1.458741  .5475788  1.744271  .9831793
     p99 |  2.872983  1.326594  3.252513  2.080162
     Min |        -1        -1        -1        -1
     Max |  16.80075  10.78983  30.59211  17.47053
--------------------------------------------------

. 
. * Winsorized names: stub_win_YYYY so 10_build_panel reshape long finds r1_annua
> l_win_*, r4_annual_win_*, r5_annual_win_*
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         if regexm("`v'", "_([0-9]{4})$") {
  8.             local vyear = regexs(1)
  9.             local vstub = regexr("`v'", "_[0-9]{4}$", "")
 10.             capture drop `vstub'_win_`vyear'
 11.             gen double `vstub'_win_`vyear' = `v'
 12.             replace `vstub'_win_`vyear' = `p1' if `vstub'_win_`vyear' < `p1'
>  & !missing(`vstub'_win_`vyear')
 13.             replace `vstub'_win_`vyear' = `p99' if `vstub'_win_`vyear' > `p9
> 9' & !missing(`vstub'_win_`vyear')
 14.             local retwin "`retwin' `vstub'_win_`vyear'"
 15.         }
 16.         else {
 17.             capture drop `v'_win
 18.             gen double `v'_win = `v'
 19.             replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 20.             replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 21.             local retwin "`retwin' `v'_win"
 22.         }
 23.     }
 24. }
(31,395 missing values generated)
(0 real changes made)
(139 real changes made)
(38,300 missing values generated)
(0 real changes made)
(69 real changes made)
(31,668 missing values generated)
(0 real changes made)
(137 real changes made)
(32,067 missing values generated)
(131 real changes made)
(132 real changes made)
(31,025 missing values generated)
(142 real changes made)
(142 real changes made)
(32,239 missing values generated)
(0 real changes made)
(129 real changes made)
(38,807 missing values generated)
(0 real changes made)
(64 real changes made)
(32,537 missing values generated)
(0 real changes made)
(128 real changes made)
(32,849 missing values generated)
(123 real changes made)
(123 real changes made)
(31,868 missing values generated)
(133 real changes made)
(133 real changes made)
(31,087 missing values generated)
(0 real changes made)
(141 real changes made)
(37,987 missing values generated)
(0 real changes made)
(72 real changes made)
(31,462 missing values generated)
(0 real changes made)
(139 real changes made)
(31,685 missing values generated)
(135 real changes made)
(135 real changes made)
(30,922 missing values generated)
(143 real changes made)
(143 real changes made)
(32,079 missing values generated)
(0 real changes made)
(131 real changes made)
(38,499 missing values generated)
(0 real changes made)
(68 real changes made)
(32,411 missing values generated)
(0 real changes made)
(133 real changes made)
(32,732 missing values generated)
(125 real changes made)
(126 real changes made)
(31,933 missing values generated)
(133 real changes made)
(134 real changes made)
(33,305 missing values generated)
(0 real changes made)
(119 real changes made)
(39,105 missing values generated)
(0 real changes made)
(61 real changes made)
(33,706 missing values generated)
(0 real changes made)
(113 real changes made)
(33,928 missing values generated)
(0 real changes made)
(113 real changes made)
(33,323 missing values generated)
(119 real changes made)
(119 real changes made)
(31,216 missing values generated)
(0 real changes made)
(139 real changes made)
(38,098 missing values generated)
(0 real changes made)
(70 real changes made)
(31,529 missing values generated)
(0 real changes made)
(137 real changes made)
(31,991 missing values generated)
(0 real changes made)
(132 real changes made)
(31,140 missing values generated)
(140 real changes made)
(142 real changes made)
(32,698 missing values generated)
(0 real changes made)
(123 real changes made)
(38,876 missing values generated)
(0 real changes made)
(62 real changes made)
(32,738 missing values generated)
(0 real changes made)
(120 real changes made)
(33,319 missing values generated)
(0 real changes made)
(119 real changes made)
(32,144 missing values generated)
(130 real changes made)
(130 real changes made)
(34,098 missing values generated)
(0 real changes made)
(111 real changes made)
(39,525 missing values generated)
(0 real changes made)
(57 real changes made)
(34,103 missing values generated)
(0 real changes made)
(111 real changes made)
(34,747 missing values generated)
(0 real changes made)
(104 real changes made)
(33,498 missing values generated)
(117 real changes made)
(117 real changes made)
(34,107 missing values generated)
(0 real changes made)
(111 real changes made)
(39,650 missing values generated)
(0 real changes made)
(55 real changes made)
(33,892 missing values generated)
(0 real changes made)
(114 real changes made)
(34,751 missing values generated)
(0 real changes made)
(104 real changes made)
(33,382 missing values generated)
(118 real changes made)
(118 real changes made)
(35,695 missing values generated)
(0 real changes made)
(95 real changes made)
(40,268 missing values generated)
(0 real changes made)
(49 real changes made)
(35,323 missing values generated)
(0 real changes made)
(97 real changes made)
(36,128 missing values generated)
(0 real changes made)
(91 real changes made)
(34,822 missing values generated)
(104 real changes made)
(105 real changes made)
(36,904 missing values generated)
(0 real changes made)
(83 real changes made)
(40,803 missing values generated)
(0 real changes made)
(43 real changes made)
(36,711 missing values generated)
(0 real changes made)
(84 real changes made)
(37,203 missing values generated)
(0 real changes made)
(80 real changes made)
(36,051 missing values generated)
(91 real changes made)
(91 real changes made)
(17,450 missing values generated)
(0 real changes made)
(277 real changes made)
(30,104 missing values generated)
(0 real changes made)
(151 real changes made)
(19,259 missing values generated)
(0 real changes made)
(258 real changes made)
(19,097 missing values generated)
(0 real changes made)
(262 real changes made)
(16,907 missing values generated)
(282 real changes made)
(283 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13839      6934     13566     13167     14209     12995      6427
    Mean |  .3011539  .1634941  .0953002  .3190799  .1603192  .2668898  .2754771
      SD |  1.239727  .8549975  .4179342  .8881809  .4975604   1.13311   .901556
      p1 |        -1        -1        -1       -.9 -.7018664        -1        -1
      p5 | -.8911069        -1 -.5302583 -.6025773 -.4351646 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036    .08775  .0740954  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  2.114903  1.056174  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  4.525698  2.642344   6.20243  4.682331
     Min |        -1        -1        -1       -.9 -.7018664        -1        -1
     Max |  6.870338  4.196152  1.966479  4.525698  2.642344   6.20243  4.682331
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12697     12385     13366     14147      7247     13772     13549
    Mean |  .0889824  .3689586  .1718461   .278753  .2854054  .1323946  .3778301
      SD |  .4139833  .9096927  .4663845  1.206663  .9537506  .4384954  .9497296
      p1 |        -1 -.8868629 -.6837722        -1        -1        -1 -.9169884
      p5 | -.5451412 -.5665139 -.4042445 -.9483774        -1 -.5327307 -.6140775
     p50 |  .0595106  .1222444   .091249    .02053  .0996786  .0940058   .134864
     p95 |  .7507762  2.210815  1.050164  2.403116  1.966479  .8641539  2.172381
     p99 |  1.910959  4.666095  2.382784  6.877563  5.449806         2  5.120621
     Min |        -1 -.8868629 -.6837722        -1        -1        -1 -.9169884
     Max |  1.910959  4.666095  2.382784  6.877563  5.449806         2  5.120621
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14312     13155      6735     12823     12502     13301     11929
    Mean |  .2117972  .2912837  .2457926  .0065366  .3704008   .121793   .179421
      SD |  .5382216  1.275345  .9171129  .3737956  .9967084  .4719322  1.175284
      p1 | -.7306978        -1        -1        -1 -.9858579 -.7459685        -1
      p5 |  -.434101 -.9728337        -1 -.5686689 -.6261711 -.4665254        -1
     p50 |  .1129115  .0074907  .0602312         0  .1029324  .0423491 -.0526641
     p95 |  1.173106  2.605551  1.923765  .5811388  2.382963  .9808171  2.278028
     p99 |  2.817026  7.103497  4.800067  1.645751  5.332716  2.351145   6.64635
     Min | -.7306978        -1        -1        -1 -.9858579 -.7459685        -1
     Max |  2.817026  7.103497  4.800067  1.645751  5.332716  2.351145   6.64635
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6129     11528     11306     11911     14018      7136     13705
    Mean |  .2099511 -.0454634  .2749646  .0744624   .220547  .2007094  .0024621
      SD |  .9321084  .3669636  .8884604   .475196  1.168684  .9233212  .4188875
      p1 |        -1        -1        -1   -.81623        -1        -1        -1
      p5 | -.8267949 -.7113249 -.6516088  -.496569        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0519827 -.0020664         0  .0369716         0
     p95 |  1.910762  .5374122  2.070179  .9569281  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  4.533714  2.326034  6.472728   4.91608  2.056931
     Min |        -1        -1        -1   -.81623        -1        -1        -1
     Max |  5.125684   1.44949  4.533714  2.326034  6.472728   4.91608  2.056931
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |     13243     14094     12536      6358     12496     11915     13090
    Mean |  .3082648  .1205291  .2908527   .256128   .070085  .4098854  .1756363
      SD |  .9094348  .5205815  1.246577  .9634451  .4474334  1.019024  .5436925
      p1 |        -1 -.8300676        -1        -1        -1        -1 -.8306906
      p5 |  -.687526 -.5049804        -1        -1 -.5983903 -.6518703 -.4654775
     p50 |  .0822393  .0331484  .0207523  .0836325  .0297761  .1303745  .0754287
     p95 |  2.187779  1.054892  2.563706  1.994054  .8126539  2.494483  1.173184
     p99 |  4.434283  2.752777         7  5.403124  2.162278  5.215666  2.890794
     Min |        -1 -.8300676        -1        -1        -1        -1 -.8306906
     Max |  4.434283  2.752777         7  5.403124  2.162278  5.215666  2.890794
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11136      5709     11131     10487     11736     11127      5584
    Mean |   .257207   .261529  .0702787   .389408  .1796936  .2796762  .2627762
      SD |  1.253791  1.059876   .439928  1.021397  .5622957  1.289207  1.023494
      p1 |        -1        -1        -1        -1  -.858614        -1        -1
      p5 |        -1        -1 -.6181187 -.6770104  -.474818        -1        -1
     p50 |  .0012243  .0422847   .041465  .1051415  .0698138  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  2.464102  1.247625  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  5.178511  2.937395  7.017027  5.831301
     Min |        -1        -1        -1        -1  -.858614        -1        -1
     Max |  6.937254  6.117423  2.117991  5.178511  2.937395  7.017027  5.831301
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11342     10483     11852      9539      4966      9911      9106
    Mean |   .087912  .3987118  .1936373  .3174164   .233656  .0845597  .4160518
      SD |  .4541565  1.042912  .5769809  1.348276  .9766672  .4450098   1.07716
      p1 |        -1        -1 -.8493572        -1        -1        -1        -1
      p5 | -.6358617 -.7418011 -.5052658        -1        -1 -.5948098 -.6634611
     p50 |  .0508033   .118034  .0879593  .0319569  .0421834  .0488088  .1166198
     p95 |  .8257419  2.525499  1.299666    2.8735  2.134042  .7888544  2.588175
     p99 |  2.229795   5.12507  2.994329  7.575514  5.287554  2.162278  5.540472
     Min |        -1        -1 -.8493572        -1        -1        -1        -1
     Max |  2.229795   5.12507  2.994329  7.575514  5.287554  2.162278  5.540472
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann~n
---------+----------------------------------------------------------------------
       N |     10412      8330      4431      8523      8031      9183     27784
    Mean |  .1903861  .3241761  .3007727  .1843175  .4844086   .282961  .2270748
      SD |  .5891901  1.356852  1.041758  .5070959  1.157333  .6508686  .8414201
      p1 | -.8245884        -1        -1        -1        -1  -.825767        -1
      p5 | -.4864791        -1 -.8036039 -.5690029 -.6818938 -.4483227        -1
     p50 |  .0703343  .0382838  .0887893  .1319231  .1564856  .1474449  .1139262
     p95 |  1.320919  2.751666  1.974895  1.009975  2.838558   1.54951  1.766544
     p99 |  3.080809  7.660254  6.271499  2.546681  6.071068  3.530093  4.221698
     Min | -.8245884        -1        -1        -1        -1  -.825767        -1
     Max |  3.080809  7.660254  6.271499  2.546681  6.071068  3.530093  4.221698
--------------------------------------------------------------------------------

   Stats |  r2_ann~n  r3_ann~n  r4_ann~n  r5_ann~n
---------+----------------------------------------
       N |     15130     25975     26137     28327
    Mean |  .1794329  .0474335  .3812015   .189867
      SD |  .6855663  .3475965  .7060828  .4212792
      p1 |        -1        -1        -1 -.8585786
      p5 |        -1 -.6348516 -.6150036 -.3675445
     p50 |  .1155588  .0598376  .2234342  .1140366
     p95 |  1.458741  .5475788  1.744271  .9831793
     p99 |  2.872983  1.326594  3.252513  2.080162
     Min |        -1        -1        -1 -.8585786
     Max |  2.872983  1.326594  3.252513  2.080162
--------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * 5% winsorization (p5/p95) for r1, r4, r5  all years, for panel regressions (
> 14)
. * Naming: r*_annual_w5_YYYY so 10_build_panel reshape finds r1_annual_w5_*, etc
> .
. * ---------------------------------------------------------------------
. display "=== 5% winsorization on r1/r4/r5 (all years) ==="
=== 5% winsorization on r1/r4/r5 (all years) ===

. foreach y of local years {
  2.     foreach stub in r1_annual r4_annual r5_annual {
  3.         local v `stub'_`y'
  4.         capture confirm variable `v'
  5.         if !_rc {
  6.             quietly summarize `v', detail
  7.             local p5  = r(p5)
  8.             local p95 = r(p95)
  9.             capture drop `stub'_w5_`y'
 10.             gen double `stub'_w5_`y' = `v'
 11.             replace `stub'_w5_`y' = `p5'  if `stub'_w5_`y' < `p5'  & !missin
> g(`stub'_w5_`y')
 12.             replace `stub'_w5_`y' = `p95' if `stub'_w5_`y' > `p95' & !missin
> g(`stub'_w5_`y')
 13.         }
 14.     }
 15. }
(31,395 missing values generated)
(691 real changes made)
(691 real changes made)
(32,067 missing values generated)
(657 real changes made)
(657 real changes made)
(31,025 missing values generated)
(710 real changes made)
(709 real changes made)
(32,239 missing values generated)
(649 real changes made)
(647 real changes made)
(32,849 missing values generated)
(618 real changes made)
(619 real changes made)
(31,868 missing values generated)
(669 real changes made)
(668 real changes made)
(31,087 missing values generated)
(706 real changes made)
(709 real changes made)
(31,685 missing values generated)
(677 real changes made)
(678 real changes made)
(30,922 missing values generated)
(715 real changes made)
(716 real changes made)
(32,079 missing values generated)
(657 real changes made)
(657 real changes made)
(32,732 missing values generated)
(625 real changes made)
(625 real changes made)
(31,933 missing values generated)
(665 real changes made)
(665 real changes made)
(33,305 missing values generated)
(0 real changes made)
(596 real changes made)
(33,928 missing values generated)
(565 real changes made)
(566 real changes made)
(33,323 missing values generated)
(594 real changes made)
(595 real changes made)
(31,216 missing values generated)
(0 real changes made)
(700 real changes made)
(31,991 missing values generated)
(662 real changes made)
(662 real changes made)
(31,140 missing values generated)
(704 real changes made)
(705 real changes made)
(32,698 missing values generated)
(0 real changes made)
(627 real changes made)
(33,319 missing values generated)
(595 real changes made)
(596 real changes made)
(32,144 missing values generated)
(653 real changes made)
(655 real changes made)
(34,098 missing values generated)
(0 real changes made)
(556 real changes made)
(34,747 missing values generated)
(524 real changes made)
(523 real changes made)
(33,498 missing values generated)
(586 real changes made)
(586 real changes made)
(34,107 missing values generated)
(0 real changes made)
(556 real changes made)
(34,751 missing values generated)
(521 real changes made)
(524 real changes made)
(33,382 missing values generated)
(592 real changes made)
(592 real changes made)
(35,695 missing values generated)
(0 real changes made)
(475 real changes made)
(36,128 missing values generated)
(455 real changes made)
(455 real changes made)
(34,822 missing values generated)
(520 real changes made)
(520 real changes made)
(36,904 missing values generated)
(0 real changes made)
(418 real changes made)
(37,203 missing values generated)
(401 real changes made)
(402 real changes made)
(36,051 missing values generated)
(459 real changes made)
(460 real changes made)

. 
. * 5% winsorization for average returns (r1, r4, r5)
. foreach stub in r1_annual r4_annual r5_annual {
  2.     local v `stub'_avg
  3.     capture confirm variable `v'
  4.     if !_rc {
  5.         quietly summarize `v', detail
  6.         local p5  = r(p5)
  7.         local p95 = r(p95)
  8.         capture drop `stub'_avg_w5
  9.         gen double `stub'_avg_w5 = `v'
 10.         replace `stub'_avg_w5 = `p5'  if `stub'_avg_w5 < `p5'  & !missing(`s
> tub'_avg_w5)
 11.         replace `stub'_avg_w5 = `p95' if `stub'_avg_w5 > `p95' & !missing(`s
> tub'_avg_w5)
 12.     }
 13. }
(17,450 missing values generated)
(0 real changes made)
(1,389 real changes made)
(19,097 missing values generated)
(1,306 real changes made)
(1,307 real changes made)
(16,907 missing values generated)
(1,414 real changes made)
(1,416 real changes made)

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_proces
    > sed.dta saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta
> "
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/C
> ode/Processing/analysis_ready_processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_pro
> cessing_returns.log
  log type:  text
 closed on:  20 Feb 2026, 09:57:30
---------------------------------------------------------------------------------
