-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 opened on:   8 Feb 2026, 09:01:13

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_ready
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' r5_annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg r5_annual_avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_returns_income.do and 03_pre
> p_controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004
---------+------------------------------------------------------------------------------------------
       N |     13839      6936     13566      6713     14186     12995      6427     12697      6231
    Mean |  .3396622  .1944209  .1090722  .1329444  .1848722  .3029203  .3163339  .1063545  .1868381
      SD |  1.541005   1.04604  .5250122  .6557833  .6326632  1.425314  1.183398  .5481141  .6782298
      p1 |        -1        -1        -1 -.8019271 -.6937918        -1        -1        -1 -.7561607
      p5 | -.8911069        -1 -.5302583 -.5571676 -.4259265 -.9086369  -.749186 -.5451412 -.4752691
     p50 |  .0079683         0  .0660036  .0185573  .0789075  .0157756   .075847  .0595106  .0666945
     p95 |  2.649658  1.828427  .7460757  1.196811  1.084809  2.464102  2.004615  .7507762  1.235174
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.717954  1.910959  2.631804
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292  10.61895  15.65697
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006  r5_~2006  r1_~2008  r2_~2008  r3_~2008
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7248     13772      6971     14292     13155      6735     12823
    Mean |  .1946736  .3239473  .3332173  .1479926  .1981861  .2383437  .3333812  .2687441  .0191759
      SD |  .5880471   1.65343  1.302632  .5879566  .6821236  .6626324  1.586558  1.017611   .464199
      p1 | -.6775097        -1        -1        -1 -.7978984 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5355731 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .1026689  .0940058   .083713  .1186374  .0074907  .0623782         0
     p95 |  1.077448  2.403116  1.983571  .8641539  1.291187  1.201723  2.605551  1.949286  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  11.12834  69.89464  20.25135  25.27468  10.50237  14.88412  24.93995  13.09965  8.354143
----------------------------------------------------------------------------------------------------

   Stats |  r4_~2008  r5_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012
---------+------------------------------------------------------------------------------------------
       N |      6498     13284     11929      6129     11528      5926     11889     14018      7138
    Mean |   .162223  .1434432  .2243223  .2387422 -.0333831  .0953479  .1037757  .2596012  .2401613
      SD |  .6431461  .5836195  1.549668  1.088026  .4485891  .5865491  .7769028  1.478589  1.172571
      p1 | -.7815379  -.729281        -1        -1        -1 -.7764268 -.7930839        -1        -1
      p5 | -.5332488  -.460196        -1  -.793374 -.7113249 -.5527182 -.4903043        -1        -1
     p50 |  .0479776   .046832 -.0526641  .0202041 -.0398133   .006494  .0022376         0  .0398785
     p95 |  1.168684         1  2.278028  1.927888  .5374122  1.003842  .9920661  2.397546  1.938978
     p99 |  2.958517  2.421445   6.64635  5.180615   1.44949   2.45237  2.381849  6.472728   4.91608
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.647382  13.60593   30.6291  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228
----------------------------------------------------------------------------------------------------

   Stats |  r3_~2012  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014  r1_~2016
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6362     12496      5996     13041     11136
    Mean |  .0174181  .1186911  .1481473   .335425  .2940857  .0870768  .1762945  .2021447  .3009084
      SD |   .532927  .5823502  .6913277  1.675398  1.186066  .5695118  .6417564  .6832872   1.59319
      p1 |        -1 -.8685602 -.8179602        -1        -1        -1  -.825177 -.7965277        -1
      p5 | -.6600654 -.5684372 -.4960107        -1        -1 -.5983903 -.5325847 -.4508806        -1
     p50 |         0  .0366694  .0380672  .0207523  .0879784  .0297761  .0719861  .0806482  .0012243
     p95 |  .6457015  1.063692  1.070086  2.563706   2.02765  .8126539  1.200221  1.204541   2.57398
     p99 |  2.056931  2.372833  2.741768         7  5.403124  2.162278  2.790677  2.921935  6.937254
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.732125  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519  29.41156
----------------------------------------------------------------------------------------------------

   Stats |  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r5_~2018
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |  .2957962  .0837633  .1611136  .2086831  .3332256   .308336   .104337  .1788515  .2293031
      SD |  1.237407  .5333981  .6894437  .7069182  1.850102  1.458529  .5772518  .6771944  .8541944
      p1 |        -1        -1 -.8508357 -.8306918        -1        -1        -1 -.8430483 -.8102633
      p5 |      -.94 -.6181187 -.5491998 -.4634546        -1        -1 -.6358617 -.5568097 -.4896031
     p50 |  .0448434   .041465  .0516094  .0761038  .0067374  .0653638  .0508033  .0718461  .0935655
     p95 |  2.047444  .7663522  1.153758  1.274624  2.676955  2.171233  .8257419  1.272513  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359    11.498  17.07862  52.74273
----------------------------------------------------------------------------------------------------

   Stats |  r1_~2020  r2_~2020  r3_~2020  r4_~2020  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022
---------+------------------------------------------------------------------------------------------
       N |      9539      4967      9911      4675     10395      8330      4431      8523      4152
    Mean |  .3558075  .2715184  .1003054  .1480076  .2187182  .3785716  .3496379  .2032635  .2022009
      SD |   1.64541  1.232958  .5717823  .6144536  .7287121  1.836335   1.41289  .6688735  .7300951
      p1 |        -1        -1        -1 -.7823464 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5359843 -.4672046        -1 -.7870009 -.5690029  -.513698
     p50 |  .0319569   .045336  .0488088  .0455553  .0764125  .0382838  .0901743  .1319231  .0826399
     p95 |    2.8735  2.155947  .7888544  1.195613  1.353798  2.751666  1.986637  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.492312  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  28.18904   21.9638  14.09967  7.063589  26.14854  41.09515  24.23998  12.82027  13.28751
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+------------------------------------------------------------
       N |      9168     27784     15135     25975     14551     28341
    Mean |  .3230414   .256425  .2161744  .0566878  .1519931  .2208084
      SD |  .8597685  1.070319  .8415117  .4089999  .5158683  .5209462
      p1 | -.7842487        -1        -1        -1 -.9017765  -.770246
      p5 | -.4266178        -1        -1 -.6348516       -.5 -.3306858
     p50 |  .1545613  .1139262  .1217633  .0598376  .0973282  .1226826
     p95 |  1.609422  1.766544  1.490211  .5475788  .9000036  1.034315
     p99 |  3.653171  4.221698  2.898109  1.326594   1.99921  2.141008
     Min |        -1        -1        -1        -1        -1        -1
     Max |  19.67032  26.80398  17.15342  10.78983  13.28751  13.45894
----------------------------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(31,395 missing values generated)
(139 real changes made, 139 to missing)
(38,298 missing values generated)
(69 real changes made, 69 to missing)
(31,668 missing values generated)
(137 real changes made, 137 to missing)
(38,521 missing values generated)
(134 real changes made, 134 to missing)
(31,048 missing values generated)
(283 real changes made, 283 to missing)
(32,239 missing values generated)
(129 real changes made, 129 to missing)
(38,807 missing values generated)
(64 real changes made, 64 to missing)
(32,537 missing values generated)
(128 real changes made, 128 to missing)
(39,003 missing values generated)
(125 real changes made, 125 to missing)
(31,880 missing values generated)
(266 real changes made, 266 to missing)
(31,087 missing values generated)
(141 real changes made, 141 to missing)
(37,986 missing values generated)
(72 real changes made, 72 to missing)
(31,462 missing values generated)
(139 real changes made, 139 to missing)
(38,263 missing values generated)
(138 real changes made, 138 to missing)
(30,942 missing values generated)
(284 real changes made, 284 to missing)
(32,079 missing values generated)
(131 real changes made, 131 to missing)
(38,499 missing values generated)
(68 real changes made, 68 to missing)
(32,411 missing values generated)
(133 real changes made, 133 to missing)
(38,736 missing values generated)
(127 real changes made, 127 to missing)
(31,950 missing values generated)
(264 real changes made, 264 to missing)
(33,305 missing values generated)
(119 real changes made, 119 to missing)
(39,105 missing values generated)
(61 real changes made, 61 to missing)
(33,706 missing values generated)
(113 real changes made, 113 to missing)
(39,308 missing values generated)
(118 real changes made, 118 to missing)
(33,345 missing values generated)
(236 real changes made, 236 to missing)
(31,216 missing values generated)
(139 real changes made, 139 to missing)
(38,096 missing values generated)
(71 real changes made, 71 to missing)
(31,529 missing values generated)
(137 real changes made, 137 to missing)
(38,449 missing values generated)
(134 real changes made, 134 to missing)
(31,181 missing values generated)
(280 real changes made, 280 to missing)
(32,698 missing values generated)
(123 real changes made, 123 to missing)
(38,872 missing values generated)
(63 real changes made, 63 to missing)
(32,738 missing values generated)
(120 real changes made, 120 to missing)
(39,238 missing values generated)
(118 real changes made, 118 to missing)
(32,193 missing values generated)
(260 real changes made, 260 to missing)
(34,098 missing values generated)
(111 real changes made, 111 to missing)
(39,525 missing values generated)
(57 real changes made, 57 to missing)
(34,103 missing values generated)
(111 real changes made, 111 to missing)
(39,803 missing values generated)
(108 real changes made, 108 to missing)
(33,536 missing values generated)
(232 real changes made, 232 to missing)
(34,107 missing values generated)
(111 real changes made, 111 to missing)
(39,650 missing values generated)
(55 real changes made, 55 to missing)
(33,892 missing values generated)
(114 real changes made, 114 to missing)
(39,956 missing values generated)
(104 real changes made, 104 to missing)
(33,397 missing values generated)
(236 real changes made, 236 to missing)
(35,695 missing values generated)
(95 real changes made, 95 to missing)
(40,267 missing values generated)
(49 real changes made, 49 to missing)
(35,323 missing values generated)
(97 real changes made, 97 to missing)
(40,559 missing values generated)
(92 real changes made, 92 to missing)
(34,839 missing values generated)
(206 real changes made, 206 to missing)
(36,904 missing values generated)
(83 real changes made, 83 to missing)
(40,803 missing values generated)
(43 real changes made, 43 to missing)
(36,711 missing values generated)
(84 real changes made, 84 to missing)
(41,082 missing values generated)
(81 real changes made, 81 to missing)
(36,066 missing values generated)
(183 real changes made, 183 to missing)
(17,450 missing values generated)
(277 real changes made, 277 to missing)
(30,099 missing values generated)
(151 real changes made, 151 to missing)
(19,259 missing values generated)
(258 real changes made, 258 to missing)
(30,683 missing values generated)
(289 real changes made, 289 to missing)
(16,893 missing values generated)
(567 real changes made, 567 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |     13700      6867     13429      6579     13903     12866      6363     12569      6106
    Mean |   .234503  .1288434  .0762108  .1030386  .1517041  .2073775  .2389431  .0704277  .1560924
      SD |  1.053662  .7558769  .3746522   .487706  .4301164  .9695387  .7901379  .3727929  .4824483
      p1 |        -1        -1        -1  -.701519 -.6031034        -1        -1        -1 -.6497202
      p5 | -.8940194        -1 -.5337476 -.5259853 -.3938097  -.909955 -.7523211 -.5480539 -.4443422
     p50 |  .0030075         0  .0623424  .0185573   .078838  .0114411  .0709268  .0567245  .0666041
     p95 |  2.275186  1.645751  .6745392  1.070245  .9708241  2.104151   1.75471  .6532796  1.117661
     p99 |  4.878539   3.08899  1.349153  1.894763   1.81029  4.291616  3.365612  1.265686  1.970223
     Min |        -1        -1        -1 -.8019271 -.6937918        -1        -1        -1 -.7561607
     Max |  6.844645  4.196152   1.95804  2.508917  2.675682   6.20243  4.717954  1.886751  2.599531
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+------------------------------------------------------------------------------------------
       N |     13088     14006      7176     13633      6833     14008     13024      6667     12690
    Mean |  .1663922  .2123221  .2405644  .1133527  .1678595  .2065837   .222764  .2065831 -.0106435
      SD |  .4130015  1.013846  .8050799  .3978831  .4957719  .4734921  1.082296   .797839  .3357504
      p1 | -.5775652        -1        -1        -1 -.6961871 -.6210918        -1        -1        -1
      p5 | -.3647329 -.9552786        -1   -.53709 -.4997101  -.382586 -.9814037        -1 -.5728476
     p50 |  .0955945  .0142974  .0994983  .0897247   .083713  .1186374  .0037938  .0594717         0
     p95 |  .9705163  2.162278  1.732571  .7593289  1.175107  1.100651  2.318147   1.70107        .5
     p99 |  1.729282  4.482554  3.543127  1.435843  1.932576  2.116775  5.123724   3.57802  1.081666
     Min | -.6775097        -1        -1        -1 -.7978984 -.7141943        -1        -1        -1
     Max |  2.477198  6.877563  5.449806  1.997601  2.572623  2.817026  7.103497  4.775812  1.618615
----------------------------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+------------------------------------------------------------------------------------------
       N |      6371     13020     11810      6068     11415      5808     11653     13879      7067
    Mean |  .1338318  .1168596  .1142589  .1680262 -.0602623   .068704  .0700509  .1579306  .1626704
      SD |  .4908593  .4161425  .9846474  .7973205  .3371213  .4386101  .4233839  .9919995  .8012615
      p1 | -.6848414 -.6301772        -1        -1        -1 -.7124979 -.6761512        -1        -1
      p5 | -.4890097 -.4254837        -1 -.7984674 -.7247271 -.5228708 -.4573978        -1        -1
     p50 |  .0479856   .046832 -.0577547  .0159083 -.0419514   .006494  .0022376         0  .0370017
     p95 |  1.075149  .9183278  1.999839  1.680264  .4687215  .8960622  .8695556  2.140838   1.70814
     p99 |  1.983203  1.774887  4.467073  3.617967  .9245009  1.588436  1.780887  4.477226  3.516636
     Min | -.7815379  -.729281        -1        -1        -1 -.7764268 -.7930839        -1        -1
     Max |  2.958517  2.421445   6.64635  5.180615   1.44949   2.45237  2.381849  6.472728   4.91608
----------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+------------------------------------------------------------------------------------------
       N |     13568      6651     13773     12413      6299     12376      5878     12781     11025
    Mean | -.0182825  .0955707  .1126598   .224372  .2148021  .0497987  .1489555  .1695496  .1899521
      SD |  .3663141  .4529495  .4481693  1.057766  .8230404  .3990992  .4848736   .469675  1.064889
      p1 |        -1 -.7500473 -.6843536        -1        -1        -1 -.7267149 -.6623611        -1
      p5 | -.6619383 -.5395532 -.4572772        -1        -1 -.6006097 -.4989386 -.4111944        -1
     p50 |         0  .0366694  .0380672  .0148892  .0828811  .0281452  .0719861  .0806482         0
     p95 |  .5445931  .9466808  .9621417  2.282276  1.762586  .7230061  1.043364  1.077699  2.163683
     p99 |  1.236068  1.740641  1.920432  4.720776  3.797215  1.483277  2.035128  2.041671   4.91608
     Min |        -1 -.8685602 -.8179602        -1        -1        -1  -.825177 -.7965277        -1
     Max |  2.056931  2.372833  2.741768         7  5.403124  2.162278  2.790677  2.921935  6.937254
----------------------------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------------------------------------
       N |      5652     11020      5323     11466     11016      5529     11228      5174     11601
    Mean |  .2115744   .049653  .1291171  .1738184  .2117889  .2159459  .0661651  .1502866  .1912799
      SD |  .8881307  .3909237  .4744386  .4900443  1.103074  .8657765  .4016166  .4998721  .5108821
      p1 |        -1        -1 -.7174934 -.6819202        -1        -1        -1 -.7293721 -.6893688
      p5 | -.9572917 -.6205847 -.5080129  -.423343        -1        -1 -.6439655 -.5162176 -.4510124
     p50 |  .0419761  .0397505  .0516094  .0761038  .0027707  .0606602  .0488088  .0718461  .0935655
     p95 |   1.79732  .6747417  1.040745  1.155597   2.34109  2.003997  .7320508  1.137912  1.197188
     p99 |  4.477226  1.345208  1.967014  2.181124  4.945587  3.971921  1.469818  2.047872  2.199792
     Min |        -1        -1 -.8508357 -.8306918        -1        -1        -1 -.8430483 -.8102633
     Max |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301   2.22933   2.97907  3.083912
----------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |      9444      4918      9814      4583     10189      8247      4388      8439      4071
    Mean |   .244405  .1904783  .0640239  .1210602  .1859051  .2503438  .2472784   .160803  .1656417
      SD |  1.140538  .8420146  .3961029  .4702074  .5158326   1.14561  .8622724  .4512171  .5005475
      p1 |        -1        -1        -1 -.7036631 -.6525958        -1        -1        -1 -.6898303
      p5 |        -1        -1 -.6013846 -.5001105 -.4343146        -1 -.7965405 -.5874315 -.4721091
     p50 |  .0255319  .0419342  .0478737  .0455553  .0764125  .0318477  .0875946   .129159  .0826267
     p95 |  2.424665  1.907362  .6903085  1.073092  1.208397  2.374056  1.725541  .9272482  1.093574
     p99 |  5.204837  3.830459   1.48998  1.847608  2.290862  5.448488  4.293156  1.730301  2.210039
     Min |        -1        -1        -1 -.7823464 -.7675047        -1        -1        -1 -.8203947
     Max |  7.575514  5.287554  2.162278  2.492312  3.106588  7.660254  6.271499  2.546681     2.833
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------
       N |      8985     27507     14984     25717     14262     27774
    Mean |  .2780923  .1868483  .1680521  .0346006  .1332415    .20017
      SD |  .5730132  .7435077  .6336809  .3247381  .3758382  .3722524
      p1 | -.6309601        -1        -1        -1 -.7519305 -.6090735
      p5 | -.3808035        -1        -1 -.6428571 -.4557965 -.2802292
     p50 |  .1544941  .1100575   .118034  .0585784  .0973282  .1226713
     p95 |  1.428056  1.594414  1.345208  .4855696  .8030827  .9475073
     p99 |  2.582455  2.932882  2.226618   .942162   1.50415  1.584801
     Min | -.7842487        -1        -1        -1 -.9017765  -.770246
     Max |  3.652204  4.221698  2.898109  1.326594   1.99921   2.13823
----------------------------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004
---------+------------------------------------------------------------------------------------------
       N |     13839      6936     13566      6713     14186     12995      6427     12697      6231
    Mean |  .3396622  .1944209  .1090722  .1329444  .1848722  .3029203  .3163339  .1063545  .1868381
      SD |  1.541005   1.04604  .5250122  .6557833  .6326632  1.425314  1.183398  .5481141  .6782298
      p1 |        -1        -1        -1 -.8019271 -.6937918        -1        -1        -1 -.7561607
      p5 | -.8911069        -1 -.5302583 -.5571676 -.4259265 -.9086369  -.749186 -.5451412 -.4752691
     p50 |  .0079683         0  .0660036  .0185573  .0789075  .0157756   .075847  .0595106  .0666945
     p95 |  2.649658  1.828427  .7460757  1.196811  1.084809  2.464102  2.004615  .7507762  1.235174
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.717954  1.910959  2.631804
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292  10.61895  15.65697
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006  r5_~2006  r1_~2008  r2_~2008  r3_~2008
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7248     13772      6971     14292     13155      6735     12823
    Mean |  .1946736  .3239473  .3332173  .1479926  .1981861  .2383437  .3333812  .2687441  .0191759
      SD |  .5880471   1.65343  1.302632  .5879566  .6821236  .6626324  1.586558  1.017611   .464199
      p1 | -.6775097        -1        -1        -1 -.7978984 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5355731 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .1026689  .0940058   .083713  .1186374  .0074907  .0623782         0
     p95 |  1.077448  2.403116  1.983571  .8641539  1.291187  1.201723  2.605551  1.949286  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  11.12834  69.89464  20.25135  25.27468  10.50237  14.88412  24.93995  13.09965  8.354143
----------------------------------------------------------------------------------------------------

   Stats |  r4_~2008  r5_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012
---------+------------------------------------------------------------------------------------------
       N |      6498     13284     11929      6129     11528      5926     11889     14018      7138
    Mean |   .162223  .1434432  .2243223  .2387422 -.0333831  .0953479  .1037757  .2596012  .2401613
      SD |  .6431461  .5836195  1.549668  1.088026  .4485891  .5865491  .7769028  1.478589  1.172571
      p1 | -.7815379  -.729281        -1        -1        -1 -.7764268 -.7930839        -1        -1
      p5 | -.5332488  -.460196        -1  -.793374 -.7113249 -.5527182 -.4903043        -1        -1
     p50 |  .0479776   .046832 -.0526641  .0202041 -.0398133   .006494  .0022376         0  .0398785
     p95 |  1.168684         1  2.278028  1.927888  .5374122  1.003842  .9920661  2.397546  1.938978
     p99 |  2.958517  2.421445   6.64635  5.180615   1.44949   2.45237  2.381849  6.472728   4.91608
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.647382  13.60593   30.6291  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228
----------------------------------------------------------------------------------------------------

   Stats |  r3_~2012  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014  r1_~2016
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6362     12496      5996     13041     11136
    Mean |  .0174181  .1186911  .1481473   .335425  .2940857  .0870768  .1762945  .2021447  .3009084
      SD |   .532927  .5823502  .6913277  1.675398  1.186066  .5695118  .6417564  .6832872   1.59319
      p1 |        -1 -.8685602 -.8179602        -1        -1        -1  -.825177 -.7965277        -1
      p5 | -.6600654 -.5684372 -.4960107        -1        -1 -.5983903 -.5325847 -.4508806        -1
     p50 |         0  .0366694  .0380672  .0207523  .0879784  .0297761  .0719861  .0806482  .0012243
     p95 |  .6457015  1.063692  1.070086  2.563706   2.02765  .8126539  1.200221  1.204541   2.57398
     p99 |  2.056931  2.372833  2.741768         7  5.403124  2.162278  2.790677  2.921935  6.937254
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  7.732125  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519  29.41156
----------------------------------------------------------------------------------------------------

   Stats |  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r5_~2018
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |  .2957962  .0837633  .1611136  .2086831  .3332256   .308336   .104337  .1788515  .2293031
      SD |  1.237407  .5333981  .6894437  .7069182  1.850102  1.458529  .5772518  .6771944  .8541944
      p1 |        -1        -1 -.8508357 -.8306918        -1        -1        -1 -.8430483 -.8102633
      p5 |      -.94 -.6181187 -.5491998 -.4634546        -1        -1 -.6358617 -.5568097 -.4896031
     p50 |  .0448434   .041465  .0516094  .0761038  .0067374  .0653638  .0508033  .0718461  .0935655
     p95 |  2.047444  .7663522  1.153758  1.274624  2.676955  2.171233  .8257419  1.272513  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359    11.498  17.07862  52.74273
----------------------------------------------------------------------------------------------------

   Stats |  r1_~2020  r2_~2020  r3_~2020  r4_~2020  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022
---------+------------------------------------------------------------------------------------------
       N |      9539      4967      9911      4675     10395      8330      4431      8523      4152
    Mean |  .3558075  .2715184  .1003054  .1480076  .2187182  .3785716  .3496379  .2032635  .2022009
      SD |   1.64541  1.232958  .5717823  .6144536  .7287121  1.836335   1.41289  .6688735  .7300951
      p1 |        -1        -1        -1 -.7823464 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5359843 -.4672046        -1 -.7870009 -.5690029  -.513698
     p50 |  .0319569   .045336  .0488088  .0455553  .0764125  .0382838  .0901743  .1319231  .0826399
     p95 |    2.8735  2.155947  .7888544  1.195613  1.353798  2.751666  1.986637  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.492312  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  28.18904   21.9638  14.09967  7.063589  26.14854  41.09515  24.23998  12.82027  13.28751
----------------------------------------------------------------------------------------------------

   Stats |  r5_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+------------------------------------------------------------
       N |      9168     27784     15135     25975     14551     28341
    Mean |  .3230414   .256425  .2161744  .0566878  .1519931  .2208084
      SD |  .8597685  1.070319  .8415117  .4089999  .5158683  .5209462
      p1 | -.7842487        -1        -1        -1 -.9017765  -.770246
      p5 | -.4266178        -1        -1 -.6348516       -.5 -.3306858
     p50 |  .1545613  .1139262  .1217633  .0598376  .0973282  .1226826
     p95 |  1.609422  1.766544  1.490211  .5475788  .9000036  1.034315
     p99 |  3.653171  4.221698  2.898109  1.326594   1.99921  2.141008
     Min |        -1        -1        -1        -1        -1        -1
     Max |  19.67032  26.80398  17.15342  10.78983  13.28751  13.45894
----------------------------------------------------------------------

. 
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_win
  8.         gen double `v'_win = `v'
  9.         replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 10.         replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 11.         local retwin "`retwin' `v'_win"
 12.     }
 13. }
(31,395 missing values generated)
(0 real changes made)
(139 real changes made)
(38,298 missing values generated)
(0 real changes made)
(69 real changes made)
(31,668 missing values generated)
(0 real changes made)
(137 real changes made)
(38,521 missing values generated)
(67 real changes made)
(67 real changes made)
(31,048 missing values generated)
(141 real changes made)
(142 real changes made)
(32,239 missing values generated)
(0 real changes made)
(129 real changes made)
(38,807 missing values generated)
(0 real changes made)
(64 real changes made)
(32,537 missing values generated)
(0 real changes made)
(128 real changes made)
(39,003 missing values generated)
(62 real changes made)
(63 real changes made)
(31,880 missing values generated)
(132 real changes made)
(134 real changes made)
(31,087 missing values generated)
(0 real changes made)
(141 real changes made)
(37,986 missing values generated)
(0 real changes made)
(72 real changes made)
(31,462 missing values generated)
(0 real changes made)
(139 real changes made)
(38,263 missing values generated)
(69 real changes made)
(69 real changes made)
(30,942 missing values generated)
(142 real changes made)
(142 real changes made)
(32,079 missing values generated)
(0 real changes made)
(131 real changes made)
(38,499 missing values generated)
(0 real changes made)
(68 real changes made)
(32,411 missing values generated)
(0 real changes made)
(133 real changes made)
(38,736 missing values generated)
(64 real changes made)
(63 real changes made)
(31,950 missing values generated)
(132 real changes made)
(132 real changes made)
(33,305 missing values generated)
(0 real changes made)
(119 real changes made)
(39,105 missing values generated)
(0 real changes made)
(61 real changes made)
(33,706 missing values generated)
(0 real changes made)
(113 real changes made)
(39,308 missing values generated)
(59 real changes made)
(59 real changes made)
(33,345 missing values generated)
(118 real changes made)
(118 real changes made)
(31,216 missing values generated)
(0 real changes made)
(139 real changes made)
(38,096 missing values generated)
(0 real changes made)
(71 real changes made)
(31,529 missing values generated)
(0 real changes made)
(137 real changes made)
(38,449 missing values generated)
(67 real changes made)
(67 real changes made)
(31,181 missing values generated)
(140 real changes made)
(140 real changes made)
(32,698 missing values generated)
(0 real changes made)
(123 real changes made)
(38,872 missing values generated)
(0 real changes made)
(63 real changes made)
(32,738 missing values generated)
(0 real changes made)
(120 real changes made)
(39,238 missing values generated)
(59 real changes made)
(59 real changes made)
(32,193 missing values generated)
(130 real changes made)
(130 real changes made)
(34,098 missing values generated)
(0 real changes made)
(111 real changes made)
(39,525 missing values generated)
(0 real changes made)
(57 real changes made)
(34,103 missing values generated)
(0 real changes made)
(111 real changes made)
(39,803 missing values generated)
(54 real changes made)
(54 real changes made)
(33,536 missing values generated)
(116 real changes made)
(116 real changes made)
(34,107 missing values generated)
(0 real changes made)
(111 real changes made)
(39,650 missing values generated)
(0 real changes made)
(55 real changes made)
(33,892 missing values generated)
(0 real changes made)
(114 real changes made)
(39,956 missing values generated)
(52 real changes made)
(52 real changes made)
(33,397 missing values generated)
(118 real changes made)
(118 real changes made)
(35,695 missing values generated)
(0 real changes made)
(95 real changes made)
(40,267 missing values generated)
(0 real changes made)
(49 real changes made)
(35,323 missing values generated)
(0 real changes made)
(97 real changes made)
(40,559 missing values generated)
(46 real changes made)
(46 real changes made)
(34,839 missing values generated)
(103 real changes made)
(103 real changes made)
(36,904 missing values generated)
(0 real changes made)
(83 real changes made)
(40,803 missing values generated)
(0 real changes made)
(43 real changes made)
(36,711 missing values generated)
(0 real changes made)
(84 real changes made)
(41,082 missing values generated)
(40 real changes made)
(41 real changes made)
(36,066 missing values generated)
(91 real changes made)
(92 real changes made)
(17,450 missing values generated)
(0 real changes made)
(277 real changes made)
(30,099 missing values generated)
(0 real changes made)
(151 real changes made)
(19,259 missing values generated)
(0 real changes made)
(258 real changes made)
(30,683 missing values generated)
(144 real changes made)
(145 real changes made)
(16,893 missing values generated)
(283 real changes made)
(284 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |     13839      6936     13566      6713     14186     12995      6427     12697      6231
    Mean |  .3011539  .1693054  .0953002  .1180187  .1687722  .2668898   .283545  .0889824  .1720466
      SD |  1.239727  .8535941  .4179342  .5466609  .5029369   1.13311  .9032796  .4139833  .5459797
      p1 |        -1        -1        -1 -.8019271 -.6937918        -1        -1        -1 -.7561607
      p5 | -.8911069        -1 -.5302583 -.5571676 -.4259265 -.9086369  -.749186 -.5451412 -.4752691
     p50 |  .0079683         0  .0660036  .0185573  .0789075  .0157756   .075847  .0595106  .0666945
     p95 |  2.649658  1.828427  .7460757  1.196811  1.084809  2.464102  2.004615  .7507762  1.235174
     p99 |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.717954  1.910959  2.631804
     Min |        -1        -1        -1 -.8019271 -.6937918        -1        -1        -1 -.7561607
     Max |  6.870338  4.196152  1.966479  2.508917  2.696371   6.20243  4.717954  1.910959  2.631804
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+------------------------------------------------------------------------------------------
       N |     13354     14147      7248     13772      6971     14292     13155      6735     12823
    Mean |  .1813771   .278753  .2923118  .1323946   .182103  .2233716  .2912837  .2529612  .0065366
      SD |  .4777217  1.206663  .9532251  .4384954  .5542579  .5436838  1.275345  .9170806  .3737956
      p1 | -.6775097        -1        -1        -1 -.7978984 -.7141943        -1        -1        -1
      p5 | -.3989889 -.9483774        -1 -.5327307 -.5355731 -.4200744 -.9728337        -1 -.5686689
     p50 |  .0956151    .02053  .1026689  .0940058   .083713  .1186374  .0074907  .0623782         0
     p95 |  1.077448  2.403116  1.983571  .8641539  1.291187  1.201723  2.605551  1.949286  .5811388
     p99 |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
     Min | -.6775097        -1        -1        -1 -.7978984 -.7141943        -1        -1        -1
     Max |  2.491039  6.877563  5.449806         2  2.572623  2.817026  7.103497  4.800067  1.645751
----------------------------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+------------------------------------------------------------------------------------------
       N |      6498     13284     11929      6129     11528      5926     11889     14018      7138
    Mean |  .1522023  .1313518   .179421  .2179149 -.0454634  .0840218  .0844291   .220547  .2099515
      SD |  .5670261  .4789747  1.175284  .9364908  .3669636      .502  .4857283  1.168684  .9263773
      p1 | -.7815379  -.729281        -1        -1        -1 -.7764268 -.7930839        -1        -1
      p5 | -.5332488  -.460196        -1  -.793374 -.7113249 -.5527182 -.4903043        -1        -1
     p50 |  .0479776   .046832 -.0526641  .0202041 -.0398133   .006494  .0022376         0  .0398785
     p95 |  1.168684         1  2.278028  1.927888  .5374122  1.003842  .9920661  2.397546  1.938978
     p99 |  2.958517  2.421445   6.64635  5.180615   1.44949   2.45237  2.381849  6.472728   4.91608
     Min | -.7815379  -.729281        -1        -1        -1 -.7764268 -.7930839        -1        -1
     Max |  2.958517  2.421445   6.64635  5.180615   1.44949   2.45237  2.381849  6.472728   4.91608
----------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+------------------------------------------------------------------------------------------
       N |     13705      6785     14053     12536      6362     12496      5996     13041     11136
    Mean |  .0024621  .1085375  .1295807  .2908527  .2661797   .070085  .1653644  .1873566   .257207
      SD |  .4188875  .5112144  .5235092  1.246577   .966774  .4474334  .5551807   .548368  1.253791
      p1 |        -1 -.8685602 -.8179602        -1        -1        -1  -.825177 -.7965277        -1
      p5 | -.6600654 -.5684372 -.4960107        -1        -1 -.5983903 -.5325847 -.4508806        -1
     p50 |         0  .0366694  .0380672  .0207523  .0879784  .0297761  .0719861  .0806482  .0012243
     p95 |  .6457015  1.063692  1.070086  2.563706   2.02765  .8126539  1.200221  1.204541   2.57398
     p99 |  2.056931  2.372833  2.741768         7  5.403124  2.162278  2.790677  2.921935  6.937254
     Min |        -1 -.8685602 -.8179602        -1        -1        -1  -.825177 -.7965277        -1
     Max |  2.056931  2.372833  2.741768         7  5.403124  2.162278  2.790677  2.921935  6.937254
----------------------------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------------------------------------
       N |      5709     11131      5431     11698     11127      5584     11342      5278     11837
    Mean |  .2705398  .0702787   .142892  .1915975  .2796762  .2712548   .087912  .1683698  .2101317
      SD |  1.061001   .439928  .5344296  .5680483  1.289207  1.024578  .4541565  .5772315  .5906437
      p1 |        -1        -1 -.8508357 -.8306918        -1        -1        -1 -.8430483 -.8102633
      p5 |      -.94 -.6181187 -.5491998 -.4634546        -1        -1 -.6358617 -.5568097 -.4896031
     p50 |  .0448434   .041465  .0516094  .0761038  .0067374  .0653638  .0508033  .0718461  .0935655
     p95 |  2.047444  .7663522  1.153758  1.274624  2.676955  2.171233  .8257419  1.272513  1.352213
     p99 |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
     Min |        -1        -1 -.8508357 -.8306918        -1        -1        -1 -.8430483 -.8102633
     Max |  6.117423  2.117991  2.494468  2.971262  7.017027  5.831301  2.229795   2.97907  3.083912
----------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+------------------------------------------------------------------------------------------
       N |      9539      4967      9911      4675     10395      8330      4431      8523      4152
    Mean |  .3174164  .2407615  .0845597  .1355032   .205398  .3241761  .3057396  .1843175  .1824819
      SD |  1.348276  .9776568  .4450098  .5290603  .5949536  1.356852  1.041701  .5070959  .5701035
      p1 |        -1        -1        -1 -.7823464 -.7675047        -1        -1        -1 -.8203947
      p5 |        -1        -1 -.5948098 -.5359843 -.4672046        -1 -.7870009 -.5690029  -.513698
     p50 |  .0319569   .045336  .0488088  .0455553  .0764125  .0382838  .0901743  .1319231  .0826399
     p95 |    2.8735  2.155947  .7888544  1.195613  1.353798  2.751666  1.986637  1.009975  1.202837
     p99 |  7.575514  5.287554  2.162278  2.492312  3.106588  7.660254  6.271499  2.546681     2.833
     Min |        -1        -1        -1 -.7823464 -.7675047        -1        -1        -1 -.8203947
     Max |  7.575514  5.287554  2.162278  2.492312  3.106588  7.660254  6.271499  2.546681     2.833
----------------------------------------------------------------------------------------------------

   Stats |  r5_ann..  r1~g_win  r2~g_win  r3~g_win  r4~g_win  r5~g_win
---------+------------------------------------------------------------
       N |      9168     27784     15135     25975     14551     28341
    Mean |  .3014163  .2270748  .1952895  .0474335   .141593  .2099287
      SD |  .6684087  .8414201  .6864166  .3475965  .4285788  .4276169
      p1 | -.7842487        -1        -1        -1 -.9017765  -.770246
      p5 | -.4266178        -1        -1 -.6348516       -.5 -.3306858
     p50 |  .1545613  .1139262  .1217633  .0598376  .0973282  .1226826
     p95 |  1.609422  1.766544  1.490211  .5475788  .9000036  1.034315
     p99 |  3.653171  4.221698  2.898109  1.326594   1.99921  2.141008
     Min | -.7842487        -1        -1        -1 -.9017765  -.770246
     Max |  3.653171  4.221698  2.898109  1.326594   1.99921  2.141008
----------------------------------------------------------------------

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_processed.dta saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta"
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_read
> y_processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 closed on:   8 Feb 2026, 09:01:16
-------------------------------------------------------------------------------------------------------------
