--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 opened on:   4 Feb 2026, 23:01:38

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_ready
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' debt_long_annual_`y' debt_other_annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg debt_long_annual_avg debt_other_annual_avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_returns_income.do and 03_prep
> _controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  debt_l..  debt_o..  r1_~2004  r2_~2004  r3_~2004  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       493       266       265       265       265       405       243       237       237       237
    Mean |   .085747  .0618886  .1351165  .0366298  .0052274  .1080205  .0864005  .1699588  .0335833  .0081922
      SD |  .8255719   .546823  .5016602  .0862671   .023938  .4604256  .2805041  .3568808  .0771323  .0340417
      p1 | -.6167905 -.6022116 -.5148804         0         0 -.5252534 -.5232287 -.6224465         0         0
      p5 | -.4718977 -.4229425 -.4479376         0         0 -.3588377 -.2706537 -.2421369         0         0
     p50 |  .0056594 -.0005444  .0422868         0         0  .0328169  .0490236  .1078646         0         0
     p95 |  .7242457  .7708082  .9709566   .213954  .0261638  .7476402  .6561936   .811872  .1661904  .0486928
     p99 |  1.725554  1.461066  1.499686  .3915328  .0994896  1.817702  .8924631  1.284732  .3764944  .1622989
     Min |  -.671202 -.6141205 -.6081201         0         0 -.6927528 -.6921977 -.6354184         0         0
     Max |  14.40743  6.846599  4.841205  .6903085  .2837584  3.932645  1.111079  2.070119  .5606037  .3001115
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2006  r2_~2006  r3_~2006  debt_l..  debt_o..  r1_~2008  r2_~2008  r3_~2008  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       374       229       227       227       227       396       240       237       237       237
    Mean |  .0814917  .1066725  .2122882  .0500212  .0034367  .0320904   .072068  .1312747  .0665592  .0079245
      SD |   .318733   .354715  .3950932  .1020915  .0166035  .3101623  .3463567  .3953604  .2461041  .0396081
      p1 | -.6270329 -.6450034 -.5921583         0         0 -.6820788 -.5988332 -.4907238         0         0
      p5 | -.2865997 -.2683693 -.2295192         0         0 -.3403497 -.3134429 -.3009581         0         0
     p50 |  .0440619  .0597532  .1671381         0         0   -.00265  .0354036  .0672659  .0025649         0
     p95 |  .6093538  .6509691  .7857103  .2385978  .0184178  .5535702  .7038158  .8496103  .2127695  .0304579
     p99 |  1.616284  1.632388  1.873272  .3930429  .0373461  1.120404  1.631641  2.369574  .5425013  .2051924
     Min | -.6925007 -.7297664  -.642813         0         0 -.7810701 -.7592939 -.5821462         0         0
     Max |  2.198288   2.20565  2.499115   .775568  .1691568  2.357888  2.354766  2.382527  2.549048  .3605381
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2010  r2_~2010  r3_~2010  debt_l..  debt_o..  r1_~2012  r2_~2012  r3_~2012  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       302       195       188       190       190       319       203       197       197       197
    Mean | -.0160368  .0221045  .0556699  .0321607  .0113851  .0046589  .0147797  .0718219  .0547908    .00596
      SD |  .2877853  .2959147  .3485436   .068861  .0489438  .2638831  .2270976  .2781387  .1445196  .0278334
      p1 | -.5333517  -.452877 -.4811976         0         0 -.4919053  -.481191 -.7393317         0         0
      p5 | -.4062937 -.3265602 -.3762528         0         0 -.4027271 -.3123524 -.3437546         0         0
     p50 | -.0456618 -.0412463 -.0247529         0         0 -.0075359 -.0051249  .0253445   .007294         0
     p95 |  .5536387  .7340109  .8464256  .1759991   .031001   .385349  .4413549  .7011921  .2004234  .0285565
     p99 |  .9532402  1.016071  1.205311  .3934579  .3748002  .8987089  .6367285  1.094009  1.314052  .2668223
     Min | -.6164442 -.5466531 -.5378766         0         0 -.6225487 -.7011157 -.9904545         0         0
     Max |  1.611966  1.023336   1.62819  .4653421  .3748002  1.605099  .9597868  1.094009  1.314052  .2668223
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2014  r2_~2014  r3_~2014  debt_l..  debt_o..  r1_~2016  r2_~2016  r3_~2016  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       253       155       153       153       153       196       105       100       102       102
    Mean |  .0928361  .1973973  .2979791  .0768644  .0120172  .0096581  .0504324  .1096195  .0266412  .0025106
      SD |  .4612172  .6457126  .7232989  .2191633  .0605496  .2585265  .2542255  .2807631  .0704782  .0126405
      p1 | -.5635642 -.4688683 -.4395018         0         0 -.5578827 -.4601975 -.5834739         0         0
      p5 | -.3449184 -.3701276  -.330309         0         0  -.366886 -.2608742 -.2138244         0         0
     p50 |  .0445637  .0863823  .1514185         0         0  .0062113  .0375133  .0945483         0         0
     p95 |  .5988597  .7936591  1.154215  .2756088   .050966  .4328224  .3465296  .5996137  .0884074  .0077646
     p99 |  1.486807   2.34428  3.055795  1.800376  .5217718  1.062872  1.047735   1.37015  .3520817  .0897247
     Min | -.6703359 -.5018231 -.5427664         0         0 -.6648447 -.5787698 -.6982852         0         0
     Max |  5.729042  6.751129  6.986363  1.800376  .5217718  1.344325  1.509729  1.648858   .454522  .0897247
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2018  r2_~2018  r3_~2018  debt_l..  debt_o..  r1_~2020  r2_~2020  r3_~2020  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       178       107       106       106       106       141        84        83        83        83
    Mean |  .0454243  .1128755  .1764994  .0283966  .0004691  .0125306  .0535166  .0913277   .029496  .0059653
      SD |  .3044172  .2909933  .3384315  .0577623  .0026949  .2571984   .248369  .2844992  .0736821  .0227663
      p1 | -.6391615 -.2641401 -.2894666         0         0 -.4840035 -.4065714 -.7699105         0         0
      p5 | -.3576621 -.2309814 -.2483664         0         0 -.2752977 -.2419302 -.3002598         0         0
     p50 |  .0144044  .0447167   .086289         0         0         0  .0241578  .0765292         0         0
     p95 |  .4734204  .5910535  .6979086  .1375066  .0013187  .4030022  .4505746  .4657656  .1493643   .018959
     p99 |  1.243693  1.099612  1.234682  .2218665    .01595  .8990129  .9940506   1.08633  .3667025  .1220817
     Min | -.7248633 -.2644993 -.2894666         0         0 -.8050159 -.4065714 -.7699105         0         0
     Max |  1.676778  1.753679  1.849295  .2818295  .0227474  1.488443  .9940506   1.08633  .3667025  .1220817
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2022  r2_~2022  r3_~2022  debt_l..  debt_o..  r1_ann~g  r2_ann~g  r3_ann~g  debt_l~g  debt_o~g
---------+----------------------------------------------------------------------------------------------------
       N |       119        81        77        79        79      1627      1102      1083      1085      1085
    Mean |  .0620071   .076827  .1799496     .0272  .0026696  .0601267   .083722  .1588534  .0475837  .0063657
      SD |  .2919608  .2386651  .2627059  .0501551   .008963   .472134  .3977154  .4160665  .1234005  .0289001
      p1 | -.5255105 -.5325783 -.2101669         0         0 -.5333517  -.516197 -.5081249         0         0
      p5 | -.3202606 -.2402733 -.1799159         0         0 -.3085872 -.2621352 -.2740614         0         0
     p50 |   .053932  .0849551  .1103378         0         0  .0135205  .0378012   .099401         0         0
     p95 |  .5765883  .4633947  .5861469  .1332219  .0172518  .5142752  .5710464  .7923853  .2087224  .0265506
     p99 |  1.005806  1.042428  1.297496  .3112166  .0706157  1.243693  .9940506  1.355565  .3934579  .1220817
     Min | -.7276693 -.5325783 -.2101669         0         0 -.7248633 -.6921977 -.6982852         0         0
     Max |  1.085387  1.042428  1.297496  .3112166  .0706157  14.40743  6.846599  6.986363   1.93155  .3374559
--------------------------------------------------------------------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(44,741 missing values generated)
(8 real changes made, 8 to missing)
(44,968 missing values generated)
(4 real changes made, 4 to missing)
(44,969 missing values generated)
(6 real changes made, 6 to missing)
(44,969 missing values generated)
(1 real change made, 1 to missing)
(44,969 missing values generated)
(2 real changes made, 2 to missing)
(44,829 missing values generated)
(9 real changes made, 9 to missing)
(44,991 missing values generated)
(4 real changes made, 4 to missing)
(44,997 missing values generated)
(5 real changes made, 5 to missing)
(44,997 missing values generated)
(2 real changes made, 2 to missing)
(44,997 missing values generated)
(2 real changes made, 2 to missing)
(44,860 missing values generated)
(5 real changes made, 5 to missing)
(45,005 missing values generated)
(4 real changes made, 4 to missing)
(45,007 missing values generated)
(3 real changes made, 3 to missing)
(45,007 missing values generated)
(2 real changes made, 2 to missing)
(45,007 missing values generated)
(2 real changes made, 2 to missing)
(44,838 missing values generated)
(5 real changes made, 5 to missing)
(44,994 missing values generated)
(5 real changes made, 5 to missing)
(44,997 missing values generated)
(4 real changes made, 4 to missing)
(44,997 missing values generated)
(2 real changes made, 2 to missing)
(44,997 missing values generated)
(4 real changes made, 4 to missing)
(44,932 missing values generated)
(6 real changes made, 6 to missing)
(45,039 missing values generated)
(4 real changes made, 4 to missing)
(45,046 missing values generated)
(4 real changes made, 4 to missing)
(45,044 missing values generated)
(1 real change made, 1 to missing)
(45,044 missing values generated)
(0 real changes made)
(44,915 missing values generated)
(6 real changes made, 6 to missing)
(45,031 missing values generated)
(4 real changes made, 4 to missing)
(45,037 missing values generated)
(1 real change made, 1 to missing)
(45,037 missing values generated)
(0 real changes made)
(45,037 missing values generated)
(0 real changes made)
(44,981 missing values generated)
(4 real changes made, 4 to missing)
(45,079 missing values generated)
(2 real changes made, 2 to missing)
(45,081 missing values generated)
(5 real changes made, 5 to missing)
(45,081 missing values generated)
(0 real changes made)
(45,081 missing values generated)
(0 real changes made)
(45,038 missing values generated)
(2 real changes made, 2 to missing)
(45,129 missing values generated)
(2 real changes made, 2 to missing)
(45,134 missing values generated)
(2 real changes made, 2 to missing)
(45,132 missing values generated)
(1 real change made, 1 to missing)
(45,132 missing values generated)
(0 real changes made)
(45,056 missing values generated)
(2 real changes made, 2 to missing)
(45,127 missing values generated)
(2 real changes made, 2 to missing)
(45,128 missing values generated)
(1 real change made, 1 to missing)
(45,128 missing values generated)
(1 real change made, 1 to missing)
(45,128 missing values generated)
(2 real changes made, 2 to missing)
(45,093 missing values generated)
(2 real changes made, 2 to missing)
(45,150 missing values generated)
(0 real changes made)
(45,151 missing values generated)
(0 real changes made)
(45,151 missing values generated)
(2 real changes made, 2 to missing)
(45,151 missing values generated)
(2 real changes made, 2 to missing)
(45,115 missing values generated)
(2 real changes made, 2 to missing)
(45,153 missing values generated)
(0 real changes made)
(45,157 missing values generated)
(1 real change made, 1 to missing)
(45,155 missing values generated)
(0 real changes made)
(45,155 missing values generated)
(0 real changes made)
(43,607 missing values generated)
(32 real changes made, 32 to missing)
(44,132 missing values generated)
(22 real changes made, 22 to missing)
(44,151 missing values generated)
(22 real changes made, 22 to missing)
(44,149 missing values generated)
(10 real changes made, 10 to missing)
(44,149 missing values generated)
(11 real changes made, 11 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       485       262       259       264       263       396       239       232       235       235
    Mean |  .0385061  .0357526   .105481  .0341538   .003561  .0795153  .0843268  .1474394   .029098  .0057078
      SD |  .3398194  .3396976  .3748558  .0764163  .0134581  .3155196  .2571102  .2911757  .0600509  .0208374
      p1 | -.5716657 -.5352429 -.5081249         0         0 -.4691308 -.4938419 -.5528597         0         0
      p5 | -.4276526  -.418511 -.4030466         0         0 -.3432653  -.267494 -.2421369         0         0
     p50 |  .0056594 -.0005444  .0422868         0         0  .0325546  .0490236  .1065584         0         0
     p95 |    .69673  .7158378  .8680083  .2067617   .019499  .6603532  .6552019  .7297213   .147369  .0467758
     p99 |  1.303812  1.301139  1.355565  .3882191  .0823708    1.1005  .7962309  .9153579   .272476  .1144216
     Min | -.6167905 -.6022116 -.5148804         0         0 -.5252534 -.5232287 -.6224465         0         0
     Max |  1.725554  1.461066  1.366012  .3915328  .0994896   1.80744  .8924631  1.233297  .3764944  .1622989
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       369       225       224       225       225       391       235       233       235       233
    Mean |  .0762586  .0954477  .1956876  .0435719  .0019637  .0242871  .0550421  .1177904  .0454316  .0032045
      SD |  .2718469  .2873592  .3282389  .0759855  .0055453  .2702194  .2640792  .3333646  .0892384  .0128895
      p1 | -.3859392 -.3755252 -.3581763         0         0 -.6047153 -.4352373 -.3571313         0         0
      p5 | -.2625798  -.254193 -.2295192         0         0 -.3288862 -.3060963 -.2762116         0         0
     p50 |  .0445525  .0597532  .1661128         0         0  -.003252  .0342133  .0672659  .0018706         0
     p95 |  .5174736  .5465896  .7217247  .2269784  .0168628  .5228623  .6260317  .7650883  .2045411  .0258976
     p99 |  .9142591  .7364226  .9691923  .3180662  .0301563  .9404998  .9291766   1.09337  .5195067    .08325
     Min | -.6270329 -.6450034 -.5921583         0         0 -.6820788 -.5988332 -.4907238         0         0
     Max |  1.616284  1.632388  1.873272  .3930429  .0373461  1.120404   .986159  2.369574  .5425013  .1275915
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       296       191       184       189       190       313       199       196       197       197
    Mean | -.0232661   .017123  .0378533  .0298688  .0113851 -.0029591  .0115877  .0772417  .0547908    .00596
      SD |  .2529747  .2757138  .3064907  .0613487  .0489438  .2200857  .2001421  .2682191  .1445196  .0278334
      p1 | -.5149619 -.4459094 -.4556601         0         0  -.474895  -.440726 -.4592103         0         0
      p5 |  -.383656 -.3169107 -.3369804         0         0   -.38506 -.2994308 -.3032882         0         0
     p50 | -.0456618 -.0412463 -.0263685         0         0 -.0075359 -.0051249  .0255626   .007294         0
     p95 |  .5443318  .6605159  .6821152  .1706282   .031001  .3683688  .4293928  .7011921  .2004234  .0285565
     p99 |  .8698601  .8494026  1.056617  .2577449  .3748002  .6516428  .5572799  1.094009  1.314052  .2668223
     Min | -.5333517 -.4487641 -.4811976         0         0 -.4919053  -.481191 -.7393317         0         0
     Max |  .9532402  1.012001  1.152518  .3934579  .3748002  .8987089  .6367285  1.094009  1.314052  .2668223
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       249       153       148       153       153       194       103        98       101       102
    Mean |  .0698551  .1591326  .2261832  .0768644  .0120172  .0062552  .0423733  .1021569  .0224047  .0025106
      SD |  .2715032  .3676487  .3456367  .2191633  .0605496  .2364951  .2026649   .221907  .0562841  .0126405
      p1 | -.5308436 -.4615033 -.3703705         0         0   -.51926 -.3664305 -.4686626         0         0
      p5 | -.3287599 -.2952969  -.167713         0         0 -.3494337  -.242059 -.2023534         0         0
     p50 |  .0445637  .0863823  .1514185         0         0  .0062113  .0375133  .0945483         0         0
     p95 |  .5811388  .7827474  .8675219  .2756088   .050966  .3396954  .3188755  .5500237  .0884074  .0077646
     p99 |  .9321992  1.738613  1.717848  1.800376  .5217718  1.038099  .4690178  1.091442  .3520817  .0897247
     Min | -.5635642 -.4688683 -.3948531         0         0 -.5578827 -.4601975 -.4686626         0         0
     Max |  1.486807   2.34428  1.717848  1.800376  .5217718  1.062872  1.047735  1.091442  .3520817  .0897247
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       176       105       105       105       104       139        84        83        81        81
    Mean |  .0405319  .1008429   .160568   .025983   .000106  .0077941  .0535166  .0913277  .0211699  .0030983
      SD |  .2740562  .2426997   .297447  .0523938  .0003533  .2155432   .248369  .2844992  .0514965  .0136332
      p1 | -.5593446 -.2528445 -.2894666         0         0 -.3984683 -.4065714 -.7699105         0         0
      p5 | -.3421337 -.2265531 -.2483664         0         0 -.2752977 -.2419302 -.3002598         0         0
     p50 |  .0144044  .0447167   .086289         0         0         0  .0241578  .0765292         0         0
     p95 |  .4562771  .5872936  .6979086  .1375066  .0006759  .4030022  .4505746  .4657656  .1278507  .0176189
     p99 |  1.118496   .872579  1.234682  .2218665  .0020161  .8169807  .9940506   1.08633  .2495613  .0945409
     Min | -.6391615 -.2641401 -.2894666         0         0 -.4840035 -.4065714 -.7699105         0         0
     Max |  1.243693  1.099612  1.234682  .2218665  .0020161  .8990129  .9940506   1.08633  .2495613  .0945409
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       117        81        76        79        79      1595      1080      1061      1075      1074
    Mean |  .0600096   .076827   .165245     .0272  .0026696  .0401865   .066742   .141203  .0393861  .0038547
      SD |  .2688912  .2386651  .2303548  .0501551   .008963   .237164  .2368701  .2913474  .0727379  .0125963
      p1 | -.5255105 -.5325783 -.2101669         0         0 -.4361814  -.422093 -.4556601         0         0
      p5 | -.3202606 -.2402733 -.1799159         0         0 -.2860754 -.2532662 -.2299939         0         0
     p50 |   .053932  .0849551  .1085392         0         0  .0135205  .0378012   .099401         0         0
     p95 |   .455517  .4633947  .5793268  .1332219  .0172518  .4668521  .5211019  .6985696  .1988961  .0216715
     p99 |  .9956348  1.042428  .8012141  .3112166  .0706157  .9321992  .8330455  1.133445  .3667025  .0749798
     Min | -.5255105 -.5325783 -.2101669         0         0 -.5333517  -.516197 -.5081249         0         0
     Max |  1.005806  1.042428  .8012141  .3112166  .0706157  1.243693  .9940506  1.318286  .3934579  .1025962
--------------------------------------------------------------------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  debt_l..  debt_o..  r1_~2004  r2_~2004  r3_~2004  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       493       266       265       265       265       405       243       237       237       237
    Mean |   .085747  .0618886  .1351165  .0366298  .0052274  .1080205  .0864005  .1699588  .0335833  .0081922
      SD |  .8255719   .546823  .5016602  .0862671   .023938  .4604256  .2805041  .3568808  .0771323  .0340417
      p1 | -.6167905 -.6022116 -.5148804         0         0 -.5252534 -.5232287 -.6224465         0         0
      p5 | -.4718977 -.4229425 -.4479376         0         0 -.3588377 -.2706537 -.2421369         0         0
     p50 |  .0056594 -.0005444  .0422868         0         0  .0328169  .0490236  .1078646         0         0
     p95 |  .7242457  .7708082  .9709566   .213954  .0261638  .7476402  .6561936   .811872  .1661904  .0486928
     p99 |  1.725554  1.461066  1.499686  .3915328  .0994896  1.817702  .8924631  1.284732  .3764944  .1622989
     Min |  -.671202 -.6141205 -.6081201         0         0 -.6927528 -.6921977 -.6354184         0         0
     Max |  14.40743  6.846599  4.841205  .6903085  .2837584  3.932645  1.111079  2.070119  .5606037  .3001115
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2006  r2_~2006  r3_~2006  debt_l..  debt_o..  r1_~2008  r2_~2008  r3_~2008  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       374       229       227       227       227       396       240       237       237       237
    Mean |  .0814917  .1066725  .2122882  .0500212  .0034367  .0320904   .072068  .1312747  .0665592  .0079245
      SD |   .318733   .354715  .3950932  .1020915  .0166035  .3101623  .3463567  .3953604  .2461041  .0396081
      p1 | -.6270329 -.6450034 -.5921583         0         0 -.6820788 -.5988332 -.4907238         0         0
      p5 | -.2865997 -.2683693 -.2295192         0         0 -.3403497 -.3134429 -.3009581         0         0
     p50 |  .0440619  .0597532  .1671381         0         0   -.00265  .0354036  .0672659  .0025649         0
     p95 |  .6093538  .6509691  .7857103  .2385978  .0184178  .5535702  .7038158  .8496103  .2127695  .0304579
     p99 |  1.616284  1.632388  1.873272  .3930429  .0373461  1.120404  1.631641  2.369574  .5425013  .2051924
     Min | -.6925007 -.7297664  -.642813         0         0 -.7810701 -.7592939 -.5821462         0         0
     Max |  2.198288   2.20565  2.499115   .775568  .1691568  2.357888  2.354766  2.382527  2.549048  .3605381
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2010  r2_~2010  r3_~2010  debt_l..  debt_o..  r1_~2012  r2_~2012  r3_~2012  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       302       195       188       190       190       319       203       197       197       197
    Mean | -.0160368  .0221045  .0556699  .0321607  .0113851  .0046589  .0147797  .0718219  .0547908    .00596
      SD |  .2877853  .2959147  .3485436   .068861  .0489438  .2638831  .2270976  .2781387  .1445196  .0278334
      p1 | -.5333517  -.452877 -.4811976         0         0 -.4919053  -.481191 -.7393317         0         0
      p5 | -.4062937 -.3265602 -.3762528         0         0 -.4027271 -.3123524 -.3437546         0         0
     p50 | -.0456618 -.0412463 -.0247529         0         0 -.0075359 -.0051249  .0253445   .007294         0
     p95 |  .5536387  .7340109  .8464256  .1759991   .031001   .385349  .4413549  .7011921  .2004234  .0285565
     p99 |  .9532402  1.016071  1.205311  .3934579  .3748002  .8987089  .6367285  1.094009  1.314052  .2668223
     Min | -.6164442 -.5466531 -.5378766         0         0 -.6225487 -.7011157 -.9904545         0         0
     Max |  1.611966  1.023336   1.62819  .4653421  .3748002  1.605099  .9597868  1.094009  1.314052  .2668223
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2014  r2_~2014  r3_~2014  debt_l..  debt_o..  r1_~2016  r2_~2016  r3_~2016  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       253       155       153       153       153       196       105       100       102       102
    Mean |  .0928361  .1973973  .2979791  .0768644  .0120172  .0096581  .0504324  .1096195  .0266412  .0025106
      SD |  .4612172  .6457126  .7232989  .2191633  .0605496  .2585265  .2542255  .2807631  .0704782  .0126405
      p1 | -.5635642 -.4688683 -.4395018         0         0 -.5578827 -.4601975 -.5834739         0         0
      p5 | -.3449184 -.3701276  -.330309         0         0  -.366886 -.2608742 -.2138244         0         0
     p50 |  .0445637  .0863823  .1514185         0         0  .0062113  .0375133  .0945483         0         0
     p95 |  .5988597  .7936591  1.154215  .2756088   .050966  .4328224  .3465296  .5996137  .0884074  .0077646
     p99 |  1.486807   2.34428  3.055795  1.800376  .5217718  1.062872  1.047735   1.37015  .3520817  .0897247
     Min | -.6703359 -.5018231 -.5427664         0         0 -.6648447 -.5787698 -.6982852         0         0
     Max |  5.729042  6.751129  6.986363  1.800376  .5217718  1.344325  1.509729  1.648858   .454522  .0897247
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2018  r2_~2018  r3_~2018  debt_l..  debt_o..  r1_~2020  r2_~2020  r3_~2020  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       178       107       106       106       106       141        84        83        83        83
    Mean |  .0454243  .1128755  .1764994  .0283966  .0004691  .0125306  .0535166  .0913277   .029496  .0059653
      SD |  .3044172  .2909933  .3384315  .0577623  .0026949  .2571984   .248369  .2844992  .0736821  .0227663
      p1 | -.6391615 -.2641401 -.2894666         0         0 -.4840035 -.4065714 -.7699105         0         0
      p5 | -.3576621 -.2309814 -.2483664         0         0 -.2752977 -.2419302 -.3002598         0         0
     p50 |  .0144044  .0447167   .086289         0         0         0  .0241578  .0765292         0         0
     p95 |  .4734204  .5910535  .6979086  .1375066  .0013187  .4030022  .4505746  .4657656  .1493643   .018959
     p99 |  1.243693  1.099612  1.234682  .2218665    .01595  .8990129  .9940506   1.08633  .3667025  .1220817
     Min | -.7248633 -.2644993 -.2894666         0         0 -.8050159 -.4065714 -.7699105         0         0
     Max |  1.676778  1.753679  1.849295  .2818295  .0227474  1.488443  .9940506   1.08633  .3667025  .1220817
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2022  r2_~2022  r3_~2022  debt_l..  debt_o..  r1_ann~g  r2_ann~g  r3_ann~g  debt_l~g  debt_o~g
---------+----------------------------------------------------------------------------------------------------
       N |       119        81        77        79        79      1627      1102      1083      1085      1085
    Mean |  .0620071   .076827  .1799496     .0272  .0026696  .0601267   .083722  .1588534  .0475837  .0063657
      SD |  .2919608  .2386651  .2627059  .0501551   .008963   .472134  .3977154  .4160665  .1234005  .0289001
      p1 | -.5255105 -.5325783 -.2101669         0         0 -.5333517  -.516197 -.5081249         0         0
      p5 | -.3202606 -.2402733 -.1799159         0         0 -.3085872 -.2621352 -.2740614         0         0
     p50 |   .053932  .0849551  .1103378         0         0  .0135205  .0378012   .099401         0         0
     p95 |  .5765883  .4633947  .5861469  .1332219  .0172518  .5142752  .5710464  .7923853  .2087224  .0265506
     p99 |  1.005806  1.042428  1.297496  .3112166  .0706157  1.243693  .9940506  1.355565  .3934579  .1220817
     Min | -.7276693 -.5325783 -.2101669         0         0 -.7248633 -.6921977 -.6982852         0         0
     Max |  1.085387  1.042428  1.297496  .3112166  .0706157  14.40743  6.846599  6.986363   1.93155  .3374559
--------------------------------------------------------------------------------------------------------------

. 
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_win
  8.         gen double `v'_win = `v'
  9.         replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 10.         replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 11.         local retwin "`retwin' `v'_win"
 12.     }
 13. }
(44,741 missing values generated)
(4 real changes made)
(4 real changes made)
(44,968 missing values generated)
(2 real changes made)
(2 real changes made)
(44,969 missing values generated)
(2 real changes made)
(4 real changes made)
(44,969 missing values generated)
(0 real changes made)
(1 real change made)
(44,969 missing values generated)
(0 real changes made)
(2 real changes made)
(44,829 missing values generated)
(4 real changes made)
(5 real changes made)
(44,991 missing values generated)
(2 real changes made)
(2 real changes made)
(44,997 missing values generated)
(1 real change made)
(4 real changes made)
(44,997 missing values generated)
(0 real changes made)
(2 real changes made)
(44,997 missing values generated)
(0 real changes made)
(2 real changes made)
(44,860 missing values generated)
(3 real changes made)
(2 real changes made)
(45,005 missing values generated)
(2 real changes made)
(2 real changes made)
(45,007 missing values generated)
(1 real change made)
(2 real changes made)
(45,007 missing values generated)
(0 real changes made)
(2 real changes made)
(45,007 missing values generated)
(0 real changes made)
(2 real changes made)
(44,838 missing values generated)
(2 real changes made)
(3 real changes made)
(44,994 missing values generated)
(2 real changes made)
(3 real changes made)
(44,997 missing values generated)
(2 real changes made)
(2 real changes made)
(44,997 missing values generated)
(0 real changes made)
(2 real changes made)
(44,997 missing values generated)
(0 real changes made)
(4 real changes made)
(44,932 missing values generated)
(3 real changes made)
(3 real changes made)
(45,039 missing values generated)
(2 real changes made)
(2 real changes made)
(45,046 missing values generated)
(1 real change made)
(3 real changes made)
(45,044 missing values generated)
(0 real changes made)
(1 real change made)
(45,044 missing values generated)
(0 real changes made)
(0 real changes made)
(44,915 missing values generated)
(3 real changes made)
(3 real changes made)
(45,031 missing values generated)
(2 real changes made)
(2 real changes made)
(45,037 missing values generated)
(1 real change made)
(0 real changes made)
(45,037 missing values generated)
(0 real changes made)
(0 real changes made)
(45,037 missing values generated)
(0 real changes made)
(0 real changes made)
(44,981 missing values generated)
(2 real changes made)
(2 real changes made)
(45,079 missing values generated)
(1 real change made)
(1 real change made)
(45,081 missing values generated)
(2 real changes made)
(3 real changes made)
(45,081 missing values generated)
(0 real changes made)
(0 real changes made)
(45,081 missing values generated)
(0 real changes made)
(0 real changes made)
(45,038 missing values generated)
(1 real change made)
(1 real change made)
(45,129 missing values generated)
(1 real change made)
(1 real change made)
(45,134 missing values generated)
(1 real change made)
(1 real change made)
(45,132 missing values generated)
(0 real changes made)
(1 real change made)
(45,132 missing values generated)
(0 real changes made)
(0 real changes made)
(45,056 missing values generated)
(1 real change made)
(1 real change made)
(45,127 missing values generated)
(1 real change made)
(1 real change made)
(45,128 missing values generated)
(0 real changes made)
(1 real change made)
(45,128 missing values generated)
(0 real changes made)
(1 real change made)
(45,128 missing values generated)
(0 real changes made)
(2 real changes made)
(45,093 missing values generated)
(1 real change made)
(1 real change made)
(45,150 missing values generated)
(0 real changes made)
(0 real changes made)
(45,151 missing values generated)
(0 real changes made)
(0 real changes made)
(45,151 missing values generated)
(0 real changes made)
(2 real changes made)
(45,151 missing values generated)
(0 real changes made)
(2 real changes made)
(45,115 missing values generated)
(1 real change made)
(1 real change made)
(45,153 missing values generated)
(0 real changes made)
(0 real changes made)
(45,157 missing values generated)
(0 real changes made)
(1 real change made)
(45,155 missing values generated)
(0 real changes made)
(0 real changes made)
(45,155 missing values generated)
(0 real changes made)
(0 real changes made)
(43,607 missing values generated)
(16 real changes made)
(16 real changes made)
(44,132 missing values generated)
(11 real changes made)
(11 real changes made)
(44,151 missing values generated)
(10 real changes made)
(12 real changes made)
(44,149 missing values generated)
(0 real changes made)
(10 real changes made)
(44,149 missing values generated)
(0 real changes made)
(11 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       493       266       265       265       265       405       243       237       237       237
    Mean |  .0468773  .0416725  .1218436  .0355024   .004285  .0950014  .0859777  .1633858  .0320296  .0070293
      SD |  .3743792  .3633475  .4116087  .0793681  .0157777  .3716288  .2710318  .3273619  .0677471  .0252303
      p1 | -.6167905 -.6022116 -.5148804         0         0 -.5252534 -.5232287 -.6224465         0         0
      p5 | -.4718977 -.4229425 -.4479376         0         0 -.3588377 -.2706537 -.2421369         0         0
     p50 |  .0056594 -.0005444  .0422868         0         0  .0328169  .0490236  .1078646         0         0
     p95 |  .7242457  .7708082  .9709566   .213954  .0261638  .7476402  .6561936   .811872  .1661904  .0486928
     p99 |  1.725554  1.461066  1.499686  .3915328  .0994896  1.817702  .8924631  1.284732  .3764944  .1622989
     Min | -.6167905 -.6022116 -.5148804         0         0 -.5252534 -.5232287 -.6224465         0         0
     Max |  1.725554  1.461066  1.499686  .3915328  .0994896  1.817702  .8924631  1.284732  .3764944  .1622989
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       374       229       227       227       227       396       240       237       237       237
    Mean |  .0788526  .1024039  .2069973  .0466509  .0022754  .0290235  .0693006  .1316576  .0496263  .0066135
      SD |  .2993298  .3265093   .365833  .0824256  .0064389  .2893496  .3207076  .3939084   .099861  .0290373
      p1 | -.6270329 -.6450034 -.5921583         0         0 -.6820788 -.5988332 -.4907238         0         0
      p5 | -.2865997 -.2683693 -.2295192         0         0 -.3403497 -.3134429 -.3009581         0         0
     p50 |  .0440619  .0597532  .1671381         0         0   -.00265  .0354036  .0672659  .0025649         0
     p95 |  .6093538  .6509691  .7857103  .2385978  .0184178  .5535702  .7038158  .8496103  .2127695  .0304579
     p99 |  1.616284  1.632388  1.873272  .3930429  .0373461  1.120404  1.631641  2.369574  .5425013  .2051924
     Min | -.6270329 -.6450034 -.5921583         0         0 -.6820788 -.5988332 -.4907238         0         0
     Max |  1.616284  1.632388  1.873272  .3930429  .0373461  1.120404  1.631641  2.369574  .5425013  .2051924
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       302       195       188       190       190       319       203       197       197       197
    Mean | -.0186328  .0225481   .053722  .0317824  .0113851  .0009223  .0128917  .0730966  .0547908    .00596
      SD |  .2734889   .294934  .3390876  .0666297  .0489438  .2396537  .2133906  .2737867  .1445196  .0278334
      p1 | -.5333517  -.452877 -.4811976         0         0 -.4919053  -.481191 -.7393317         0         0
      p5 | -.4062937 -.3265602 -.3762528         0         0 -.4027271 -.3123524 -.3437546         0         0
     p50 | -.0456618 -.0412463 -.0247529         0         0 -.0075359 -.0051249  .0253445   .007294         0
     p95 |  .5536387  .7340109  .8464256  .1759991   .031001   .385349  .4413549  .7011921  .2004234  .0285565
     p99 |  .9532402  1.016071  1.205311  .3934579  .3748002  .8987089  .6367285  1.094009  1.314052  .2668223
     Min | -.5333517  -.452877 -.4811976         0         0 -.4919053  -.481191 -.7393317         0         0
     Max |  .9532402  1.016071  1.205311  .3934579  .3748002  .8987089  .6367285  1.094009  1.314052  .2668223
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       253       155       153       153       153       196       105       100       102       102
    Mean |   .076049  .1691787  .2729641  .0768644  .0120172  .0087679  .0471617  .1079806  .0256369  .0025106
      SD |   .302695  .4085036  .5264883  .2191633  .0605496  .2504143  .2289267  .2630637  .0648236  .0126405
      p1 | -.5635642 -.4688683 -.4395018         0         0 -.5578827 -.4601975 -.5260682         0         0
      p5 | -.3449184 -.3701276  -.330309         0         0  -.366886 -.2608742 -.2138244         0         0
     p50 |  .0445637  .0863823  .1514185         0         0  .0062113  .0375133  .0945483         0         0
     p95 |  .5988597  .7936591  1.154215  .2756088   .050966  .4328224  .3465296  .5996137  .0884074  .0077646
     p99 |  1.486807   2.34428  3.055795  1.800376  .5217718  1.062872  1.047735  1.230796  .3520817  .0897247
     Min | -.5635642 -.4688683 -.4395018         0         0 -.5578827 -.4601975 -.5834739         0         0
     Max |  1.486807   2.34428  3.055795  1.800376  .5217718  1.062872  1.047735   1.37015  .3520817  .0897247
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       178       107       106       106       106       141        84        83        83        83
    Mean |  .0434728  .1067661  .1707011  .0278309   .000405  .0106269  .0535166  .0913277   .029496  .0059653
      SD |  .2916128  .2615794   .313873  .0555063   .002194  .2306254   .248369  .2844992  .0736821  .0227663
      p1 | -.6391615 -.2641401 -.2894666         0         0 -.4840035 -.4065714 -.7699105         0         0
      p5 | -.3576621 -.2309814 -.2483664         0         0 -.2752977 -.2419302 -.3002598         0         0
     p50 |  .0144044  .0447167   .086289         0         0         0  .0241578  .0765292         0         0
     p95 |  .4734204  .5910535  .6979086  .1375066  .0013187  .4030022  .4505746  .4657656  .1493643   .018959
     p99 |  1.243693  1.099612  1.234682  .2218665    .01595  .8990129  .9940506   1.08633  .3667025  .1220817
     Min | -.6391615 -.2641401 -.2894666         0         0 -.4840035 -.4065714 -.7699105         0         0
     Max |  1.243693  1.099612  1.234682  .2218665    .01595  .8990129  .9940506   1.08633  .3667025  .1220817
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  debt_l..  debt_o..  r1~g_win  r2~g_win  r3~g_win  debt_l..  debt_o..
---------+----------------------------------------------------------------------------------------------------
       N |       119        81        77        79        79      1627      1102      1083      1085      1085
    Mean |  .0630372   .076827  .1799496     .0272  .0026696  .0463816  .0701794  .1486629  .0426494  .0050533
      SD |  .2855764  .2386651  .2627059  .0501551   .008963  .2694271  .2587678  .3214863  .0799241   .017247
      p1 | -.5255105 -.5325783 -.2101669         0         0 -.5333517  -.516197 -.5081249         0         0
      p5 | -.3202606 -.2402733 -.1799159         0         0 -.3085872 -.2621352 -.2740614         0         0
     p50 |   .053932  .0849551  .1103378         0         0  .0135205  .0378012   .099401         0         0
     p95 |  .5765883  .4633947  .5861469  .1332219  .0172518  .5142752  .5710464  .7923853  .2087224  .0265506
     p99 |  1.005806  1.042428  1.297496  .3112166  .0706157  1.243693  .9940506  1.355565  .3934579  .1220817
     Min | -.5255105 -.5325783 -.2101669         0         0 -.5333517  -.516197 -.5081249         0         0
     Max |  1.005806  1.042428  1.297496  .3112166  .0706157  1.243693  .9940506  1.355565  .3934579  .1220817
--------------------------------------------------------------------------------------------------------------

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_processed.dta saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta"
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready
> _processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 closed on:   4 Feb 2026, 23:01:45
--------------------------------------------------------------------------------------------------------------
