--------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 opened on:   6 Feb 2026, 22:38:50

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_ready
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_returns_income.do and 03_prep
> _controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004  r1_~2006  r2_~2006
---------+----------------------------------------------------------------------------------------------------
       N |     13839      6936     13566     14186     12995      6427     12697     13354     14147      7248
    Mean |  .3396622  .1944209  .1090722  .1848722  .3029203  .3163339  .1063545  .1946736  .3239473  .3332173
      SD |  1.541005   1.04604  .5250122  .6326632  1.425314  1.183398  .5481141  .5880471   1.65343  1.302632
      p1 |        -1        -1        -1 -.6937918        -1        -1        -1 -.6775097        -1        -1
      p5 | -.8911069        -1 -.5302583 -.4259265 -.9086369  -.749186 -.5451412 -.3989889 -.9483774        -1
     p50 |  .0079683         0  .0660036  .0789075  .0157756   .075847  .0595106  .0956151    .02053  .1026689
     p95 |  2.649658  1.828427  .7460757  1.084809  2.464102  2.004615  .7507762  1.077448  2.403116  1.983571
     p99 |  6.870338  4.196152  1.966479  2.696371   6.20243  4.717954  1.910959  2.491039  6.877563  5.449806
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  14.16723  25.46074  23.66292  10.61895  11.12834  69.89464  20.25135
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_~2006  r4_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010
---------+----------------------------------------------------------------------------------------------------
       N |     13772     14292     13155      6735     12823     13284     11929      6129     11528     11889
    Mean |  .1479926  .2383437  .3333812  .2687441  .0191759  .1434432  .2243223  .2387422 -.0333831  .1037757
      SD |  .5879566  .6626324  1.586558  1.017611   .464199  .5836195  1.549668  1.088026  .4485891  .7769028
      p1 |        -1 -.7141943        -1        -1        -1  -.729281        -1        -1        -1 -.7930839
      p5 | -.5327307 -.4200744 -.9728337        -1 -.5686689  -.460196        -1  -.793374 -.7113249 -.4903043
     p50 |  .0940058  .1186374  .0074907  .0623782         0   .046832 -.0526641  .0202041 -.0398133  .0022376
     p95 |  .8641539  1.201723  2.605551  1.949286  .5811388         1  2.278028  1.927888  .5374122  .9920661
     p99 |         2  2.817026  7.103497  4.800067  1.645751  2.421445   6.64635  5.180615   1.44949  2.381849
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  25.27468  14.88412  24.93995  13.09965  8.354143  13.60593   30.6291  18.19091  6.905694  38.86622
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2012  r2_~2012  r3_~2012  r4_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r1_~2016  r2_~2016
---------+----------------------------------------------------------------------------------------------------
       N |     14018      7138     13705     14053     12536      6362     12496     13041     11136      5709
    Mean |  .2596012  .2401613  .0174181  .1481473   .335425  .2940857  .0870768  .2021447  .3009084  .2957962
      SD |  1.478589  1.172571   .532927  .6913277  1.675398  1.186066  .5695118  .6832872   1.59319  1.237407
      p1 |        -1        -1        -1 -.8179602        -1        -1        -1 -.7965277        -1        -1
      p5 |        -1        -1 -.6600654 -.4960107        -1        -1 -.5983903 -.4508806        -1      -.94
     p50 |         0  .0398785         0  .0380672  .0207523  .0879784  .0297761  .0806482  .0012243  .0448434
     p95 |  2.397546  1.938978  .6457015  1.070086  2.563706   2.02765  .8126539  1.204541   2.57398  2.047444
     p99 |  6.472728   4.91608  2.056931  2.741768         7  5.403124  2.162278  2.921935  6.937254  6.117423
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  32.21445  23.73228  7.732125  15.16014   53.0643  19.52766  10.63329  16.48519  29.41156  14.40202
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_~2016  r4_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------------------------------------
       N |     11131     11698     11127      5584     11342     11837      9539      4967      9911     10395
    Mean |  .0837633  .2086831  .3332256   .308336   .104337  .2293031  .3558075  .2715184  .1003054  .2187182
      SD |  .5333981  .7069182  1.850102  1.458529  .5772518  .8541944   1.64541  1.232958  .5717823  .7287121
      p1 |        -1 -.8306918        -1        -1        -1 -.8102633        -1        -1        -1 -.7675047
      p5 | -.6181187 -.4634546        -1        -1 -.6358617 -.4896031        -1        -1 -.5948098 -.4672046
     p50 |   .041465  .0761038  .0067374  .0653638  .0508033  .0935655  .0319569   .045336  .0488088  .0764125
     p95 |  .7663522  1.274624  2.676955  2.171233  .8257419  1.352213    2.8735  2.155947  .7888544  1.353798
     p99 |  2.117991  2.971262  7.017027  5.831301  2.229795  3.083912  7.575514  5.287554  2.162278  3.106588
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  9.148892  13.91854  69.73189   58.4359    11.498  52.74273  28.18904   21.9638  14.09967  26.14854
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g
---------+--------------------------------------------------------------------------------
       N |      8330      4431      8523      9168     27784     15135     25975     28341
    Mean |  .3785716  .3496379  .2032635  .3230414   .256425  .2161744  .0566878  .2208084
      SD |  1.836335   1.41289  .6688735  .8597685  1.070319  .8415117  .4089999  .5209462
      p1 |        -1        -1        -1 -.7842487        -1        -1        -1  -.770246
      p5 |        -1 -.7870009 -.5690029 -.4266178        -1        -1 -.6348516 -.3306858
     p50 |  .0382838  .0901743  .1319231  .1545613  .1139262  .1217633  .0598376  .1226826
     p95 |  2.751666  1.986637  1.009975  1.609422  1.766544  1.490211  .5475788  1.034315
     p99 |  7.660254  6.271499  2.546681  3.653171  4.221698  2.898109  1.326594  2.141008
     Min |        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  41.09515  24.23998  12.82027  19.67032  26.80398  17.15342  10.78983  13.45894
------------------------------------------------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(31,395 missing values generated)
(139 real changes made, 139 to missing)
(38,298 missing values generated)
(69 real changes made, 69 to missing)
(31,668 missing values generated)
(137 real changes made, 137 to missing)
(31,048 missing values generated)
(283 real changes made, 283 to missing)
(32,239 missing values generated)
(129 real changes made, 129 to missing)
(38,807 missing values generated)
(64 real changes made, 64 to missing)
(32,537 missing values generated)
(128 real changes made, 128 to missing)
(31,880 missing values generated)
(266 real changes made, 266 to missing)
(31,087 missing values generated)
(141 real changes made, 141 to missing)
(37,986 missing values generated)
(72 real changes made, 72 to missing)
(31,462 missing values generated)
(139 real changes made, 139 to missing)
(30,942 missing values generated)
(284 real changes made, 284 to missing)
(32,079 missing values generated)
(131 real changes made, 131 to missing)
(38,499 missing values generated)
(68 real changes made, 68 to missing)
(32,411 missing values generated)
(133 real changes made, 133 to missing)
(31,950 missing values generated)
(264 real changes made, 264 to missing)
(33,305 missing values generated)
(119 real changes made, 119 to missing)
(39,105 missing values generated)
(61 real changes made, 61 to missing)
(33,706 missing values generated)
(113 real changes made, 113 to missing)
(33,345 missing values generated)
(236 real changes made, 236 to missing)
(31,216 missing values generated)
(139 real changes made, 139 to missing)
(38,096 missing values generated)
(71 real changes made, 71 to missing)
(31,529 missing values generated)
(137 real changes made, 137 to missing)
(31,181 missing values generated)
(280 real changes made, 280 to missing)
(32,698 missing values generated)
(123 real changes made, 123 to missing)
(38,872 missing values generated)
(63 real changes made, 63 to missing)
(32,738 missing values generated)
(120 real changes made, 120 to missing)
(32,193 missing values generated)
(260 real changes made, 260 to missing)
(34,098 missing values generated)
(111 real changes made, 111 to missing)
(39,525 missing values generated)
(57 real changes made, 57 to missing)
(34,103 missing values generated)
(111 real changes made, 111 to missing)
(33,536 missing values generated)
(232 real changes made, 232 to missing)
(34,107 missing values generated)
(111 real changes made, 111 to missing)
(39,650 missing values generated)
(55 real changes made, 55 to missing)
(33,892 missing values generated)
(114 real changes made, 114 to missing)
(33,397 missing values generated)
(236 real changes made, 236 to missing)
(35,695 missing values generated)
(95 real changes made, 95 to missing)
(40,267 missing values generated)
(49 real changes made, 49 to missing)
(35,323 missing values generated)
(97 real changes made, 97 to missing)
(34,839 missing values generated)
(206 real changes made, 206 to missing)
(36,904 missing values generated)
(83 real changes made, 83 to missing)
(40,803 missing values generated)
(43 real changes made, 43 to missing)
(36,711 missing values generated)
(84 real changes made, 84 to missing)
(36,066 missing values generated)
(183 real changes made, 183 to missing)
(17,450 missing values generated)
(277 real changes made, 277 to missing)
(30,099 missing values generated)
(151 real changes made, 151 to missing)
(19,259 missing values generated)
(258 real changes made, 258 to missing)
(16,893 missing values generated)
(567 real changes made, 567 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     13700      6867     13429     13903     12866      6363     12569     13088     14006      7176
    Mean |   .234503  .1288434  .0762108  .1517041  .2073775  .2389431  .0704277  .1663922  .2123221  .2405644
      SD |  1.053662  .7558769  .3746522  .4301164  .9695387  .7901379  .3727929  .4130015  1.013846  .8050799
      p1 |        -1        -1        -1 -.6031034        -1        -1        -1 -.5775652        -1        -1
      p5 | -.8940194        -1 -.5337476 -.3938097  -.909955 -.7523211 -.5480539 -.3647329 -.9552786        -1
     p50 |  .0030075         0  .0623424   .078838  .0114411  .0709268  .0567245  .0955945  .0142974  .0994983
     p95 |  2.275186  1.645751  .6745392  .9708241  2.104151   1.75471  .6532796  .9705163  2.162278  1.732571
     p99 |  4.878539   3.08899  1.349153   1.81029  4.291616  3.365612  1.265686  1.729282  4.482554  3.543127
     Min |        -1        -1        -1 -.6937918        -1        -1        -1 -.6775097        -1        -1
     Max |  6.844645  4.196152   1.95804  2.675682   6.20243  4.717954  1.886751  2.477198  6.877563  5.449806
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     13633     14008     13024      6667     12690     13020     11810      6068     11415     11653
    Mean |  .1133527  .2065837   .222764  .2065831 -.0106435  .1168596  .1142589  .1680262 -.0602623  .0700509
      SD |  .3978831  .4734921  1.082296   .797839  .3357504  .4161425  .9846474  .7973205  .3371213  .4233839
      p1 |        -1 -.6210918        -1        -1        -1 -.6301772        -1        -1        -1 -.6761512
      p5 |   -.53709  -.382586 -.9814037        -1 -.5728476 -.4254837        -1 -.7984674 -.7247271 -.4573978
     p50 |  .0897247  .1186374  .0037938  .0594717         0   .046832 -.0577547  .0159083 -.0419514  .0022376
     p95 |  .7593289  1.100651  2.318147   1.70107        .5  .9183278  1.999839  1.680264  .4687215  .8695556
     p99 |  1.435843  2.116775  5.123724   3.57802  1.081666  1.774887  4.467073  3.617967  .9245009  1.780887
     Min |        -1 -.7141943        -1        -1        -1  -.729281        -1        -1        -1 -.7930839
     Max |  1.997601  2.817026  7.103497  4.775812  1.618615  2.421445   6.64635  5.180615   1.44949  2.381849
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     13879      7067     13568     13773     12413      6299     12376     12781     11025      5652
    Mean |  .1579306  .1626704 -.0182825  .1126598   .224372  .2148021  .0497987  .1695496  .1899521  .2115744
      SD |  .9919995  .8012615  .3663141  .4481693  1.057766  .8230404  .3990992   .469675  1.064889  .8881307
      p1 |        -1        -1        -1 -.6843536        -1        -1        -1 -.6623611        -1        -1
      p5 |        -1        -1 -.6619383 -.4572772        -1        -1 -.6006097 -.4111944        -1 -.9572917
     p50 |         0  .0370017         0  .0380672  .0148892  .0828811  .0281452  .0806482         0  .0419761
     p95 |  2.140838   1.70814  .5445931  .9621417  2.282276  1.762586  .7230061  1.077699  2.163683   1.79732
     p99 |  4.477226  3.516636  1.236068  1.920432  4.720776  3.797215  1.483277  2.041671   4.91608  4.477226
     Min |        -1        -1        -1 -.8179602        -1        -1        -1 -.7965277        -1        -1
     Max |  6.472728   4.91608  2.056931  2.741768         7  5.403124  2.162278  2.921935  6.937254  6.117423
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     11020     11466     11016      5529     11228     11601      9444      4918      9814     10189
    Mean |   .049653  .1738184  .2117889  .2159459  .0661651  .1912799   .244405  .1904783  .0640239  .1859051
      SD |  .3909237  .4900443  1.103074  .8657765  .4016166  .5108821  1.140538  .8420146  .3961029  .5158326
      p1 |        -1 -.6819202        -1        -1        -1 -.6893688        -1        -1        -1 -.6525958
      p5 | -.6205847  -.423343        -1        -1 -.6439655 -.4510124        -1        -1 -.6013846 -.4343146
     p50 |  .0397505  .0761038  .0027707  .0606602  .0488088  .0935655  .0255319  .0419342  .0478737  .0764125
     p95 |  .6747417  1.155597   2.34109  2.003997  .7320508  1.197188  2.424665  1.907362  .6903085  1.208397
     p99 |  1.345208  2.181124  4.945587  3.971921  1.469818  2.199792  5.204837  3.830459   1.48998  2.290862
     Min |        -1 -.8306918        -1        -1        -1 -.8102633        -1        -1        -1 -.7675047
     Max |  2.117991  2.971262  7.017027  5.831301   2.22933  3.083912  7.575514  5.287554  2.162278  3.106588
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+--------------------------------------------------------------------------------
       N |      8247      4388      8439      8985     27507     14984     25717     27774
    Mean |  .2503438  .2472784   .160803  .2780923  .1868483  .1680521  .0346006    .20017
      SD |   1.14561  .8622724  .4512171  .5730132  .7435077  .6336809  .3247381  .3722524
      p1 |        -1        -1        -1 -.6309601        -1        -1        -1 -.6090735
      p5 |        -1 -.7965405 -.5874315 -.3808035        -1        -1 -.6428571 -.2802292
     p50 |  .0318477  .0875946   .129159  .1544941  .1100575   .118034  .0585784  .1226713
     p95 |  2.374056  1.725541  .9272482  1.428056  1.594414  1.345208  .4855696  .9475073
     p99 |  5.448488  4.293156  1.730301  2.582455  2.932882  2.226618   .942162  1.584801
     Min |        -1        -1        -1 -.7842487        -1        -1        -1  -.770246
     Max |  7.660254  6.271499  2.546681  3.652204  4.221698  2.898109  1.326594   2.13823
------------------------------------------------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r1_~2004  r2_~2004  r3_~2004  r4_~2004  r1_~2006  r2_~2006
---------+----------------------------------------------------------------------------------------------------
       N |     13839      6936     13566     14186     12995      6427     12697     13354     14147      7248
    Mean |  .3396622  .1944209  .1090722  .1848722  .3029203  .3163339  .1063545  .1946736  .3239473  .3332173
      SD |  1.541005   1.04604  .5250122  .6326632  1.425314  1.183398  .5481141  .5880471   1.65343  1.302632
      p1 |        -1        -1        -1 -.6937918        -1        -1        -1 -.6775097        -1        -1
      p5 | -.8911069        -1 -.5302583 -.4259265 -.9086369  -.749186 -.5451412 -.3989889 -.9483774        -1
     p50 |  .0079683         0  .0660036  .0789075  .0157756   .075847  .0595106  .0956151    .02053  .1026689
     p95 |  2.649658  1.828427  .7460757  1.084809  2.464102  2.004615  .7507762  1.077448  2.403116  1.983571
     p99 |  6.870338  4.196152  1.966479  2.696371   6.20243  4.717954  1.910959  2.491039  6.877563  5.449806
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  14.16723  25.46074  23.66292  10.61895  11.12834  69.89464  20.25135
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_~2006  r4_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r1_~2010  r2_~2010  r3_~2010  r4_~2010
---------+----------------------------------------------------------------------------------------------------
       N |     13772     14292     13155      6735     12823     13284     11929      6129     11528     11889
    Mean |  .1479926  .2383437  .3333812  .2687441  .0191759  .1434432  .2243223  .2387422 -.0333831  .1037757
      SD |  .5879566  .6626324  1.586558  1.017611   .464199  .5836195  1.549668  1.088026  .4485891  .7769028
      p1 |        -1 -.7141943        -1        -1        -1  -.729281        -1        -1        -1 -.7930839
      p5 | -.5327307 -.4200744 -.9728337        -1 -.5686689  -.460196        -1  -.793374 -.7113249 -.4903043
     p50 |  .0940058  .1186374  .0074907  .0623782         0   .046832 -.0526641  .0202041 -.0398133  .0022376
     p95 |  .8641539  1.201723  2.605551  1.949286  .5811388         1  2.278028  1.927888  .5374122  .9920661
     p99 |         2  2.817026  7.103497  4.800067  1.645751  2.421445   6.64635  5.180615   1.44949  2.381849
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  25.27468  14.88412  24.93995  13.09965  8.354143  13.60593   30.6291  18.19091  6.905694  38.86622
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2012  r2_~2012  r3_~2012  r4_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r1_~2016  r2_~2016
---------+----------------------------------------------------------------------------------------------------
       N |     14018      7138     13705     14053     12536      6362     12496     13041     11136      5709
    Mean |  .2596012  .2401613  .0174181  .1481473   .335425  .2940857  .0870768  .2021447  .3009084  .2957962
      SD |  1.478589  1.172571   .532927  .6913277  1.675398  1.186066  .5695118  .6832872   1.59319  1.237407
      p1 |        -1        -1        -1 -.8179602        -1        -1        -1 -.7965277        -1        -1
      p5 |        -1        -1 -.6600654 -.4960107        -1        -1 -.5983903 -.4508806        -1      -.94
     p50 |         0  .0398785         0  .0380672  .0207523  .0879784  .0297761  .0806482  .0012243  .0448434
     p95 |  2.397546  1.938978  .6457015  1.070086  2.563706   2.02765  .8126539  1.204541   2.57398  2.047444
     p99 |  6.472728   4.91608  2.056931  2.741768         7  5.403124  2.162278  2.921935  6.937254  6.117423
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  32.21445  23.73228  7.732125  15.16014   53.0643  19.52766  10.63329  16.48519  29.41156  14.40202
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_~2016  r4_~2016  r1_~2018  r2_~2018  r3_~2018  r4_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------------------------------------
       N |     11131     11698     11127      5584     11342     11837      9539      4967      9911     10395
    Mean |  .0837633  .2086831  .3332256   .308336   .104337  .2293031  .3558075  .2715184  .1003054  .2187182
      SD |  .5333981  .7069182  1.850102  1.458529  .5772518  .8541944   1.64541  1.232958  .5717823  .7287121
      p1 |        -1 -.8306918        -1        -1        -1 -.8102633        -1        -1        -1 -.7675047
      p5 | -.6181187 -.4634546        -1        -1 -.6358617 -.4896031        -1        -1 -.5948098 -.4672046
     p50 |   .041465  .0761038  .0067374  .0653638  .0508033  .0935655  .0319569   .045336  .0488088  .0764125
     p95 |  .7663522  1.274624  2.676955  2.171233  .8257419  1.352213    2.8735  2.155947  .7888544  1.353798
     p99 |  2.117991  2.971262  7.017027  5.831301  2.229795  3.083912  7.575514  5.287554  2.162278  3.106588
     Min |        -1        -1        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  9.148892  13.91854  69.73189   58.4359    11.498  52.74273  28.18904   21.9638  14.09967  26.14854
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r1_ann~g  r2_ann~g  r3_ann~g  r4_ann~g
---------+--------------------------------------------------------------------------------
       N |      8330      4431      8523      9168     27784     15135     25975     28341
    Mean |  .3785716  .3496379  .2032635  .3230414   .256425  .2161744  .0566878  .2208084
      SD |  1.836335   1.41289  .6688735  .8597685  1.070319  .8415117  .4089999  .5209462
      p1 |        -1        -1        -1 -.7842487        -1        -1        -1  -.770246
      p5 |        -1 -.7870009 -.5690029 -.4266178        -1        -1 -.6348516 -.3306858
     p50 |  .0382838  .0901743  .1319231  .1545613  .1139262  .1217633  .0598376  .1226826
     p95 |  2.751666  1.986637  1.009975  1.609422  1.766544  1.490211  .5475788  1.034315
     p99 |  7.660254  6.271499  2.546681  3.653171  4.221698  2.898109  1.326594  2.141008
     Min |        -1        -1        -1        -1        -1        -1        -1        -1
     Max |  41.09515  24.23998  12.82027  19.67032  26.80398  17.15342  10.78983  13.45894
------------------------------------------------------------------------------------------

. 
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_win
  8.         gen double `v'_win = `v'
  9.         replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 10.         replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 11.         local retwin "`retwin' `v'_win"
 12.     }
 13. }
(31,395 missing values generated)
(0 real changes made)
(139 real changes made)
(38,298 missing values generated)
(0 real changes made)
(69 real changes made)
(31,668 missing values generated)
(0 real changes made)
(137 real changes made)
(31,048 missing values generated)
(141 real changes made)
(142 real changes made)
(32,239 missing values generated)
(0 real changes made)
(129 real changes made)
(38,807 missing values generated)
(0 real changes made)
(64 real changes made)
(32,537 missing values generated)
(0 real changes made)
(128 real changes made)
(31,880 missing values generated)
(132 real changes made)
(134 real changes made)
(31,087 missing values generated)
(0 real changes made)
(141 real changes made)
(37,986 missing values generated)
(0 real changes made)
(72 real changes made)
(31,462 missing values generated)
(0 real changes made)
(139 real changes made)
(30,942 missing values generated)
(142 real changes made)
(142 real changes made)
(32,079 missing values generated)
(0 real changes made)
(131 real changes made)
(38,499 missing values generated)
(0 real changes made)
(68 real changes made)
(32,411 missing values generated)
(0 real changes made)
(133 real changes made)
(31,950 missing values generated)
(132 real changes made)
(132 real changes made)
(33,305 missing values generated)
(0 real changes made)
(119 real changes made)
(39,105 missing values generated)
(0 real changes made)
(61 real changes made)
(33,706 missing values generated)
(0 real changes made)
(113 real changes made)
(33,345 missing values generated)
(118 real changes made)
(118 real changes made)
(31,216 missing values generated)
(0 real changes made)
(139 real changes made)
(38,096 missing values generated)
(0 real changes made)
(71 real changes made)
(31,529 missing values generated)
(0 real changes made)
(137 real changes made)
(31,181 missing values generated)
(140 real changes made)
(140 real changes made)
(32,698 missing values generated)
(0 real changes made)
(123 real changes made)
(38,872 missing values generated)
(0 real changes made)
(63 real changes made)
(32,738 missing values generated)
(0 real changes made)
(120 real changes made)
(32,193 missing values generated)
(130 real changes made)
(130 real changes made)
(34,098 missing values generated)
(0 real changes made)
(111 real changes made)
(39,525 missing values generated)
(0 real changes made)
(57 real changes made)
(34,103 missing values generated)
(0 real changes made)
(111 real changes made)
(33,536 missing values generated)
(116 real changes made)
(116 real changes made)
(34,107 missing values generated)
(0 real changes made)
(111 real changes made)
(39,650 missing values generated)
(0 real changes made)
(55 real changes made)
(33,892 missing values generated)
(0 real changes made)
(114 real changes made)
(33,397 missing values generated)
(118 real changes made)
(118 real changes made)
(35,695 missing values generated)
(0 real changes made)
(95 real changes made)
(40,267 missing values generated)
(0 real changes made)
(49 real changes made)
(35,323 missing values generated)
(0 real changes made)
(97 real changes made)
(34,839 missing values generated)
(103 real changes made)
(103 real changes made)
(36,904 missing values generated)
(0 real changes made)
(83 real changes made)
(40,803 missing values generated)
(0 real changes made)
(43 real changes made)
(36,711 missing values generated)
(0 real changes made)
(84 real changes made)
(36,066 missing values generated)
(91 real changes made)
(92 real changes made)
(17,450 missing values generated)
(0 real changes made)
(277 real changes made)
(30,099 missing values generated)
(0 real changes made)
(151 real changes made)
(19,259 missing values generated)
(0 real changes made)
(258 real changes made)
(16,893 missing values generated)
(283 real changes made)
(284 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     13839      6936     13566     14186     12995      6427     12697     13354     14147      7248
    Mean |  .3011539  .1693054  .0953002  .1687722  .2668898   .283545  .0889824  .1813771   .278753  .2923118
      SD |  1.239727  .8535941  .4179342  .5029369   1.13311  .9032796  .4139833  .4777217  1.206663  .9532251
      p1 |        -1        -1        -1 -.6937918        -1        -1        -1 -.6775097        -1        -1
      p5 | -.8911069        -1 -.5302583 -.4259265 -.9086369  -.749186 -.5451412 -.3989889 -.9483774        -1
     p50 |  .0079683         0  .0660036  .0789075  .0157756   .075847  .0595106  .0956151    .02053  .1026689
     p95 |  2.649658  1.828427  .7460757  1.084809  2.464102  2.004615  .7507762  1.077448  2.403116  1.983571
     p99 |  6.870338  4.196152  1.966479  2.696371   6.20243  4.717954  1.910959  2.491039  6.877563  5.449806
     Min |        -1        -1        -1 -.6937918        -1        -1        -1 -.6775097        -1        -1
     Max |  6.870338  4.196152  1.966479  2.696371   6.20243  4.717954  1.910959  2.491039  6.877563  5.449806
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     13772     14292     13155      6735     12823     13284     11929      6129     11528     11889
    Mean |  .1323946  .2233716  .2912837  .2529612  .0065366  .1313518   .179421  .2179149 -.0454634  .0844291
      SD |  .4384954  .5436838  1.275345  .9170806  .3737956  .4789747  1.175284  .9364908  .3669636  .4857283
      p1 |        -1 -.7141943        -1        -1        -1  -.729281        -1        -1        -1 -.7930839
      p5 | -.5327307 -.4200744 -.9728337        -1 -.5686689  -.460196        -1  -.793374 -.7113249 -.4903043
     p50 |  .0940058  .1186374  .0074907  .0623782         0   .046832 -.0526641  .0202041 -.0398133  .0022376
     p95 |  .8641539  1.201723  2.605551  1.949286  .5811388         1  2.278028  1.927888  .5374122  .9920661
     p99 |         2  2.817026  7.103497  4.800067  1.645751  2.421445   6.64635  5.180615   1.44949  2.381849
     Min |        -1 -.7141943        -1        -1        -1  -.729281        -1        -1        -1 -.7930839
     Max |         2  2.817026  7.103497  4.800067  1.645751  2.421445   6.64635  5.180615   1.44949  2.381849
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     14018      7138     13705     14053     12536      6362     12496     13041     11136      5709
    Mean |   .220547  .2099515  .0024621  .1295807  .2908527  .2661797   .070085  .1873566   .257207  .2705398
      SD |  1.168684  .9263773  .4188875  .5235092  1.246577   .966774  .4474334   .548368  1.253791  1.061001
      p1 |        -1        -1        -1 -.8179602        -1        -1        -1 -.7965277        -1        -1
      p5 |        -1        -1 -.6600654 -.4960107        -1        -1 -.5983903 -.4508806        -1      -.94
     p50 |         0  .0398785         0  .0380672  .0207523  .0879784  .0297761  .0806482  .0012243  .0448434
     p95 |  2.397546  1.938978  .6457015  1.070086  2.563706   2.02765  .8126539  1.204541   2.57398  2.047444
     p99 |  6.472728   4.91608  2.056931  2.741768         7  5.403124  2.162278  2.921935  6.937254  6.117423
     Min |        -1        -1        -1 -.8179602        -1        -1        -1 -.7965277        -1        -1
     Max |  6.472728   4.91608  2.056931  2.741768         7  5.403124  2.162278  2.921935  6.937254  6.117423
--------------------------------------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------------------------------------
       N |     11131     11698     11127      5584     11342     11837      9539      4967      9911     10395
    Mean |  .0702787  .1915975  .2796762  .2712548   .087912  .2101317  .3174164  .2407615  .0845597   .205398
      SD |   .439928  .5680483  1.289207  1.024578  .4541565  .5906437  1.348276  .9776568  .4450098  .5949536
      p1 |        -1 -.8306918        -1        -1        -1 -.8102633        -1        -1        -1 -.7675047
      p5 | -.6181187 -.4634546        -1        -1 -.6358617 -.4896031        -1        -1 -.5948098 -.4672046
     p50 |   .041465  .0761038  .0067374  .0653638  .0508033  .0935655  .0319569   .045336  .0488088  .0764125
     p95 |  .7663522  1.274624  2.676955  2.171233  .8257419  1.352213    2.8735  2.155947  .7888544  1.353798
     p99 |  2.117991  2.971262  7.017027  5.831301  2.229795  3.083912  7.575514  5.287554  2.162278  3.106588
     Min |        -1 -.8306918        -1        -1        -1 -.8102633        -1        -1        -1 -.7675047
     Max |  2.117991  2.971262  7.017027  5.831301  2.229795  3.083912  7.575514  5.287554  2.162278  3.106588
--------------------------------------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r1~g_win  r2~g_win  r3~g_win  r4~g_win
---------+--------------------------------------------------------------------------------
       N |      8330      4431      8523      9168     27784     15135     25975     28341
    Mean |  .3241761  .3057396  .1843175  .3014163  .2270748  .1952895  .0474335  .2099287
      SD |  1.356852  1.041701  .5070959  .6684087  .8414201  .6864166  .3475965  .4276169
      p1 |        -1        -1        -1 -.7842487        -1        -1        -1  -.770246
      p5 |        -1 -.7870009 -.5690029 -.4266178        -1        -1 -.6348516 -.3306858
     p50 |  .0382838  .0901743  .1319231  .1545613  .1139262  .1217633  .0598376  .1226826
     p95 |  2.751666  1.986637  1.009975  1.609422  1.766544  1.490211  .5475788  1.034315
     p99 |  7.660254  6.271499  2.546681  3.653171  4.221698  2.898109  1.326594  2.141008
     Min |        -1        -1        -1 -.7842487        -1        -1        -1  -.770246
     Max |  7.660254  6.271499  2.546681  3.653171  4.221698  2.898109  1.326594  2.141008
------------------------------------------------------------------------------------------

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_processed.dta saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta"
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready
> _processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_processing_returns.log
  log type:  text
 closed on:   6 Feb 2026, 22:38:53
--------------------------------------------------------------------------------------------------------------
