---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_pro
> cessing_returns.log
  log type:  text
 opened on:  17 Feb 2026, 16:11:16

. 
. * Prefer processed dataset (to keep income processing), fallback to analysis_re
> ady
. capture confirm file "${PROCESSED}/analysis_ready_processed.dta"

. if _rc {
.     use "${PROCESSED}/analysis_ready.dta", clear
. }

. else {
.     use "${PROCESSED}/analysis_ready_processed.dta", clear
. }

. 
. * Returns list (waves + averages) - only keep variables that exist
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' r5_
> annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg r5_annual_
> avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Stop if no return variables found
. if "`retvars'" == "" {
.     display as error "05: No return variables found in dataset. Run 02_compute_
> returns_income.do and 03_prep_controls.do first."
.     log close
.     exit 0
. }

. 
. * ---------------------------------------------------------------------
. * Trim top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% trimming on returns ==="
=== 1% trimming on returns ===

. display "Tabstat returns before trimming"
Tabstat returns before trimming

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004
---------+----------------------------------------------------------------------
       N |     13839      6934     13566      6713     14222     12995      6427
    Mean |  .3396622  .1886169  .1090722  .1307731   .184071  .3029203  .3083907
      SD |  1.541005  1.047375  .5250122  .6565495  .6265629  1.425314  1.182581
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036  .0164603  .0787754  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292
--------------------------------------------------------------------------------

   Stats |  r3_~2004  r4_~2004  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006
---------+----------------------------------------------------------------------
       N |     12697      6230     13378     14147      7247     13772      6970
    Mean |  .1063545  .1851812  .1934519  .3239473  .3262825  .1479926  .1959171
      SD |  .5481141  .6781613  .5842016   1.65343  1.302864  .5879566  .6819433
      p1 |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
      p5 | -.5451412 -.4799117  -.397324 -.9483774        -1 -.5327307 -.5387344
     p50 |  .0595106  .0654357  .0955441    .02053  .0996786  .0940058  .0821008
     p95 |  .7507762  1.227771  1.076938  2.403116  1.966479  .8641539  1.289254
     p99 |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  10.61895  15.65697  11.12834  69.89464  20.25135  25.27468  10.50237
--------------------------------------------------------------------------------

   Stats |  r5_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r5_~2008  r1_~2010
---------+----------------------------------------------------------------------
       N |     14325     13155      6735     12823      6496     13311     11929
    Mean |  .2379549  .3333812  .2615255  .0191759  .1597092   .143163  .2243223
      SD |  .6682234  1.586558  1.017483   .464199  .6429026  .5829101  1.549668
      p1 | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
      p5 | -.4169048 -.9728337        -1 -.5686689 -.5368095 -.4558613        -1
     p50 |  .1182693  .0074907  .0602312         0  .0477834  .0467583 -.0526641
     p95 |  1.196941  2.605551  1.923765  .5811388  1.168572  .9966639  2.278028
     p99 |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  14.88412  24.93995  13.09965  8.354143  7.647382  13.60593   30.6291
--------------------------------------------------------------------------------

   Stats |  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012  r3_~2012
---------+----------------------------------------------------------------------
       N |      6129     11528      5926     11929     14018      7136     13705
    Mean |  .2312687 -.0333831  .0935677  .1020659  .2596012  .2308468  .0174181
      SD |  1.086622  .4485891  .5855996   .774325  1.478589  1.170044   .532927
      p1 |        -1        -1   -.78236 -.7937624        -1        -1        -1
      p5 | -.8267949 -.7113249 -.5530107 -.4892756        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0052885  .0018197         0  .0369716         0
     p95 |  1.910762  .5374122  1.003842  .9832947  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228  7.732125
--------------------------------------------------------------------------------

   Stats |  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014
---------+----------------------------------------------------------------------
       N |      6785     14119     12536      6358     12496      5995     13108
    Mean |  .1159706  .1497033   .335425  .2840321  .0870768  .1730203    .20282
      SD |  .5818238  .6961885  1.675398  1.183632  .5695118  .6421902  .6821051
      p1 | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
      p5 | -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0354307  .0381487  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  1.054829  1.074333  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519
--------------------------------------------------------------------------------

   Stats |  r1_~2016  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018
---------+----------------------------------------------------------------------
       N |     11136      5709     11131      5431     11759     11127      5584
    Mean |  .3009084  .2866775  .0837633  .1576778  .2101002  .3332256  .2998575
      SD |   1.59319  1.235879  .5333981  .6894531  .7109116  1.850102  1.457984
      p1 |        -1        -1        -1  -.872792  -.831225        -1        -1
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546        -1        -1
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  29.41156  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359
--------------------------------------------------------------------------------

   Stats |  r3_~2018  r4_~2018  r5_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------
       N |     11342      5278     11881      9539      4966      9911      4674
    Mean |   .104337  .1756961  .2274402  .3558075  .2642764  .1003054   .145126
      SD |  .5772518  .6775247  .8503276   1.64541  1.230544  .5717823  .6135485
      p1 |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
      p5 | -.6358617 -.5635265 -.4916469        -1        -1 -.5948098 -.5397827
     p50 |  .0508033  .0707762  .0933268  .0319569  .0421834  .0488088  .0438695
     p95 |  .8257419  1.263184  1.342823    2.8735  2.134042  .7888544  1.186608
     p99 |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |    11.498  17.07862  52.74273  28.18904   21.9638  14.09967  7.063589
--------------------------------------------------------------------------------

   Stats |  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r5_~2022  r1_ann~g
---------+----------------------------------------------------------------------
       N |     10424      8330      4431      8523      4152      9190     27784
    Mean |  .2183637  .3785716  .3445914  .2032635   .200118  .3198696   .256425
      SD |  .7286876  1.836335  1.412149  .6688735  .7291838  .8504767  1.070319
      p1 | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
      p5 | -.4683276        -1 -.8036039 -.5690029 -.5210837 -.4271745        -1
     p50 |   .076495  .0382838  .0887893  .1319231   .081766  .1544909  .1139262
     p95 |  1.358543  2.751666  1.974895  1.009975  1.202837   1.58457  1.766544
     p99 |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  26.14854  41.09515  24.23998  12.82027  13.01873  19.67032  26.80398
--------------------------------------------------------------------------------

   Stats |  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+----------------------------------------
       N |     15130     25975     14548     28378
    Mean |  .2003307  .0566878  .1467673   .219458
      SD |  .8406199  .4089999  .5165544  .5162117
      p1 |        -1        -1 -.9247556 -.7674735
      p5 |        -1 -.6348516 -.5162661 -.3306088
     p50 |  .1155588  .0598376  .0958943  .1222377
     p95 |  1.458741  .5475788  .8874586  1.029693
     p99 |  2.872983  1.326594  1.988103  2.112304
     Min |        -1        -1        -1        -1
     Max |  16.80075  10.78983  13.01873  13.45894
--------------------------------------------------

. 
. local rettrim ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         capture drop `v'_trim
  8.         gen double `v'_trim = `v'
  9.         replace `v'_trim = . if `v'_trim < `p1' | `v'_trim > `p99'
 10.         local rettrim "`rettrim' `v'_trim"
 11.     }
 12. }
(31,395 missing values generated)
(139 real changes made, 139 to missing)
(38,300 missing values generated)
(69 real changes made, 69 to missing)
(31,668 missing values generated)
(137 real changes made, 137 to missing)
(38,521 missing values generated)
(133 real changes made, 133 to missing)
(31,012 missing values generated)
(284 real changes made, 284 to missing)
(32,239 missing values generated)
(129 real changes made, 129 to missing)
(38,807 missing values generated)
(64 real changes made, 64 to missing)
(32,537 missing values generated)
(128 real changes made, 128 to missing)
(39,004 missing values generated)
(125 real changes made, 125 to missing)
(31,856 missing values generated)
(266 real changes made, 266 to missing)
(31,087 missing values generated)
(141 real changes made, 141 to missing)
(37,987 missing values generated)
(72 real changes made, 72 to missing)
(31,462 missing values generated)
(139 real changes made, 139 to missing)
(38,264 missing values generated)
(138 real changes made, 138 to missing)
(30,909 missing values generated)
(285 real changes made, 285 to missing)
(32,079 missing values generated)
(131 real changes made, 131 to missing)
(38,499 missing values generated)
(68 real changes made, 68 to missing)
(32,411 missing values generated)
(133 real changes made, 133 to missing)
(38,738 missing values generated)
(127 real changes made, 127 to missing)
(31,923 missing values generated)
(266 real changes made, 266 to missing)
(33,305 missing values generated)
(119 real changes made, 119 to missing)
(39,105 missing values generated)
(61 real changes made, 61 to missing)
(33,706 missing values generated)
(113 real changes made, 113 to missing)
(39,308 missing values generated)
(120 real changes made, 120 to missing)
(33,305 missing values generated)
(238 real changes made, 238 to missing)
(31,216 missing values generated)
(139 real changes made, 139 to missing)
(38,098 missing values generated)
(70 real changes made, 70 to missing)
(31,529 missing values generated)
(137 real changes made, 137 to missing)
(38,449 missing values generated)
(133 real changes made, 133 to missing)
(31,115 missing values generated)
(281 real changes made, 281 to missing)
(32,698 missing values generated)
(123 real changes made, 123 to missing)
(38,876 missing values generated)
(62 real changes made, 62 to missing)
(32,738 missing values generated)
(120 real changes made, 120 to missing)
(39,239 missing values generated)
(118 real changes made, 118 to missing)
(32,126 missing values generated)
(262 real changes made, 262 to missing)
(34,098 missing values generated)
(111 real changes made, 111 to missing)
(39,525 missing values generated)
(57 real changes made, 57 to missing)
(34,103 missing values generated)
(111 real changes made, 111 to missing)
(39,803 missing values generated)
(108 real changes made, 108 to missing)
(33,475 missing values generated)
(234 real changes made, 234 to missing)
(34,107 missing values generated)
(111 real changes made, 111 to missing)
(39,650 missing values generated)
(55 real changes made, 55 to missing)
(33,892 missing values generated)
(114 real changes made, 114 to missing)
(39,956 missing values generated)
(104 real changes made, 104 to missing)
(33,353 missing values generated)
(236 real changes made, 236 to missing)
(35,695 missing values generated)
(95 real changes made, 95 to missing)
(40,268 missing values generated)
(49 real changes made, 49 to missing)
(35,323 missing values generated)
(97 real changes made, 97 to missing)
(40,560 missing values generated)
(92 real changes made, 92 to missing)
(34,810 missing values generated)
(208 real changes made, 208 to missing)
(36,904 missing values generated)
(83 real changes made, 83 to missing)
(40,803 missing values generated)
(43 real changes made, 43 to missing)
(36,711 missing values generated)
(84 real changes made, 84 to missing)
(41,082 missing values generated)
(81 real changes made, 81 to missing)
(36,044 missing values generated)
(181 real changes made, 181 to missing)
(17,450 missing values generated)
(277 real changes made, 277 to missing)
(30,104 missing values generated)
(151 real changes made, 151 to missing)
(19,259 missing values generated)
(258 real changes made, 258 to missing)
(30,686 missing values generated)
(291 real changes made, 291 to missing)
(16,856 missing values generated)
(567 real changes made, 567 to missing)

. 
. display "Tabstat returns after trimming"
Tabstat returns after trimming

. tabstat `rettrim', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13700      6865     13429      6580     13938     12866      6363
    Mean |   .234503   .122962  .0762108  .1007462  .1516474  .2073775  .2311523
      SD |  1.053662  .7571327  .3746522  .4885875  .4304899  .9695387  .7897159
      p1 |        -1        -1        -1 -.7165536 -.6037072        -1        -1
      p5 | -.8940194        -1 -.5337476 -.5328462 -.3942436  -.909955 -.8104528
     p50 |  .0030075 -.0002003  .0623424  .0164483  .0787754  .0114411  .0677879
     p95 |  2.275186  1.645751  .6745392  1.069663  .9701404  2.104151   1.74649
     p99 |  4.878539   3.08899  1.349153  1.894763  1.819711  4.291616  3.346033
     Min |        -1        -1        -1 -.8113064 -.6937918        -1        -1
     Max |  6.844645  4.196152   1.95804  2.508917  2.675682   6.20243  4.682331
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12569      6105     13112     14006      7175     13633      6832
    Mean |  .0704277  .1545074   .165838  .2123221  .2335815  .1133527  .1656299
      SD |  .3727929  .4824247  .4114668  1.013846   .805237  .3978831  .4956153
      p1 |        -1 -.6629001 -.5749145        -1        -1        -1 -.7152146
      p5 | -.5480539 -.4491307 -.3647887 -.9552786        -1   -.53709 -.5040994
     p50 |  .0567245  .0653036  .0955441  .0142974  .0954451  .0897247  .0821008
     p95 |  .6532796  1.113249  .9705163  2.162278    1.7313  .7593289   1.17409
     p99 |  1.265686  1.967221  1.707539  4.482554  3.527693  1.435843   1.92632
     Min |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
     Max |  1.886751  2.599531  2.427754  6.877563  5.449806  1.997601  2.572623
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14040     13024      6667     12690      6369     13045     11810
    Mean |  .2053553   .222764  .1993413 -.0106435  .1313931  .1165983  .1142589
      SD |  .4710272  1.082296   .797455  .3357504  .4903433  .4154594  .9846474
      p1 | -.6191094        -1        -1        -1 -.6909023 -.6301772        -1
      p5 | -.3811144 -.9814037        -1 -.5728476 -.4961685 -.4219862        -1
     p50 |  .1182735  .0037938  .0561177         0  .0478437  .0467583 -.0577547
     p95 |  1.093337  2.318147  1.690725        .5  1.073239  .9170495  1.999839
     p99 |  2.101062  5.123724   3.57802  1.081666  1.983203  1.776079  4.467073
     Min | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
     Max |  2.840652  7.103497  4.775812  1.618615  2.958517  2.399934   6.64635
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6068     11415      5806     11691     13879      7066     13568
    Mean |  .1605346 -.0602623  .0663088  .0683205  .1579306  .1539962 -.0182825
      SD |  .7950852  .3371213  .4357159  .4195796  .9919995  .7990525  .3663141
      p1 |        -1        -1 -.7130088 -.6761512        -1        -1        -1
      p5 | -.8294865 -.7247271 -.5239541 -.4574971        -1        -1 -.6619383
     p50 |  .0130995 -.0419514  .0048732  .0018197         0  .0346923         0
     p95 |    1.6603  .4687215  .8959416  .8591723  2.140838  1.688816  .5445931
     p99 |  3.617967  .9245009   1.54951  1.772484  4.477226  3.472136  1.236068
     Min |        -1        -1   -.78236 -.7937624        -1        -1        -1
     Max |  5.125684   1.44949  2.420211  2.355794  6.472728   4.91608  2.056931
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |      6652     13838     12413      6296     12376      5877     12846
    Mean |  .0927415  .1134153   .224372  .2054428  .0497987  .1457014  .1702902
      SD |  .4524688  .4499092  1.057766  .8209029  .3990992  .4850465  .4717364
      p1 | -.7622113 -.6837722        -1        -1        -1 -.7452426 -.6623611
      p5 | -.5455132 -.4580656        -1        -1 -.6006097 -.5081345 -.4108418
     p50 |  .0354257  .0381267  .0148892  .0804491  .0281452  .0702015  .0806943
     p95 |  .9449568  .9651783  2.282276  1.736177  .7230061  1.039986  1.080076
     p99 |  1.739428  1.929384  4.720776  3.729455  1.483277  2.035128  2.075791
     Min | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
     Max |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11025      5652     11020      5323     11525     11016      5529
    Mean |  .1899521  .2024728   .049653  .1258495  .1748421  .2117889   .207383
      SD |  1.064889  .8861669  .3909237   .475475  .4931591  1.103074   .863933
      p1 |        -1        -1        -1 -.7235945   -.67787        -1        -1
      p5 |        -1        -1 -.6205847 -.5143228 -.4229017        -1        -1
     p50 |         0   .040833  .0397505  .0503055  .0762494  .0027707   .059222
     p95 |  2.163683   1.72826  .6747417     1.038  1.158703   2.34109  1.987195
     p99 |   4.91608  4.477226  1.345208  1.967014   2.18651  4.945587  3.966555
     Min |        -1        -1        -1  -.872792  -.831225        -1        -1
     Max |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11228      5174     11645      9444      4917      9814      4582
    Mean |  .0661651  .1472323  .1898231   .244405  .1832918  .0640239  .1182089
      SD |  .4016166  .5005108  .5080469  1.140538   .840394  .3961029  .4688841
      p1 |        -1  -.742163 -.6901491        -1        -1        -1 -.7042663
      p5 | -.6439655 -.5295392 -.4522774        -1        -1 -.6013846 -.5029499
     p50 |  .0488088  .0707762  .0933268  .0255319  .0378473  .0478737  .0438695
     p95 |  .7320508  1.132743   1.19089  2.424665  1.893441  .6903085  1.058981
     p99 |  1.469818  2.047872  2.190298  5.204837  3.799028   1.48998  1.847608
     Min |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
     Max |   2.22933   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     10216      8247      4388      8439      4071      9009     27507
    Mean |  .1854734  .2503438  .2422629   .160803  .1636371  .2765548  .1868483
      SD |  .5153971   1.14561  .8620021  .4512171  .5006977  .5694698  .7435077
      p1 | -.6552167        -1        -1        -1 -.6898303 -.6275283        -1
      p5 |  -.434786        -1 -.8080499 -.5874315 -.4776279 -.3812053        -1
     p50 |   .076495  .0318477  .0849115   .129159  .0817462  .1544941  .1100575
     p95 |  1.214498  2.374056  1.713591  .9272482  1.090786  1.424699  1.594414
     p99 |  2.273982  5.448488  4.293156  1.730301  2.210039  2.570522  2.932882
     Min | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
     Max |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------
       N |     14979     25717     14257     27811
    Mean |  .1522798  .0346006  .1279839  .1993489
      SD |  .6331342  .3247381  .3768656  .3703789
      p1 |        -1        -1 -.7714634 -.6083005
      p5 |        -1 -.6428571 -.4693966 -.2789096
     p50 |  .1119479  .0585784  .0958677  .1222357
     p95 |  1.318205  .4855696  .7907887  .9433888
     p99 |  2.213023   .942162  1.492362  1.575525
     Min |        -1        -1 -.9247556 -.7674735
     Max |  2.872983  1.326594  1.976095   2.09979
--------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * Winsorize top/bottom 1% (per return variable)
. * ---------------------------------------------------------------------
. display "=== 1% winsorization on returns ==="
=== 1% winsorization on returns ===

. display "Tabstat returns before winsorization"
Tabstat returns before winsorization

. tabstat `retvars', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_~2002  r2_~2002  r3_~2002  r4_~2002  r5_~2002  r1_~2004  r2_~2004
---------+----------------------------------------------------------------------
       N |     13839      6934     13566      6713     14222     12995      6427
    Mean |  .3396622  .1886169  .1090722  .1307731   .184071  .3029203  .3083907
      SD |  1.541005  1.047375  .5250122  .6565495  .6265629  1.425314  1.182581
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036  .0164603  .0787754  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292
--------------------------------------------------------------------------------

   Stats |  r3_~2004  r4_~2004  r5_~2004  r1_~2006  r2_~2006  r3_~2006  r4_~2006
---------+----------------------------------------------------------------------
       N |     12697      6230     13378     14147      7247     13772      6970
    Mean |  .1063545  .1851812  .1934519  .3239473  .3262825  .1479926  .1959171
      SD |  .5481141  .6781613  .5842016   1.65343  1.302864  .5879566  .6819433
      p1 |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
      p5 | -.5451412 -.4799117  -.397324 -.9483774        -1 -.5327307 -.5387344
     p50 |  .0595106  .0654357  .0955441    .02053  .0996786  .0940058  .0821008
     p95 |  .7507762  1.227771  1.076938  2.403116  1.966479  .8641539  1.289254
     p99 |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  10.61895  15.65697  11.12834  69.89464  20.25135  25.27468  10.50237
--------------------------------------------------------------------------------

   Stats |  r5_~2006  r1_~2008  r2_~2008  r3_~2008  r4_~2008  r5_~2008  r1_~2010
---------+----------------------------------------------------------------------
       N |     14325     13155      6735     12823      6496     13311     11929
    Mean |  .2379549  .3333812  .2615255  .0191759  .1597092   .143163  .2243223
      SD |  .6682234  1.586558  1.017483   .464199  .6429026  .5829101  1.549668
      p1 | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
      p5 | -.4169048 -.9728337        -1 -.5686689 -.5368095 -.4558613        -1
     p50 |  .1182693  .0074907  .0602312         0  .0477834  .0467583 -.0526641
     p95 |  1.196941  2.605551  1.923765  .5811388  1.168572  .9966639  2.278028
     p99 |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  14.88412  24.93995  13.09965  8.354143  7.647382  13.60593   30.6291
--------------------------------------------------------------------------------

   Stats |  r2_~2010  r3_~2010  r4_~2010  r5_~2010  r1_~2012  r2_~2012  r3_~2012
---------+----------------------------------------------------------------------
       N |      6129     11528      5926     11929     14018      7136     13705
    Mean |  .2312687 -.0333831  .0935677  .1020659  .2596012  .2308468  .0174181
      SD |  1.086622  .4485891  .5855996   .774325  1.478589  1.170044   .532927
      p1 |        -1        -1   -.78236 -.7937624        -1        -1        -1
      p5 | -.8267949 -.7113249 -.5530107 -.4892756        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0052885  .0018197         0  .0369716         0
     p95 |  1.910762  .5374122  1.003842  .9832947  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228  7.732125
--------------------------------------------------------------------------------

   Stats |  r4_~2012  r5_~2012  r1_~2014  r2_~2014  r3_~2014  r4_~2014  r5_~2014
---------+----------------------------------------------------------------------
       N |      6785     14119     12536      6358     12496      5995     13108
    Mean |  .1159706  .1497033   .335425  .2840321  .0870768  .1730203    .20282
      SD |  .5818238  .6961885  1.675398  1.183632  .5695118  .6421902  .6821051
      p1 | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
      p5 | -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0354307  .0381487  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  1.054829  1.074333  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519
--------------------------------------------------------------------------------

   Stats |  r1_~2016  r2_~2016  r3_~2016  r4_~2016  r5_~2016  r1_~2018  r2_~2018
---------+----------------------------------------------------------------------
       N |     11136      5709     11131      5431     11759     11127      5584
    Mean |  .3009084  .2866775  .0837633  .1576778  .2101002  .3332256  .2998575
      SD |   1.59319  1.235879  .5333981  .6894531  .7109116  1.850102  1.457984
      p1 |        -1        -1        -1  -.872792  -.831225        -1        -1
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546        -1        -1
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  29.41156  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359
--------------------------------------------------------------------------------

   Stats |  r3_~2018  r4_~2018  r5_~2018  r1_~2020  r2_~2020  r3_~2020  r4_~2020
---------+----------------------------------------------------------------------
       N |     11342      5278     11881      9539      4966      9911      4674
    Mean |   .104337  .1756961  .2274402  .3558075  .2642764  .1003054   .145126
      SD |  .5772518  .6775247  .8503276   1.64541  1.230544  .5717823  .6135485
      p1 |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
      p5 | -.6358617 -.5635265 -.4916469        -1        -1 -.5948098 -.5397827
     p50 |  .0508033  .0707762  .0933268  .0319569  .0421834  .0488088  .0438695
     p95 |  .8257419  1.263184  1.342823    2.8735  2.134042  .7888544  1.186608
     p99 |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |    11.498  17.07862  52.74273  28.18904   21.9638  14.09967  7.063589
--------------------------------------------------------------------------------

   Stats |  r5_~2020  r1_~2022  r2_~2022  r3_~2022  r4_~2022  r5_~2022  r1_ann~g
---------+----------------------------------------------------------------------
       N |     10424      8330      4431      8523      4152      9190     27784
    Mean |  .2183637  .3785716  .3445914  .2032635   .200118  .3198696   .256425
      SD |  .7286876  1.836335  1.412149  .6688735  .7291838  .8504767  1.070319
      p1 | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
      p5 | -.4683276        -1 -.8036039 -.5690029 -.5210837 -.4271745        -1
     p50 |   .076495  .0382838  .0887893  .1319231   .081766  .1544909  .1139262
     p95 |  1.358543  2.751666  1.974895  1.009975  1.202837   1.58457  1.766544
     p99 |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  26.14854  41.09515  24.23998  12.82027  13.01873  19.67032  26.80398
--------------------------------------------------------------------------------

   Stats |  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+----------------------------------------
       N |     15130     25975     14548     28378
    Mean |  .2003307  .0566878  .1467673   .219458
      SD |  .8406199  .4089999  .5165544  .5162117
      p1 |        -1        -1 -.9247556 -.7674735
      p5 |        -1 -.6348516 -.5162661 -.3306088
     p50 |  .1155588  .0598376  .0958943  .1222377
     p95 |  1.458741  .5475788  .8874586  1.029693
     p99 |  2.872983  1.326594  1.988103  2.112304
     Min |        -1        -1        -1        -1
     Max |  16.80075  10.78983  13.01873  13.45894
--------------------------------------------------

. 
. * Winsorized names: stub_win_YYYY so 10_build_panel reshape long finds r1_annua
> l_win_*, r4_annual_win_*, r5_annual_win_*
. local retwin ""

. foreach v of local retvars {
  2.     capture confirm numeric variable `v'
  3.     if !_rc {
  4.         quietly summarize `v', detail
  5.         local p1 = r(p1)
  6.         local p99 = r(p99)
  7.         if regexm("`v'", "_([0-9]{4})$") {
  8.             local vyear = regexs(1)
  9.             local vstub = regexr("`v'", "_[0-9]{4}$", "")
 10.             capture drop `vstub'_win_`vyear'
 11.             gen double `vstub'_win_`vyear' = `v'
 12.             replace `vstub'_win_`vyear' = `p1' if `vstub'_win_`vyear' < `p1'
>  & !missing(`vstub'_win_`vyear')
 13.             replace `vstub'_win_`vyear' = `p99' if `vstub'_win_`vyear' > `p9
> 9' & !missing(`vstub'_win_`vyear')
 14.             local retwin "`retwin' `vstub'_win_`vyear'"
 15.         }
 16.         else {
 17.             capture drop `v'_win
 18.             gen double `v'_win = `v'
 19.             replace `v'_win = `p1' if `v'_win < `p1' & !missing(`v'_win)
 20.             replace `v'_win = `p99' if `v'_win > `p99' & !missing(`v'_win)
 21.             local retwin "`retwin' `v'_win"
 22.         }
 23.     }
 24. }
(31,395 missing values generated)
(0 real changes made)
(139 real changes made)
(38,300 missing values generated)
(0 real changes made)
(69 real changes made)
(31,668 missing values generated)
(0 real changes made)
(137 real changes made)
(38,521 missing values generated)
(66 real changes made)
(67 real changes made)
(31,012 missing values generated)
(142 real changes made)
(142 real changes made)
(32,239 missing values generated)
(0 real changes made)
(129 real changes made)
(38,807 missing values generated)
(0 real changes made)
(64 real changes made)
(32,537 missing values generated)
(0 real changes made)
(128 real changes made)
(39,004 missing values generated)
(62 real changes made)
(63 real changes made)
(31,856 missing values generated)
(133 real changes made)
(133 real changes made)
(31,087 missing values generated)
(0 real changes made)
(141 real changes made)
(37,987 missing values generated)
(0 real changes made)
(72 real changes made)
(31,462 missing values generated)
(0 real changes made)
(139 real changes made)
(38,264 missing values generated)
(69 real changes made)
(69 real changes made)
(30,909 missing values generated)
(143 real changes made)
(142 real changes made)
(32,079 missing values generated)
(0 real changes made)
(131 real changes made)
(38,499 missing values generated)
(0 real changes made)
(68 real changes made)
(32,411 missing values generated)
(0 real changes made)
(133 real changes made)
(38,738 missing values generated)
(64 real changes made)
(63 real changes made)
(31,923 missing values generated)
(133 real changes made)
(133 real changes made)
(33,305 missing values generated)
(0 real changes made)
(119 real changes made)
(39,105 missing values generated)
(0 real changes made)
(61 real changes made)
(33,706 missing values generated)
(0 real changes made)
(113 real changes made)
(39,308 missing values generated)
(59 real changes made)
(61 real changes made)
(33,305 missing values generated)
(119 real changes made)
(119 real changes made)
(31,216 missing values generated)
(0 real changes made)
(139 real changes made)
(38,098 missing values generated)
(0 real changes made)
(70 real changes made)
(31,529 missing values generated)
(0 real changes made)
(137 real changes made)
(38,449 missing values generated)
(66 real changes made)
(67 real changes made)
(31,115 missing values generated)
(140 real changes made)
(141 real changes made)
(32,698 missing values generated)
(0 real changes made)
(123 real changes made)
(38,876 missing values generated)
(0 real changes made)
(62 real changes made)
(32,738 missing values generated)
(0 real changes made)
(120 real changes made)
(39,239 missing values generated)
(59 real changes made)
(59 real changes made)
(32,126 missing values generated)
(131 real changes made)
(131 real changes made)
(34,098 missing values generated)
(0 real changes made)
(111 real changes made)
(39,525 missing values generated)
(0 real changes made)
(57 real changes made)
(34,103 missing values generated)
(0 real changes made)
(111 real changes made)
(39,803 missing values generated)
(54 real changes made)
(54 real changes made)
(33,475 missing values generated)
(117 real changes made)
(117 real changes made)
(34,107 missing values generated)
(0 real changes made)
(111 real changes made)
(39,650 missing values generated)
(0 real changes made)
(55 real changes made)
(33,892 missing values generated)
(0 real changes made)
(114 real changes made)
(39,956 missing values generated)
(52 real changes made)
(52 real changes made)
(33,353 missing values generated)
(118 real changes made)
(118 real changes made)
(35,695 missing values generated)
(0 real changes made)
(95 real changes made)
(40,268 missing values generated)
(0 real changes made)
(49 real changes made)
(35,323 missing values generated)
(0 real changes made)
(97 real changes made)
(40,560 missing values generated)
(46 real changes made)
(46 real changes made)
(34,810 missing values generated)
(104 real changes made)
(104 real changes made)
(36,904 missing values generated)
(0 real changes made)
(83 real changes made)
(40,803 missing values generated)
(0 real changes made)
(43 real changes made)
(36,711 missing values generated)
(0 real changes made)
(84 real changes made)
(41,082 missing values generated)
(40 real changes made)
(41 real changes made)
(36,044 missing values generated)
(91 real changes made)
(90 real changes made)
(17,450 missing values generated)
(0 real changes made)
(277 real changes made)
(30,104 missing values generated)
(0 real changes made)
(151 real changes made)
(19,259 missing values generated)
(0 real changes made)
(258 real changes made)
(30,686 missing values generated)
(145 real changes made)
(146 real changes made)
(16,856 missing values generated)
(283 real changes made)
(284 real changes made)

. 
. display "Tabstat returns after winsorization"
Tabstat returns after winsorization

. tabstat `retwin', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13839      6934     13566      6713     14222     12995      6427
    Mean |  .3011539  .1634941  .0953002  .1158142  .1684074  .2668898  .2754771
      SD |  1.239727  .8549975  .4179342  .5475666  .5020858   1.13311   .901556
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036  .0164603  .0787754  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
     Min |        -1        -1        -1 -.8113064 -.6937918        -1        -1
     Max |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12697      6230     13378     14147      7247     13772      6970
    Mean |  .0889824  .1704482  .1799437   .278753  .2854054  .1323946  .1798595
      SD |  .4139833  .5460955  .4729423  1.206663  .9537506  .4384954  .5542911
      p1 |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
      p5 | -.5451412 -.4799117  -.397324 -.9483774        -1 -.5327307 -.5387344
     p50 |  .0595106  .0654357  .0955441    .02053  .0996786  .0940058  .0821008
     p95 |  .7507762  1.227771  1.076938  2.403116  1.966479  .8641539  1.289254
     p99 |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
     Min |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
     Max |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14325     13155      6735     12823      6496     13311     11929
    Mean |  .2223367  .2912837  .2457926  .0065366  .1496728  .1309695   .179421
      SD |  .5425705  1.275345  .9171129  .3737956  .5669265   .477685  1.175284
      p1 | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
      p5 | -.4169048 -.9728337        -1 -.5686689 -.5368095 -.4558613        -1
     p50 |  .1182693  .0074907  .0602312         0  .0477834  .0467583 -.0526641
     p95 |  1.196941  2.605551  1.923765  .5811388  1.168572  .9966639  2.278028
     p99 |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
     Min | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
     Max |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6129     11528      5926     11929     14018      7136     13705
    Mean |  .2099511 -.0454634  .0821969  .0825397   .220547  .2007094  .0024621
      SD |  .9321084  .3669636  .5004744  .4816109  1.168684  .9233212  .4188875
      p1 |        -1        -1   -.78236 -.7937624        -1        -1        -1
      p5 | -.8267949 -.7113249 -.5530107 -.4892756        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0052885  .0018197         0  .0369716         0
     p95 |  1.910762  .5374122  1.003842  .9832947  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
     Min |        -1        -1   -.78236 -.7937624        -1        -1        -1
     Max |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |      6785     14119     12536      6358     12496      5995     13108
    Mean |  .1057823  .1307248  .2908527   .256128   .070085  .1619814  .1890789
      SD |  .5106501  .5258028  1.246577  .9634451  .4474334  .5554295  .5550473
      p1 | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
      p5 | -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0354307  .0381487  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  1.054829  1.074333  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
     Min | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
     Max |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11136      5709     11131      5431     11759     11127      5584
    Mean |   .257207   .261529  .0702787  .1394711  .1930497  .2796762  .2627762
      SD |  1.253791  1.059876   .439928  .5358224  .5728341  1.289207  1.023494
      p1 |        -1        -1        -1  -.872792  -.831225        -1        -1
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546        -1        -1
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
     Min |        -1        -1        -1  -.872792  -.831225        -1        -1
     Max |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11342      5278     11881      9539      4966      9911      4674
    Mean |   .087912  .1652487  .2080546  .3174164   .233656  .0845597  .1326769
      SD |  .4541565  .5780907  .5856326  1.348276  .9766672  .4450098  .5279058
      p1 |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
      p5 | -.6358617 -.5635265 -.4916469        -1        -1 -.5948098 -.5397827
     p50 |  .0508033  .0707762  .0933268  .0319569  .0421834  .0488088  .0438695
     p95 |  .8257419  1.263184  1.342823    2.8735  2.134042  .7888544  1.186608
     p99 |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
     Min |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
     Max |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann~n
---------+----------------------------------------------------------------------
       N |     10424      8330      4431      8523      4152      9190     27784
    Mean |  .2050545  .3241761  .3007727  .1843175  .1805164  .2987002  .2270748
      SD |  .5951951  1.356852  1.041758  .5070959   .570291  .6613798  .8414201
      p1 | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
      p5 | -.4683276        -1 -.8036039 -.5690029 -.5210837 -.4271745        -1
     p50 |   .076495  .0382838  .0887893  .1319231   .081766  .1544909  .1139262
     p95 |  1.358543  2.751666  1.974895  1.009975  1.202837   1.58457  1.766544
     p99 |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
     Min | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
     Max |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
--------------------------------------------------------------------------------

   Stats |  r2_ann~n  r3_ann~n  r4_ann~n  r5_ann~n
---------+----------------------------------------
       N |     15130     25975     14548     28378
    Mean |  .1794329  .0474335   .136159  .2088517
      SD |  .6855663  .3475965  .4299918  .4246116
      p1 |        -1        -1 -.9247556 -.7674735
      p5 |        -1 -.6348516 -.5162661 -.3306088
     p50 |  .1155588  .0598376  .0958943  .1222377
     p95 |  1.458741  .5475788  .8874586  1.029693
     p99 |  2.872983  1.326594  1.988103  2.112304
     Min |        -1        -1 -.9247556 -.7674735
     Max |  2.872983  1.326594  1.988103  2.112304
--------------------------------------------------

. 
. * ---------------------------------------------------------------------
. * 5% winsorization (p5/p95) for r1, r4, r5  all years, for panel regressions (
> 14)
. * Naming: r*_annual_w5_YYYY so 10_build_panel reshape finds r1_annual_w5_*, etc
> .
. * ---------------------------------------------------------------------
. display "=== 5% winsorization on r1/r4/r5 (all years) ==="
=== 5% winsorization on r1/r4/r5 (all years) ===

. foreach y of local years {
  2.     foreach stub in r1_annual r4_annual r5_annual {
  3.         local v `stub'_`y'
  4.         capture confirm variable `v'
  5.         if !_rc {
  6.             quietly summarize `v', detail
  7.             local p5  = r(p5)
  8.             local p95 = r(p95)
  9.             capture drop `stub'_w5_`y'
 10.             gen double `stub'_w5_`y' = `v'
 11.             replace `stub'_w5_`y' = `p5'  if `stub'_w5_`y' < `p5'  & !missin
> g(`stub'_w5_`y')
 12.             replace `stub'_w5_`y' = `p95' if `stub'_w5_`y' > `p95' & !missin
> g(`stub'_w5_`y')
 13.         }
 14.     }
 15. }
(31,395 missing values generated)
(691 real changes made)
(691 real changes made)
(38,521 missing values generated)
(335 real changes made)
(336 real changes made)
(31,012 missing values generated)
(712 real changes made)
(712 real changes made)
(32,239 missing values generated)
(649 real changes made)
(647 real changes made)
(39,004 missing values generated)
(311 real changes made)
(310 real changes made)
(31,856 missing values generated)
(668 real changes made)
(669 real changes made)
(31,087 missing values generated)
(706 real changes made)
(709 real changes made)
(38,264 missing values generated)
(347 real changes made)
(348 real changes made)
(30,909 missing values generated)
(716 real changes made)
(717 real changes made)
(32,079 missing values generated)
(657 real changes made)
(657 real changes made)
(38,738 missing values generated)
(324 real changes made)
(325 real changes made)
(31,923 missing values generated)
(665 real changes made)
(665 real changes made)
(33,305 missing values generated)
(0 real changes made)
(596 real changes made)
(39,308 missing values generated)
(296 real changes made)
(297 real changes made)
(33,305 missing values generated)
(597 real changes made)
(596 real changes made)
(31,216 missing values generated)
(0 real changes made)
(700 real changes made)
(38,449 missing values generated)
(339 real changes made)
(340 real changes made)
(31,115 missing values generated)
(706 real changes made)
(706 real changes made)
(32,698 missing values generated)
(0 real changes made)
(627 real changes made)
(39,239 missing values generated)
(298 real changes made)
(299 real changes made)
(32,126 missing values generated)
(654 real changes made)
(655 real changes made)
(34,098 missing values generated)
(0 real changes made)
(556 real changes made)
(39,803 missing values generated)
(271 real changes made)
(271 real changes made)
(33,475 missing values generated)
(587 real changes made)
(587 real changes made)
(34,107 missing values generated)
(0 real changes made)
(556 real changes made)
(39,956 missing values generated)
(263 real changes made)
(263 real changes made)
(33,353 missing values generated)
(594 real changes made)
(594 real changes made)
(35,695 missing values generated)
(0 real changes made)
(475 real changes made)
(40,560 missing values generated)
(233 real changes made)
(233 real changes made)
(34,810 missing values generated)
(521 real changes made)
(521 real changes made)
(36,904 missing values generated)
(0 real changes made)
(418 real changes made)
(41,082 missing values generated)
(207 real changes made)
(207 real changes made)
(36,044 missing values generated)
(459 real changes made)
(459 real changes made)

. 
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_proces
    > sed.dta saved

. display "05_processing_returns: Saved ${PROCESSED}/analysis_ready_processed.dta
> "
05_processing_returns: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/C
> ode/Processing/analysis_ready_processed.dta

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/05_pro
> cessing_returns.log
  log type:  text
 closed on:  17 Feb 2026, 16:11:21
---------------------------------------------------------------------------------
