-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/06_descriptive_income.log
  log type:  text
 opened on:  10 Feb 2026, 18:19:26

. 
. * Load processed data
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Ensure output dirs (needed before exports)
. capture mkdir "${DESCRIPTIVE}"

. capture mkdir "${DESCRIPTIVE}/Figures"

. capture mkdir "${DESCRIPTIVE}/Tables"

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Keep needed vars
. keep hhidpn educ_yrs age_* ///
>     ln_lab_inc_final_* ln_tot_inc_final_* ///
>     labor_income_real_win_* total_income_real_win_* ///
>     wealth_core_* wealth_ira_* wealth_coreira_* wealth_res_* wealth_total_* gross_wealth_*

. 
. * Reshape to long for income descriptives
. reshape long ln_lab_inc_final_ ln_tot_inc_final_ labor_income_real_win_ total_income_real_win_ ///
>     age_ wealth_core_ wealth_ira_ wealth_coreira_ wealth_res_ wealth_total_ gross_wealth_, i(hhidpn) j(ye
> ar)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                 684   ->   564         
j variable (12 values)                    ->   year
xij variables:
ln_lab_inc_final_2000 ln_lab_inc_final_2002 ... ln_lab_inc_final_2022->ln_lab_inc_final_
ln_tot_inc_final_2000 ln_tot_inc_final_2002 ... ln_tot_inc_final_2022->ln_tot_inc_final_
labor_income_real_win_2000 labor_income_real_win_2002 ... labor_income_real_win_2022->labor_income_real_win
> _
total_income_real_win_2000 total_income_real_win_2002 ... total_income_real_win_2022->total_income_real_win
> _
         age_2000 age_2002 ... age_2022   ->   age_
wealth_core_2000 wealth_core_2002 ... wealth_core_2022->wealth_core_
wealth_ira_2000 wealth_ira_2002 ... wealth_ira_2022->wealth_ira_
wealth_coreira_2000 wealth_coreira_2002 ... wealth_coreira_2022->wealth_coreira_
wealth_res_2000 wealth_res_2002 ... wealth_res_2022->wealth_res_
wealth_total_2000 wealth_total_2002 ... wealth_total_2022->wealth_total_
gross_wealth_2000 gross_wealth_2002 ... gross_wealth_2022->gross_wealth_
-----------------------------------------------------------------------------

. rename age_ age

. rename wealth_core_ wealth_core

. rename wealth_ira_ wealth_ira

. rename wealth_coreira_ wealth_coreira

. rename wealth_res_ wealth_res

. rename wealth_total_ wealth_total

. rename gross_wealth_ gross_wealth

. 
. display "=== Income descriptives (real, winsorized) ==="
=== Income descriptives (real, winsorized) ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min 
> max)

   Stats |  labor_~_  total_~_
---------+--------------------
       N |    204952    204952
    Mean |  18329.46   52002.7
      SD |  37031.49  68034.26
      p1 |         0         0
      p5 |         0   1453.77
     p50 |         0  29102.81
     p95 |  97922.06  177493.9
     p99 |  178925.5  389510.5
     Min |         0         0
     Max |  215256.8  457538.5
------------------------------

. 
. * Export tabstat-like summary for real, winsorized income variables (LaTeX)
. preserve

. tempfile income_stats

. postfile handle str32 varname double obs mean sd p1 p5 p50 p95 p99 min max using "`income_stats'", replac
> e
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_70631.000003 not found)

. 
. foreach v in labor_income_real_win_ total_income_real_win_ {
  2.     if "`wopt'" != "" {
  3.         quietly summarize `v' `wopt'
  4.         local N = r(N)
  5.         local mean = r(mean)
  6.         local sd = r(sd)
  7.         local min = r(min)
  8.         local max = r(max)
  9.         quietly centile `v' `wopt', centile(1 5 50 95 99)
 10.         local p1 = r(c_1)
 11.         local p5 = r(c_2)
 12.         local p50 = r(c_3)
 13.         local p95 = r(c_4)
 14.         local p99 = r(c_5)
 15.         post handle ("`v'") (`N') (`mean') (`sd') (`p1') (`p5') (`p50') (`p95') (`p99') (`min') (`max'
> )
 16.     }
 17.     else {
 18.         quietly summarize `v', detail
 19.         post handle ("`v'") (r(N)) (r(mean)) (r(sd)) (r(p1)) (r(p5)) (r(p50)) (r(p95)) (r(p99)) (r(min
> )) (r(max))
 20.     }
 21. }

. postclose handle

. 
. use "`income_stats'", clear

. 
. file open fh using "${DESCRIPTIVE}/Tables/income_final_tabstat.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n ///
>     "\caption{Income (real, winsorized): summary statistics}" _n ///
>     "\label{tab:income_final_tabstat}" _n ///
>     "\resizebox{\textwidth}{!}{\begin{tabular}{lrrrrrrr}\toprule" _n ///
>     "Variable & Obs & Mean & SD & P50 & P95 & Min & Max \\\\ \midrule" _n

. 
. forvalues r = 1/`=_N' {
  2.     local vname = varname[`r']
  3.     if "`vname'" == "labor_income_real_win_"  local vname "Labor income (real, winsorized)"
  4.     if "`vname'" == "total_income_real_win_"  local vname "Total income (real, winsorized)"
  5.     local obs_s = string(obs[`r'], "%9.0fc")
  6.     local mean_s = string(mean[`r'], "%9.0fc")
  7.     local sd_s   = string(sd[`r'],   "%9.0fc")
  8.     local p50_s  = string(p50[`r'],  "%9.0fc")
  9.     local p95_s  = string(p95[`r'],  "%9.0fc")
 10.     local min_s  = string(min[`r'],  "%9.0fc")
 11.     local max_s  = string(max[`r'],  "%9.0fc")
 12. 
.     file write fh "`vname' & `obs_s' & `mean_s' & `sd_s' & `p50_s' & `p95_s' & `min_s' & `max_s' \\\\" _n
 13. }

. 
. file write fh "\bottomrule" _n "\multicolumn{8}{l}{\footnotesize Real USD, winsorized; summary over perso
> n-years.} \\\\" _n "\end{tabular}}" _n "\end{table}" _n

. file close fh

. restore

. 
. * Mean income by year (deflated + winsorized levels)
. display "=== Mean income by year ==="
=== Mean income by year ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year >= 2002, by(year) statistics(n mean 
> sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: year 

    year |  labor_~_  total_~_
---------+--------------------
    2002 |     18165     18165
         |  15135.65   51878.5
         |   32580.9  66407.29
         |         0  30190.13
         |  85870.12  174149.9
---------+--------------------
    2004 |     20129     20129
         |  19002.57  55397.86
         |  37650.35  71841.79
         |         0  31556.55
         |  100407.2  192724.4
---------+--------------------
    2006 |     18469     18469
         |  16158.67  53489.83
         |  33697.37  70022.36
         |         0  30651.52
         |  90072.44  179792.2
---------+--------------------
    2008 |     17217     17217
         |  14976.15  52958.03
         |  32820.09  69115.31
         |         0  29723.43
         |  88117.91  182559.4
---------+--------------------
    2010 |     22034     22034
         |  20164.64  50369.49
         |  37831.49  62362.26
         |         0  29266.74
         |  101888.1  168118.3
---------+--------------------
    2012 |     20554     20554
         |  18249.65  49178.34
         |  36189.97   63012.2
         |         0  27766.46
         |  95599.88  167599.6
---------+--------------------
    2014 |     18747     18747
         |  17278.13  49727.28
         |  36129.72  63834.37
         |         0  27987.94
         |  95010.19  166563.2
---------+--------------------
    2016 |     20912     20912
         |  21643.79  53539.04
         |  41288.64  71987.89
         |         0  29321.51
         |  112900.8  183099.8
---------+--------------------
    2018 |     17146     17146
         |  19847.19   52319.7
         |  39573.18   71354.6
         |         0  28057.27
         |  106833.4  180753.6
---------+--------------------
    2020 |     15723     15723
         |   19567.6  52701.73
         |  39173.18  70307.44
         |         0   29048.9
         |  104679.1    181723
---------+--------------------
    2022 |     15856     15856
         |  18859.67  50624.16
         |  38345.13  68371.47
         |         0  26985.26
         |  100006.8  179641.9
---------+--------------------
   Total |    204952    204952
         |  18329.46   52002.7
         |  37031.49  68034.26
         |         0  29102.81
         |  97922.06  177493.9
------------------------------

. preserve

. keep if year >= 2002
(45,234 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_ (count) n=labor_income_re
> al_win_ `wopt', by(year)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_year_real_win.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by year (real, winsorized)}" _n "\
> label{tab:income_mean_by_year_real_win}" _n "\begin{tabular}{lrrr}\toprule" _n "Year & Labor income (mean
>  `dl') & Total income (mean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`yr_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Real USD; winsorized at 1st and 99th per
> centile.} \\\\" _n "\end{tabular}" _n "\end{table}" _n

. file close fh

. restore

. 
. * Income by age group (year-specific; deflated + winsorized levels)
. display "=== Mean income by age group (2002) ==="
=== Mean income by age group (2002) ===

. gen int age_group = floor(age/5)*5 if !missing(age)
(318,278 missing values generated)

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year == 2002, by(age_group) statistics(n 
> mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  labor_~_  total_~_
----------+--------------------
       25 |         7         7
          |  33573.28  42684.55
          |  21388.57  17561.82
          |  30129.87  34649.35
          |  63272.72  70503.89
----------+--------------------
       30 |         9         9
          |  24890.62  85055.65
          |  24295.19  126477.1
          |  21090.91  49262.33
          |  63272.72  416775.3
----------+--------------------
       35 |        37        37
          |  26630.32  66191.96
          |  26781.72  77557.38
          |  19885.71  48219.84
          |  75324.66    301600
----------+--------------------
       40 |       105       105
          |  31333.55  64267.81
          |  36664.01  75695.13
          |  21090.91  42181.81
          |    112987  224919.4
----------+--------------------
       45 |       250       250
          |  36588.38  64877.56
          |   40404.9  79764.64
          |  27116.88  39873.86
          |  119766.2  219044.1
----------+--------------------
       50 |       783       783
          |   38699.7  72377.16
          |  44523.44  87410.24
          |  26363.63  43266.49
          |  138597.4  266649.3
----------+--------------------
       55 |      2381      2381
          |  38755.23  72493.52
          |  45474.67  82153.96
          |  25610.39  48433.76
          |  140103.9  252488.3
----------+--------------------
       60 |      3653      3653
          |  24974.84  60750.65
          |  38612.05  77090.81
          |         0  36445.09
          |  108467.5    225974
----------+--------------------
       65 |      3303      3303
          |   9984.27   50403.3
          |  25745.04  63524.48
          |         0  30274.49
          |  60259.73  164685.3
----------+--------------------
       70 |      2569      2569
          |  3788.693  45926.14
          |  15234.42  57875.61
          |         0  28798.13
          |  24103.89  148281.1
----------+--------------------
       75 |      2039      2039
          |  1594.032  39306.29
          |  9429.776  45228.65
          |         0  25819.79
          |  7532.466  116301.3
----------+--------------------
       80 |      1660      1660
          |  718.2688  34633.99
          |  7852.212   40468.4
          |         0  22847.58
          |         0  97946.17
----------+--------------------
       85 |       868       868
          |  91.05259  32256.54
          |  1217.383  37720.35
          |         0  21372.62
          |         0   94728.3
----------+--------------------
       90 |       399       399
          |  34.35862  28829.51
          |  454.9814  32502.59
          |         0  18077.92
          |         0  76077.91
----------+--------------------
       95 |        89        89
          |         0  32284.73
          |         0  41172.03
          |         0  18077.92
          |         0    130161
----------+--------------------
      100 |        10        10
          |         0  17743.72
          |         0  14707.82
          |         0  13404.78
          |         0  55288.51
----------+--------------------
      105 |         3         3
          |         0  11618.08
          |         0  1551.475
          |         0   12365.3
          |         0  12654.54
----------+--------------------
    Total |     18165     18165
          |  15135.65   51878.5
          |   32580.9  66407.29
          |         0  30190.13
          |  85870.12  174149.9
-------------------------------

. preserve

. keep if year == 2002
(497,574 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_ (count) n=labor_income_re
> al_win_ `wopt', by(age_group)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_agegroup_real_win_2002.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by age group (2002)}" _n "\label{t
> ab:income_mean_by_agegroup_2002}" _n "\begin{tabular}{lrrr}\toprule" _n "Age (midpoint) & Labor income (m
> ean `dl') & Total income (mean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local age_s = string(age_group[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`age_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Five-year age bins (e.g., 50 = 50--54). 
> Real USD, winsorized.} \\\\" _n "\end{tabular}" _n "\end{table}" _n

. file close fh

. restore

. 
. display "=== Mean income by age group (2022) ==="
=== Mean income by age group (2022) ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year == 2022, by(age_group) statistics(n 
> mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  labor_~_  total_~_
----------+--------------------
       25 |         2         2
          |         0  11354.68
          |         0  10557.85
          |         0  11354.68
          |         0  18820.22
----------+--------------------
       30 |         8         8
          |  32108.67   88032.6
          |   20462.7  99536.27
          |  35187.58     45179
          |  61115.27  252054.2
----------+--------------------
       35 |        28        28
          |  19994.19  60830.85
          |  28935.53  108912.1
          |  2777.967  24260.91
          |  88894.94  423781.9
----------+--------------------
       40 |        95        95
          |  25891.59  47445.22
          |  35115.33  77235.47
          |   9259.89  24538.71
          |  95376.87  181493.8
----------+--------------------
       45 |       233       233
          |  36850.89  63805.37
          |  41907.81  74092.76
          |   25001.7  46299.45
          |  118967.4  232423.2
----------+--------------------
       50 |      1286      1286
          |  43922.35  69037.36
          |  52492.33  81767.03
          |  27779.67  43527.04
          |  162048.1  245398.2
----------+--------------------
       55 |      2285      2285
          |  38021.38  62012.86
          |   48882.5  79165.58
          |  21297.75  36224.69
          |  145380.3  229274.9
----------+--------------------
       60 |      2924      2924
          |  28185.13   55428.1
          |  43559.95  75456.71
          |  1851.978  28718.16
          |  120378.6  200721.1
----------+--------------------
       65 |      2641      2641
          |  14748.55  46993.13
          |  33356.92  63816.28
          |         0  25201.72
          |  81487.03  155567.1
----------+--------------------
       70 |      2204      2204
          |  6731.785  43628.73
          |  22000.18  57242.82
          |         0  24480.81
          |  44447.47  143398.7
----------+--------------------
       75 |      1401      1401
          |  3486.729  43554.85
          |  17363.54  59371.05
          |         0  24446.11
          |  18334.58  139442.8
----------+--------------------
       80 |      1421      1421
          |  1463.643  39317.07
          |  10521.47  52833.32
          |         0  22368.19
          |  4629.945  127638.3
----------+--------------------
       85 |       871       871
          |  528.0397  37901.86
          |  6784.737  48021.33
          |         0  23530.92
          |         0  121703.7
----------+--------------------
       90 |       361       361
          |   519.426     39475
          |  9747.676  63085.74
          |         0   22279.3
          |         0  128934.5
----------+--------------------
       95 |        79        79
          |         0  46537.63
          |         0  85761.39
          |         0  20668.07
          |         0  293542.2
----------+--------------------
      100 |        16        16
          |         0  14516.52
          |         0  5382.809
          |         0  14019.58
          |         0  23334.92
----------+--------------------
      105 |         1         1
          |         0  11111.87
          |         .         .
          |         0  11111.87
          |         0  11111.87
----------+--------------------
    Total |     15856     15856
          |  18859.67  50624.16
          |  38345.13  68371.47
          |         0  26985.26
          |  100006.8  179641.9
-------------------------------

. preserve

. keep if year == 2022
(497,574 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_ (count) n=labor_income_re
> al_win_ `wopt', by(age_group)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_agegroup_real_win_2022.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by age group (2022)}" _n "\label{t
> ab:income_mean_by_agegroup_2022}" _n "\begin{tabular}{lrrr}\toprule" _n "Age (midpoint) & Labor income (m
> ean `dl') & Total income (mean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local age_s = string(age_group[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`age_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Five-year age bins (e.g., 50 = 50--54). 
> Real USD, winsorized.} \\\\" _n "\end{tabular}" _n "\end{table}" _n

. file close fh

. restore

. 
. * Income by education group (deflated + winsorized levels)
. display "=== Mean income by education group ==="
=== Mean income by education group ===

. gen byte educ_group = .
(542,808 missing values generated)

. replace educ_group = 1 if educ_yrs < 12
(144,840 real changes made)

. replace educ_group = 2 if educ_yrs == 12
(163,332 real changes made)

. replace educ_group = 3 if inrange(educ_yrs,13,15)
(116,088 real changes made)

. replace educ_group = 4 if educ_yrs == 16
(59,616 real changes made)

. replace educ_group = 5 if educ_yrs >= 17 & !missing(educ_yrs)
(51,144 real changes made)

. label define educ_group 1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "grad"

. label values educ_group educ_group

. tabstat labor_income_real_win_ total_income_real_win_ `wopt', by(educ_group) statistics(n mean sd p50 p95
> )

Summary statistics: N, Mean, SD, p50, p95
Group variable: educ_group 

  educ_group |  labor_~_  total_~_
-------------+--------------------
       no hs |     44654     44654
             |  6075.283  23986.55
             |  17517.82  34232.59
             |         0  15164.39
             |  39515.26  69759.12
-------------+--------------------
          hs |     63826     63826
             |  12589.92  39600.44
             |   26534.7  48415.94
             |         0  25840.32
             |  67218.24  117158.7
-------------+--------------------
some college |     47390     47390
             |  20297.25  53481.54
             |  35644.77  63386.68
             |         0  34325.13
             |  94412.05    164961
-------------+--------------------
  4yr degree |     24820     24820
             |  32778.33  82575.98
             |  50227.92  87882.94
             |         0  55093.44
             |  147480.4  272375.1
-------------+--------------------
        grad |     23091     23091
             |  37444.03  104063.9
             |  56539.49  99113.26
             |         0  73309.74
             |  173246.7  347141.1
-------------+--------------------
       Total |    203781    203781
             |  18229.94  51945.96
             |  36927.72  67975.79
             |         0  29058.92
             |  97922.06  177184.4
----------------------------------

. preserve

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_ (count) n=labor_income_re
> al_win_ `wopt', by(educ_group)

. drop if missing(educ_group)
(1 observation deleted)

. decode educ_group, gen(educ_label)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_educgroup_real_win.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by education group (real, winsoriz
> ed)}" _n "\label{tab:income_mean_by_educgroup_real_win}" _n "\begin{tabular}{lrrr}\toprule" _n "Education
>  & Labor income (mean `dl') & Total income (mean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local edlab = educ_label[`r']
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`edlab' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Real USD, winsorized. no hs = $<$12y; hs
>  = 12y; some college = 13--15y; 4yr = 16y; grad = 17+y.} \\\\" _n "\end{tabular}" _n "\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Figure 1A, 2A, 3: Income by age, income by age and education, income over time
. * ---------------------------------------------------------------------
. 
. * Figure 1A — Mean labor and total income by age group (2 lines per graph, 2002 and 2022)
. foreach yr in 2002 2022 {
  2.     preserve
  3.     keep if year == `yr'
  4.     collapse (mean) mean_lab=labor_income_real_win_ (mean) mean_tot=total_income_real_win_ `wopt', by(
> age_group)
  5.     sort age_group
  6.     twoway (line mean_lab age_group, lwidth(medthick) lcolor(navy)) (line mean_tot age_group, lpattern
> (dash) lcolor(maroon)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Income by age group (`yr')") ///
>         legend(order(1 "Labor income" 2 "Total income") cols(1) size(small) position(3) ring(0) region(ls
> tyle(none)))
  7.     graph export "${DESCRIPTIVE}/Figures/income_by_agegroup_`yr'.png", replace
  8.     restore
  9. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_by_agegroup_2002.png saved as
    PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_by_agegroup_2022.png saved as
    PNG format

. 
. * Figure 2A — Income by age group with lines by education (labor and total separately, 2002 and 2022)
. foreach yr in 2002 2022 {
  2.     * Labor income by age and education (5 lines = 5 educ groups)
.     preserve
  3.     keep if year == `yr'
  4.     collapse (mean) mean_inc=labor_income_real_win_ `wopt', by(age_group educ_group)
  5.     sort age_group educ_group
  6.     twoway (line mean_inc age_group if educ_group==1, lcolor(navy)) ///
>            (line mean_inc age_group if educ_group==2, lcolor(maroon)) ///
>            (line mean_inc age_group if educ_group==3, lcolor(forest_green)) ///
>            (line mean_inc age_group if educ_group==4, lcolor(orange)) ///
>            (line mean_inc age_group if educ_group==5, lcolor(teal)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Labor income by age and education (`yr')") ///
>         legend(order(1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "grad") cols(1) size(small) posit
> ion(3) ring(0) region(lstyle(none)))
  7.     graph export "${DESCRIPTIVE}/Figures/labinc_by_age_educ_`yr'.png", replace
  8.     restore
  9.     * Total income by age and education (5 lines = 5 educ groups)
.     preserve
 10.     keep if year == `yr'
 11.     collapse (mean) mean_inc=total_income_real_win_ `wopt', by(age_group educ_group)
 12.     sort age_group educ_group
 13.     twoway (line mean_inc age_group if educ_group==1, lcolor(navy)) ///
>            (line mean_inc age_group if educ_group==2, lcolor(maroon)) ///
>            (line mean_inc age_group if educ_group==3, lcolor(forest_green)) ///
>            (line mean_inc age_group if educ_group==4, lcolor(orange)) ///
>            (line mean_inc age_group if educ_group==5, lcolor(teal)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Total income by age and education (`yr')") ///
>         legend(order(1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "grad") cols(1) size(small) posit
> ion(3) ring(0) region(lstyle(none)))
 14.     graph export "${DESCRIPTIVE}/Figures/totinc_by_age_educ_`yr'.png", replace
 15.     restore
 16. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labinc_by_age_educ_2002.png saved as
    PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/totinc_by_age_educ_2002.png saved as
    PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labinc_by_age_educ_2022.png saved as
    PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/totinc_by_age_educ_2022.png saved as
    PNG format

. 
. * Figure 3 — Mean labor and total income over time (one graph, 2 lines)
. preserve

. collapse (mean) mean_lab=labor_income_real_win_ (mean) mean_tot=total_income_real_win_ `wopt', by(year)

. twoway (line mean_lab year, lwidth(medthick) lcolor(navy)) (line mean_tot year, lpattern(dash) lcolor(mar
> oon)), ///
>     xtitle("Year") ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>     title("Income over time") ///
>     legend(order(1 "Labor income" 2 "Total income") cols(1) size(small) position(3) ring(0) region(lstyle
> (none)))

. graph export "${DESCRIPTIVE}/Figures/income_over_time.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_over_time.png
    saved as PNG format

. restore

. 
. * Figure 4 — Mean income growth over time (labor and total, percent)
. preserve

. keep year ln_lab_inc_final_growth_* ln_tot_inc_final_growth_*

. 
. * Build end-year-specific means for each growth series
. tempfile growth_means

. postfile handle double year double g_lab g_tot using "`growth_means'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_70631.00000g not found)

. 
. foreach v of varlist ln_lab_inc_final_growth_* {
  2.     local base "ln_lab_inc_final_growth_"
  3.     local yr = substr("`v'", `=length("`base'")'+1, .)
  4.     quietly summarize `v' if year == `yr' & !missing(`v') `wopt'
  5.     if r(N) == 0 continue
  6.     local g_lab = r(mean) * 100
  7.     * Find matching total-income growth variable for same end year
.     local vtot = "ln_tot_inc_final_growth_`yr'"
  8.     capture confirm variable `vtot'
  9.     if _rc {
 10.         post handle (`yr') (`g_lab') (.)
 11.     }
 12.     else {
 13.         quietly summarize `vtot' if year == `yr' & !missing(`vtot') `wopt'
 14.         local g_tot = r(mean) * 100
 15.         post handle (`yr') (`g_lab') (`g_tot')
 16.     }
 17. }

. postclose handle

. 
. use "`growth_means'", clear

. sort year

. twoway (line g_lab year, lwidth(medthick) lcolor(navy)) ///
>        (line g_tot year, lpattern(dash) lcolor(maroon)), ///
>     xtitle("Year (end of two-year growth period)") ///
>     ytitle("Average income growth (\%)") ///
>     ylabel(, format(%9.1f)) ///
>     title("Income growth over time") ///
>     legend(order(1 "Labor income growth" 2 "Total income growth") cols(1) size(small) position(3) ring(0)
>  region(lstyle(none)))

. graph export "${DESCRIPTIVE}/Figures/income_growth_over_time.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_growth_over_time.png saved as
    PNG format

. restore

. 
. * Income growth summary by wave (growth attached to end year)
. display "=== Income growth summary (by end year) ==="
=== Income growth summary (by end year) ===

. preserve

. keep year ln_lab_inc_final_growth_* ln_tot_inc_final_growth_*

. 
. * Export tabstat-like summary for income growth variables
. tempfile growth_stats

. postfile handle str32 varname double obs mean sd p1 p5 p50 p95 p99 min max using "`growth_stats'", replac
> e
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_70631.00000i not found)

. foreach v of varlist ln_lab_inc_final_growth_* ln_tot_inc_final_growth_* {
  2.     * Restrict to the wave corresponding to the end year encoded in the variable name
.     local ifcond ""
  3.     if strpos("`v'", "ln_lab_inc_final_growth_") > 0 {
  4.         local base "ln_lab_inc_final_growth_"
  5.         local yr = substr("`v'", `=length("`base'")'+1, .)
  6.         local ifcond "if year == `yr' & !missing(`v')"
  7.     }
  8.     else if strpos("`v'", "ln_tot_inc_final_growth_") > 0 {
  9.         local base2 "ln_tot_inc_final_growth_"
 10.         local yr2 = substr("`v'", `=length("`base2'")'+1, .)
 11.         local ifcond "if year == `yr2' & !missing(`v')"
 12.     }
 13. 
.     if "`wopt'" != "" {
 14.         quietly summarize `v' `wopt' `ifcond'
 15.         local N = r(N)
 16.         local mean = r(mean)
 17.         local sd = r(sd)
 18.         local min = r(min)
 19.         local max = r(max)
 20.         quietly centile `v' `wopt' `ifcond', centile(1 5 50 95 99)
 21.         local p1 = r(c_1)
 22.         local p5 = r(c_2)
 23.         local p50 = r(c_3)
 24.         local p95 = r(c_4)
 25.         local p99 = r(c_5)
 26.         post handle ("`v'") (`N') (`mean') (`sd') (`p1') (`p5') (`p50') (`p95') (`p99') (`min') (`max'
> )
 27.     }
 28.     else {
 29.         quietly summarize `v' `ifcond', detail
 30.         post handle ("`v'") (r(N)) (r(mean)) (r(sd)) (r(p1)) (r(p5)) (r(p50)) (r(p95)) (r(p99)) (r(min
> )) (r(max))
 31.     }
 32. }

. postclose handle

. use "`growth_stats'", clear

. file open fh using "${DESCRIPTIVE}/Tables/income_growth_tabstat.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Income growth: summary statistics}" _n "
> \label{tab:income_growth_tabstat}" _n "\resizebox{\textwidth}{!}{\begin{tabular}{lrrrrrrr}\toprule" _n "V
> ariable & Obs & Mean & SD & P50 & P95 & Min & Max \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     * Skip variables with zero observations (e.g. earliest growth year)
.     if obs[`r'] == 0 continue
  3. 
.     local vraw = varname[`r']
  4.     local vname "`vraw'"
  5. 
.     * Make labels more interpretable by attaching the end year of the growth period
.     if strpos("`vraw'", "ln_lab_inc_final_growth_") > 0 {
  6.         local base "ln_lab_inc_final_growth_"
  7.         local yr = substr("`vraw'", `=length("`base'")'+1, .)
  8.         local vname "Log labor income growth (`yr')"
  9.     }
 10.     else if strpos("`vraw'", "ln_tot_inc_final_growth_") > 0 {
 11.         local base2 "ln_tot_inc_final_growth_"
 12.         local yr2 = substr("`vraw'", `=length("`base2'")'+1, .)
 13.         local vname "Log total income growth (`yr2')"
 14.     }
 15. 
.     local obs_s = string(obs[`r'], "%9.0fc")
 16.     local mean_s = string(mean[`r'], "%9.4f")
 17.     local sd_s = string(sd[`r'], "%9.4f")
 18.     local p50_s = string(p50[`r'], "%9.4f")
 19.     local p95_s = string(p95[`r'], "%9.4f")
 20.     local min_s = string(min[`r'], "%9.4f")
 21.     local max_s = string(max[`r'], "%9.4f")
 22.     file write fh "`vname' & `obs_s' & `mean_s' & `sd_s' & `p50_s' & `p95_s' & `min_s' & `max_s' \\\\"
>  _n
 23. }

. file write fh "\bottomrule" _n "\multicolumn{8}{l}{\footnotesize Two-year log difference by end year; ln(
> 1+income) so zeros included. Labor = earnings+unemployment; total = all components.} \\\\" _n "\end{tabul
> ar}}" _n "\end{table}" _n

. file close fh

. restore

. 
. * Income vs wealth percentile: mean+IQR ribbon and binscatter (titles/labels aligned with 07 returns)
. * Wealth percentiles by year (1-100)
. local pctvars "wealth_core wealth_ira wealth_res wealth_total gross_wealth"

. foreach v of local pctvars {
  2.     sort year `v'
  3.     by year: gen long _rank_`v' = sum(!missing(`v'))
  4.     by year: gen long _N_`v' = _rank_`v'[_N]
  5.     gen int `v'_pct = .
  6.     replace `v'_pct = ceil(100 * _rank_`v' / _N_`v') if !missing(`v')
  7.     drop _rank_`v' _N_`v'
  8. }
(542,808 missing values generated)
(224,494 real changes made)
(542,808 missing values generated)
(224,528 real changes made)
(542,808 missing values generated)
(224,528 real changes made)
(542,808 missing values generated)
(144,138 real changes made)
(542,808 missing values generated)
(224,530 real changes made)

. 
. capture which binscatter

. if _rc capture ssc install binscatter, replace

. 
. display "=== Log income vs wealth percentile: mean+IQR and binscatter ==="
=== Log income vs wealth percentile: mean+IQR and binscatter ===

. local years "2002 2022"

. foreach y of local years {
  2.     quietly count if year == `y' & !missing(wealth_total_pct)
  3.     if r(N) < 10 continue
  4. 
.     * --- Labor income: mean + P10-P90 range; binscatter uses log ---
.     quietly count if year == `y' & !missing(labor_income_real_win_) & !missing(wealth_total_pct)
  5.     if r(N) >= 10 {
  6.         preserve
  7.         keep if year == `y'
  8.         collapse (mean) mean_inc = labor_income_real_win_ (p10) p10_inc = labor_income_real_win_ (p90)
>  p90_inc = labor_income_real_win_, by(wealth_total_pct)
  9.         twoway (rarea p90_inc p10_inc wealth_total_pct, color(gs12)) (line mean_inc wealth_total_pct, 
> lcolor(navy) lwidth(medthick)), ///
>             xtitle("Wealth total (pct.)") ytitle("Labor income (real, win, $)") ylabel(, format(%9.0fc)) 
> ///
>             title("Mean/P10-P90: Labor income by wealth (pct.) (`y')") legend(off)
 10.         graph export "${DESCRIPTIVE}/Figures/labor_income_real_win_p10p90_by_wealthpct_`y'.png", repla
> ce
 11.         restore
 12.     }
 13.     quietly count if year == `y' & !missing(ln_lab_inc_final_) & !missing(wealth_total_pct)
 14.     if r(N) >= 10 {
 15.         capture binscatter ln_lab_inc_final_ wealth_total_pct if year == `y', nquantiles(50) ///
>             ytitle("Log labor income") xtitle("Wealth total (pct.)") ///
>             title("Binscatter: Labor income by wealth (pct.) (`y')")
 16.         if _rc == 0 graph export "${DESCRIPTIVE}/Figures/log_labor_income_binscatter_`y'.png", replace
 17.     }
 18. 
.     * --- Total income: mean+IQR uses real winsorized (level); binscatter uses log ---
.     quietly count if year == `y' & !missing(total_income_real_win_) & !missing(wealth_total_pct)
 19.     if r(N) >= 10 {
 20.         preserve
 21.         keep if year == `y'
 22.         collapse (mean) mean_inc = total_income_real_win_ (p25) p25_inc = total_income_real_win_ (p75)
>  p75_inc = total_income_real_win_, by(wealth_total_pct)
 23.         twoway (rarea p75_inc p25_inc wealth_total_pct, color(gs12)) (line mean_inc wealth_total_pct, 
> lcolor(maroon) lwidth(medthick)), ///
>             xtitle("Wealth total (pct.)") ytitle("Total income (real, win, $)") ylabel(, format(%9.0fc)) 
> ///
>             title("Mean/IQR: Total income by wealth (pct.) (`y')") legend(off)
 24.         graph export "${DESCRIPTIVE}/Figures/total_income_real_win_iqr_by_wealthpct_`y'.png", replace
 25.         restore
 26.     }
 27.     quietly count if year == `y' & !missing(ln_tot_inc_final_) & !missing(wealth_total_pct)
 28.     if r(N) >= 10 {
 29.         capture binscatter ln_tot_inc_final_ wealth_total_pct if year == `y', nquantiles(50) ///
>             ytitle("Log total income") xtitle("Wealth total (pct.)") ///
>             title("Binscatter: Total income by wealth (pct.) (`y')")
 30.         if _rc == 0 graph export "${DESCRIPTIVE}/Figures/log_total_income_binscatter_`y'.png", replace
 31.     }
 32. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labor_income_real_win_p10p90_by_wealth
    > pct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_labor_income_binscatter_2002.png
    saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/total_income_real_win_iqr_by_wealthpct
    > _2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_total_income_binscatter_2002.png
    saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labor_income_real_win_p10p90_by_wealth
    > pct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_labor_income_binscatter_2022.png
    saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/total_income_real_win_iqr_by_wealthpct
    > _2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_total_income_binscatter_2022.png
    saved as PNG format

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/06_descriptive_income.log
  log type:  text
 closed on:  10 Feb 2026, 18:20:20
-----------------------------------------------------------------------------------------------------------
