---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/06_des
> criptive_income.log
  log type:  text
 opened on:  19 Feb 2026, 13:49:12

. 
. * Load processed data
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Ensure output dirs (needed before exports)
. capture mkdir "${DESCRIPTIVE}"

. capture mkdir "${DESCRIPTIVE}/Figures"

. capture mkdir "${DESCRIPTIVE}/Tables"

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Keep needed vars
. keep hhidpn educ_yrs age_* ///
>     ln_lab_inc_final_* ln_tot_inc_final_* ///
>     labor_income_real_win_* total_income_real_win_* ///
>     wealth_core_* wealth_ira_* wealth_coreira_* wealth_res_* wealth_total_* gro
> ss_wealth_*

. 
. * Reshape to long for income descriptives
. reshape long ln_lab_inc_final_ ln_tot_inc_final_ labor_income_real_win_ total_i
> ncome_real_win_ ///
>     age_ wealth_core_ wealth_ira_ wealth_coreira_ wealth_res_ wealth_total_ gro
> ss_wealth_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                 696   ->   576         
j variable (12 values)                    ->   year
xij variables:
ln_lab_inc_final_2000 ln_lab_inc_final_2002 ... ln_lab_inc_final_2022->ln_lab_inc
> _final_
ln_tot_inc_final_2000 ln_tot_inc_final_2002 ... ln_tot_inc_final_2022->ln_tot_inc
> _final_
labor_income_real_win_2000 labor_income_real_win_2002 ... labor_income_real_win_2
> 022->labor_income_real_win_
total_income_real_win_2000 total_income_real_win_2002 ... total_income_real_win_2
> 022->total_income_real_win_
         age_2000 age_2002 ... age_2022   ->   age_
wealth_core_2000 wealth_core_2002 ... wealth_core_2022->wealth_core_
wealth_ira_2000 wealth_ira_2002 ... wealth_ira_2022->wealth_ira_
wealth_coreira_2000 wealth_coreira_2002 ... wealth_coreira_2022->wealth_coreira_
wealth_res_2000 wealth_res_2002 ... wealth_res_2022->wealth_res_
wealth_total_2000 wealth_total_2002 ... wealth_total_2022->wealth_total_
gross_wealth_2000 gross_wealth_2002 ... gross_wealth_2022->gross_wealth_
-----------------------------------------------------------------------------

. rename age_ age

. rename wealth_core_ wealth_core

. rename wealth_ira_ wealth_ira

. rename wealth_coreira_ wealth_coreira

. rename wealth_res_ wealth_res

. rename wealth_total_ wealth_total

. rename gross_wealth_ gross_wealth

. 
. display "=== Income descriptives (real, winsorized) ==="
=== Income descriptives (real, winsorized) ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt', statistics(n mean
>  sd p1 p5 p50 p95 p99 min max)

   Stats |  labor_~_  total_~_
---------+--------------------
       N |    204952    204952
    Mean |  18329.83  52003.74
      SD |  37032.23  68035.62
      p1 |         0         0
      p5 |         0    1453.8
     p50 |         0   29103.4
     p95 |  97924.05  177497.5
     p99 |  178929.1  389518.4
     Min |         0         0
     Max |  215261.1  457547.8
------------------------------

. 
. * Export tabstat-like summary for real, winsorized income variables (LaTeX)
. preserve

. tempfile income_stats

. postfile handle str32 varname double obs mean sd p1 p5 p50 p95 p99 min max usin
> g "`income_stats'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000003 not
    found)

. 
. foreach v in labor_income_real_win_ total_income_real_win_ {
  2.     if "`wopt'" != "" {
  3.         quietly summarize `v' `wopt'
  4.         local N = r(N)
  5.         local mean = r(mean)
  6.         local sd = r(sd)
  7.         local min = r(min)
  8.         local max = r(max)
  9.         quietly centile `v' `wopt', centile(1 5 50 95 99)
 10.         local p1 = r(c_1)
 11.         local p5 = r(c_2)
 12.         local p50 = r(c_3)
 13.         local p95 = r(c_4)
 14.         local p99 = r(c_5)
 15.         post handle ("`v'") (`N') (`mean') (`sd') (`p1') (`p5') (`p50') (`p9
> 5') (`p99') (`min') (`max')
 16.     }
 17.     else {
 18.         quietly summarize `v', detail
 19.         post handle ("`v'") (r(N)) (r(mean)) (r(sd)) (r(p1)) (r(p5)) (r(p50)
> ) (r(p95)) (r(p99)) (r(min)) (r(max))
 20.     }
 21. }

. postclose handle

. 
. use "`income_stats'", clear

. 
. file open fh using "${DESCRIPTIVE}/Tables/income_final_tabstat.tex", write repl
> ace

. file write fh "\begin{table}[htbp]\centering\small" _n ///
>     "\caption{Income (real, winsorized): summary statistics}" _n ///
>     "\label{tab:income_final_tabstat}" _n ///
>     "\resizebox{\textwidth}{!}{\begin{tabular}{lrrrrrrr}\toprule" _n ///
>     "Variable & Obs & Mean & SD & P50 & P95 & Min & Max \\\\ \midrule" _n

. 
. forvalues r = 1/`=_N' {
  2.     local vname = varname[`r']
  3.     if "`vname'" == "labor_income_real_win_"  local vname "Labor income (rea
> l, winsorized)"
  4.     if "`vname'" == "total_income_real_win_"  local vname "Total income (rea
> l, winsorized)"
  5.     local obs_s = string(obs[`r'], "%9.0fc")
  6.     local mean_s = string(mean[`r'], "%9.0fc")
  7.     local sd_s   = string(sd[`r'],   "%9.0fc")
  8.     local p50_s  = string(p50[`r'],  "%9.0fc")
  9.     local p95_s  = string(p95[`r'],  "%9.0fc")
 10.     local min_s  = string(min[`r'],  "%9.0fc")
 11.     local max_s  = string(max[`r'],  "%9.0fc")
 12. 
.     file write fh "`vname' & `obs_s' & `mean_s' & `sd_s' & `p50_s' & `p95_s' & 
> `min_s' & `max_s' \\\\" _n
 13. }

. 
. file write fh "\bottomrule" _n "\multicolumn{8}{l}{\footnotesize Real USD, wins
> orized; summary over person-years.} \\\\" _n "\end{tabular}}" _n "\end{table}" 
> _n

. file close fh

. restore

. 
. * Mean income by year (deflated + winsorized levels)
. display "=== Mean income by year ==="
=== Mean income by year ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year >= 2002, b
> y(year) statistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: year 

    year |  labor_~_  total_~_
---------+--------------------
    2002 |     18165     18165
         |  15135.96  51879.56
         |  32581.56  66408.64
         |         0  30190.74
         |  85871.86  174153.5
---------+--------------------
    2004 |     20129     20129
         |  19002.95  55398.98
         |  37651.11  71843.25
         |         0  31557.19
         |  100409.2  192728.3
---------+--------------------
    2006 |     18469     18469
         |     16159  53490.91
         |  33698.05  70023.78
         |         0  30652.14
         |  90074.27  179795.8
---------+--------------------
    2008 |     17217     17217
         |  14976.45   52959.1
         |  32820.76  69116.71
         |         0  29724.03
         |   88119.7  182563.1
---------+--------------------
    2010 |     22034     22034
         |  20165.05  50370.51
         |  37832.26  62363.52
         |         0  29267.33
         |  101890.2  168121.7
---------+--------------------
    2012 |     20554     20554
         |  18250.02  49179.34
         |  36190.71  63013.48
         |         0  27767.02
         |  95601.82    167603
---------+--------------------
    2014 |     18747     18747
         |  17278.48  49728.29
         |  36130.46  63835.67
         |         0  27988.51
         |  95012.12  166566.6
---------+--------------------
    2016 |     20912     20912
         |  21644.23  53540.13
         |  41289.47  71989.35
         |         0  29322.11
         |    112903  183103.5
---------+--------------------
    2018 |     17146     17146
         |  19847.59  52320.76
         |  39573.98  71356.05
         |         0  28057.84
         |  106835.6  180757.2
---------+--------------------
    2020 |     15723     15723
         |     19568   52702.8
         |  39173.98  70308.87
         |         0  29049.48
         |  104681.2  181726.6
---------+--------------------
    2022 |     15856     15856
         |  18859.99  50625.02
         |  38345.78  68372.63
         |         0  26985.72
         |  100008.5  179644.9
---------+--------------------
   Total |    204952    204952
         |  18329.83  52003.74
         |  37032.23  68035.62
         |         0   29103.4
         |  97924.05  177497.5
------------------------------

. preserve

. keep if year >= 2002
(45,234 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_
>  (count) n=labor_income_real_win_ `wopt', by(year)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_year_real_win.tex", wr
> ite replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by year 
> (real, winsorized)}" _n "\label{tab:income_mean_by_year_real_win}" _n "\begin{t
> abular}{lrrr}\toprule" _n "Year & Labor income (mean `dl') & Total income (mean
>  `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`yr_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Real USD; wins
> orized at 1st and 99th percentile.} \\\\" _n "\end{tabular}" _n "\end{table}" _
> n

. file close fh

. restore

. 
. * Income by age group (year-specific; deflated + winsorized levels)
. display "=== Mean income by age group (2002) ==="
=== Mean income by age group (2002) ===

. gen int age_group = floor(age/5)*5 if !missing(age)
(318,278 missing values generated)

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year == 2002, b
> y(age_group) statistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  labor_~_  total_~_
----------+--------------------
       25 |         7         7
          |  33573.96  42685.42
          |     21389  17562.17
          |  30130.48  34650.05
          |     63274  70505.31
----------+--------------------
       30 |         9         9
          |  24891.12  85057.37
          |  24295.68  126479.7
          |  21091.33  49263.33
          |     63274  416783.7
----------+--------------------
       35 |        37        37
          |  26630.86   66193.3
          |  26782.26  77558.95
          |  19886.11  48220.81
          |  75326.19  301606.1
----------+--------------------
       40 |       105       105
          |  31334.18  64269.11
          |  36664.75  75696.66
          |  21091.33  42182.67
          |  112989.3    224924
----------+--------------------
       45 |       250       250
          |  36589.12  64878.88
          |  40405.72  79766.26
          |  27117.43  39874.67
          |  119768.6  219048.6
----------+--------------------
       50 |       783       783
          |  38700.48  72378.63
          |  44524.34  87412.01
          |  26364.17  43267.36
          |  138600.2  266654.7
----------+--------------------
       55 |      2381      2381
          |  38756.01  72494.99
          |   45475.6  82155.62
          |   25610.9  48434.74
          |  140106.7  252493.4
----------+--------------------
       60 |      3653      3653
          |  24975.35  60751.88
          |  38612.83  77092.37
          |         0  36445.82
          |  108469.7  225978.6
----------+--------------------
       65 |      3303      3303
          |  9984.473  50404.32
          |  25745.57  63525.77
          |         0   30275.1
          |  60260.95  164688.7
----------+--------------------
       70 |      2569      2569
          |   3788.77  45927.07
          |  15234.73  57876.78
          |         0  28798.71
          |  24104.38  148284.1
----------+--------------------
       75 |      2039      2039
          |  1594.065  39307.09
          |  9429.967  45229.57
          |         0  25820.31
          |  7532.619  116303.6
----------+--------------------
       80 |      1660      1660
          |  718.2833  34634.69
          |  7852.371  40469.22
          |         0  22848.05
          |         0  97948.15
----------+--------------------
       85 |       868       868
          |  91.05444  32257.19
          |  1217.408  37721.11
          |         0  21373.05
          |         0  94730.22
----------+--------------------
       90 |       399       399
          |  34.35931  28830.09
          |  454.9906  32503.24
          |         0  18078.29
          |         0  76079.45
----------+--------------------
       95 |        89        89
          |         0  32285.39
          |         0  41172.86
          |         0  18078.29
          |         0  130163.7
----------+--------------------
      100 |        10        10
          |         0  17744.08
          |         0  14708.12
          |         0  13405.05
          |         0  55289.63
----------+--------------------
      105 |         3         3
          |         0  11618.31
          |         0  1551.506
          |         0  12365.55
          |         0   12654.8
----------+--------------------
    Total |     18165     18165
          |  15135.96  51879.56
          |  32581.56  66408.64
          |         0  30190.74
          |  85871.86  174153.5
-------------------------------

. preserve

. keep if year == 2002
(497,574 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_
>  (count) n=labor_income_real_win_ `wopt', by(age_group)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_agegroup_real_win_2002
> .tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by age g
> roup (2002)}" _n "\label{tab:income_mean_by_agegroup_2002}" _n "\begin{tabular}
> {lrrr}\toprule" _n "Age (midpoint) & Labor income (mean `dl') & Total income (m
> ean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local age_s = string(age_group[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`age_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Five-year age 
> bins (e.g., 50 = 50--54). Real USD, winsorized.} \\\\" _n "\end{tabular}" _n "\
> end{table}" _n

. file close fh

. restore

. 
. display "=== Mean income by age group (2022) ==="
=== Mean income by age group (2022) ===

. tabstat labor_income_real_win_ total_income_real_win_ `wopt' if year == 2022, b
> y(age_group) statistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  labor_~_  total_~_
----------+--------------------
       25 |         2         2
          |         0  11354.88
          |         0  10558.03
          |         0  11354.88
          |         0  18820.53
----------+--------------------
       30 |         8         8
          |  32109.21  88034.09
          |  20463.04  99537.96
          |  35188.18  45179.77
          |  61116.31  252058.5
----------+--------------------
       35 |        28        28
          |  19994.52  60831.88
          |  28936.02    108914
          |  2778.014  24261.32
          |  88896.45    423789
----------+--------------------
       40 |        95        95
          |  25892.03  47446.03
          |  35115.92  77236.78
          |  9260.047  24539.12
          |  95378.48  181496.9
----------+--------------------
       45 |       233       233
          |  36851.51  63806.45
          |  41908.52  74094.02
          |  25002.13  46300.23
          |  118969.4  232427.2
----------+--------------------
       50 |      1286      1286
          |  43923.09  69038.53
          |  52493.22  81768.42
          |  27780.14  43527.78
          |  162050.8  245402.4
----------+--------------------
       55 |      2285      2285
          |  38022.03  62013.91
          |  48883.33  79166.92
          |  21298.11   36225.3
          |  145382.7  229278.8
----------+--------------------
       60 |      2924      2924
          |  28185.61  55429.04
          |  43560.69  75457.99
          |  1852.009  28718.65
          |  120380.6  200724.5
----------+--------------------
       65 |      2641      2641
          |   14748.8  46993.92
          |  33357.48  63817.36
          |         0  25202.14
          |  81488.41  155569.7
----------+--------------------
       70 |      2204      2204
          |  6731.899  43629.47
          |  22000.55  57243.78
          |         0  24481.23
          |  44448.22  143401.1
----------+--------------------
       75 |      1401      1401
          |  3486.788  43555.59
          |  17363.84  59372.06
          |         0  24446.52
          |  18334.89  139445.2
----------+--------------------
       80 |      1421      1421
          |  1463.668  39317.74
          |  10521.64  52834.22
          |         0  22368.57
          |  4630.023  127640.5
----------+--------------------
       85 |       871       871
          |  528.0486  37902.51
          |  6784.852  48022.14
          |         0  23531.32
          |         0  121705.7
----------+--------------------
       90 |       361       361
          |  519.4348  39475.66
          |  9747.841  63086.81
          |         0  22279.67
          |         0  128936.7
----------+--------------------
       95 |        79        79
          |         0  46538.41
          |         0  85762.84
          |         0  20668.42
          |         0  293547.2
----------+--------------------
      100 |        16        16
          |         0  14516.77
          |         0    5382.9
          |         0  14019.82
          |         0  23335.32
----------+--------------------
      105 |         1         1
          |         0  11112.06
          |         .         .
          |         0  11112.06
          |         0  11112.06
----------+--------------------
    Total |     15856     15856
          |  18859.99  50625.02
          |  38345.78  68372.63
          |         0  26985.72
          |  100008.5  179644.9
-------------------------------

. preserve

. keep if year == 2022
(497,574 observations deleted)

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_
>  (count) n=labor_income_real_win_ `wopt', by(age_group)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_agegroup_real_win_2022
> .tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by age g
> roup (2022)}" _n "\label{tab:income_mean_by_agegroup_2022}" _n "\begin{tabular}
> {lrrr}\toprule" _n "Age (midpoint) & Labor income (mean `dl') & Total income (m
> ean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local age_s = string(age_group[`r'], "%9.0f")
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`age_s' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Five-year age 
> bins (e.g., 50 = 50--54). Real USD, winsorized.} \\\\" _n "\end{tabular}" _n "\
> end{table}" _n

. file close fh

. restore

. 
. * Income by education group (deflated + winsorized levels)
. display "=== Mean income by education group ==="
=== Mean income by education group ===

. gen byte educ_group = .
(542,808 missing values generated)

. replace educ_group = 1 if educ_yrs < 12
(144,840 real changes made)

. replace educ_group = 2 if educ_yrs == 12
(163,332 real changes made)

. replace educ_group = 3 if inrange(educ_yrs,13,15)
(116,088 real changes made)

. replace educ_group = 4 if educ_yrs == 16
(59,616 real changes made)

. replace educ_group = 5 if educ_yrs >= 17 & !missing(educ_yrs)
(51,144 real changes made)

. label define educ_group 1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "gra
> d"

. label values educ_group educ_group

. tabstat labor_income_real_win_ total_income_real_win_ `wopt', by(educ_group) st
> atistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: educ_group 

  educ_group |  labor_~_  total_~_
-------------+--------------------
       no hs |     44654     44654
             |  6075.405  23987.03
             |  17518.17  34233.27
             |         0   15164.7
             |  39516.07  69760.53
-------------+--------------------
          hs |     63826     63826
             |  12590.17  39601.23
             |  26535.23  48416.92
             |         0  25840.84
             |   67219.6  117161.1
-------------+--------------------
some college |     47390     47390
             |  20297.66  53482.61
             |  35645.48  63387.95
             |         0  34325.77
             |  94413.96  164964.4
-------------+--------------------
  4yr degree |     24820     24820
             |  32778.98  82577.63
             |  50228.92   87884.7
             |         0  55094.56
             |  147483.3  272380.6
-------------+--------------------
        grad |     23091     23091
             |  37444.78    104066
             |  56540.62  99115.25
             |         0  73311.23
             |  173250.2  347148.1
-------------+--------------------
       Total |    203781    203781
             |   18230.3     51947
             |  36928.46  67977.16
             |         0  29059.51
             |  97924.05  177187.9
----------------------------------

. preserve

. collapse (mean) mean_lab=labor_income_real_win_ mean_tot=total_income_real_win_
>  (count) n=labor_income_real_win_ `wopt', by(educ_group)

. drop if missing(educ_group)
(1 observation deleted)

. decode educ_group, gen(educ_label)

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/income_mean_by_educgroup_real_win.tex
> ", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean income by educa
> tion group (real, winsorized)}" _n "\label{tab:income_mean_by_educgroup_real_wi
> n}" _n "\begin{tabular}{lrrr}\toprule" _n "Education & Labor income (mean `dl')
>  & Total income (mean `dl') & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local edlab = educ_label[`r']
  3.     local lab_s = string(mean_lab[`r'], "%9.0fc")
  4.     local tot_s = string(mean_tot[`r'], "%9.0fc")
  5.     local n_s = string(n[`r'], "%9.0fc")
  6.     file write fh "`edlab' & `lab_s' & `tot_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Real USD, wins
> orized. no hs = $<$12y; hs = 12y; some college = 13--15y; 4yr = 16y; grad = 17+
> y.} \\\\" _n "\end{tabular}" _n "\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Figure 1A, 2A, 3: Income by age, income by age and education, income over tim
> e
. * ---------------------------------------------------------------------
. 
. * Figure 1A — Mean labor and total income by age group (2 lines per graph, 2002
>  and 2022)
. foreach yr in 2002 2022 {
  2.     preserve
  3.     keep if year == `yr'
  4.     collapse (mean) mean_lab=labor_income_real_win_ (mean) mean_tot=total_in
> come_real_win_ `wopt', by(age_group)
  5.     sort age_group
  6.     twoway (line mean_lab age_group, lwidth(medthick) lcolor(navy)) (line me
> an_tot age_group, lpattern(dash) lcolor(maroon)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Income by age group (`yr')") ///
>         legend(order(1 "Labor income" 2 "Total income") cols(1) size(small) pos
> ition(3) ring(0) region(lstyle(none)))
  7.     graph export "${DESCRIPTIVE}/Figures/income_by_agegroup_`yr'.png", repla
> ce
  8.     restore
  9. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_by_ag
    > egroup_2002.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_by_ag
    > egroup_2022.png saved as PNG format

. 
. * Figure 2A — Income by age group with lines by education (labor and total sepa
> rately, 2002 and 2022)
. foreach yr in 2002 2022 {
  2.     * Labor income by age and education (5 lines = 5 educ groups)
.     preserve
  3.     keep if year == `yr'
  4.     collapse (mean) mean_inc=labor_income_real_win_ `wopt', by(age_group edu
> c_group)
  5.     sort age_group educ_group
  6.     twoway (line mean_inc age_group if educ_group==1, lcolor(navy)) ///
>            (line mean_inc age_group if educ_group==2, lcolor(maroon)) ///
>            (line mean_inc age_group if educ_group==3, lcolor(forest_green)) ///
>            (line mean_inc age_group if educ_group==4, lcolor(orange)) ///
>            (line mean_inc age_group if educ_group==5, lcolor(teal)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Labor income by age and education (`yr')") ///
>         legend(order(1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "grad")
>  cols(1) size(small) position(3) ring(0) region(lstyle(none)))
  7.     graph export "${DESCRIPTIVE}/Figures/labinc_by_age_educ_`yr'.png", repla
> ce
  8.     restore
  9.     * Total income by age and education (5 lines = 5 educ groups)
.     preserve
 10.     keep if year == `yr'
 11.     collapse (mean) mean_inc=total_income_real_win_ `wopt', by(age_group edu
> c_group)
 12.     sort age_group educ_group
 13.     twoway (line mean_inc age_group if educ_group==1, lcolor(navy)) ///
>            (line mean_inc age_group if educ_group==2, lcolor(maroon)) ///
>            (line mean_inc age_group if educ_group==3, lcolor(forest_green)) ///
>            (line mean_inc age_group if educ_group==4, lcolor(orange)) ///
>            (line mean_inc age_group if educ_group==5, lcolor(teal)), ///
>         xtitle("Age group (5-year bins)") ///
>         xlabel(20(10)90) ///
>         ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>         title("Total income by age and education (`yr')") ///
>         legend(order(1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "grad")
>  cols(1) size(small) position(3) ring(0) region(lstyle(none)))
 14.     graph export "${DESCRIPTIVE}/Figures/totinc_by_age_educ_`yr'.png", repla
> ce
 15.     restore
 16. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labinc_by_ag
    > e_educ_2002.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/totinc_by_ag
    > e_educ_2002.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labinc_by_ag
    > e_educ_2022.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/totinc_by_ag
    > e_educ_2022.png saved as PNG format

. 
. * Figure 3 — Mean labor and total income over time (one graph, 2 lines)
. preserve

. collapse (mean) mean_lab=labor_income_real_win_ (mean) mean_tot=total_income_re
> al_win_ `wopt', by(year)

. twoway (line mean_lab year, lwidth(medthick) lcolor(navy)) (line mean_tot year,
>  lpattern(dash) lcolor(maroon)), ///
>     xtitle("Year") ytitle("Income (winsorized)") ylabel(, format(%9.0fc)) ///
>     title("Income over time") ///
>     legend(order(1 "Labor income" 2 "Total income") cols(1) size(small) positio
> n(3) ring(0) region(lstyle(none)))

. graph export "${DESCRIPTIVE}/Figures/income_over_time.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_over_
    > time.png saved as PNG format

. restore

. 
. * Figure 4 — Mean income growth over time (labor and total, percent)
. preserve

. keep year ln_lab_inc_final_growth_* ln_tot_inc_final_growth_*

. 
. * Build end-year-specific means for each growth series
. tempfile growth_means

. postfile handle double year double g_lab g_tot using "`growth_means'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00000g not
    found)

. 
. foreach v of varlist ln_lab_inc_final_growth_* {
  2.     local base "ln_lab_inc_final_growth_"
  3.     local yr = substr("`v'", `=length("`base'")'+1, .)
  4.     quietly summarize `v' if year == `yr' & !missing(`v') `wopt'
  5.     if r(N) == 0 continue
  6.     local g_lab = r(mean) * 100
  7.     * Find matching total-income growth variable for same end year
.     local vtot = "ln_tot_inc_final_growth_`yr'"
  8.     capture confirm variable `vtot'
  9.     if _rc {
 10.         post handle (`yr') (`g_lab') (.)
 11.     }
 12.     else {
 13.         quietly summarize `vtot' if year == `yr' & !missing(`vtot') `wopt'
 14.         local g_tot = r(mean) * 100
 15.         post handle (`yr') (`g_lab') (`g_tot')
 16.     }
 17. }

. postclose handle

. 
. use "`growth_means'", clear

. sort year

. twoway (line g_lab year, lwidth(medthick) lcolor(navy)) ///
>        (line g_tot year, lpattern(dash) lcolor(maroon)), ///
>     xtitle("Year (end of two-year growth period)") ///
>     ytitle("Average income growth (\%)") ///
>     ylabel(, format(%9.1f)) ///
>     title("Income growth over time") ///
>     legend(order(1 "Labor income growth" 2 "Total income growth") cols(1) size(
> small) position(3) ring(0) region(lstyle(none)))

. graph export "${DESCRIPTIVE}/Figures/income_growth_over_time.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/income_growt
    > h_over_time.png saved as PNG format

. restore

. 
. * Income growth summary by wave (growth attached to end year)
. display "=== Income growth summary (by end year) ==="
=== Income growth summary (by end year) ===

. preserve

. keep year ln_lab_inc_final_growth_* ln_tot_inc_final_growth_*

. 
. * Export tabstat-like summary for income growth variables
. tempfile growth_stats

. postfile handle str32 varname double obs mean sd p1 p5 p50 p95 p99 min max usin
> g "`growth_stats'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00000i not
    found)

. foreach v of varlist ln_lab_inc_final_growth_* ln_tot_inc_final_growth_* {
  2.     * Restrict to the wave corresponding to the end year encoded in the vari
> able name
.     local ifcond ""
  3.     if strpos("`v'", "ln_lab_inc_final_growth_") > 0 {
  4.         local base "ln_lab_inc_final_growth_"
  5.         local yr = substr("`v'", `=length("`base'")'+1, .)
  6.         local ifcond "if year == `yr' & !missing(`v')"
  7.     }
  8.     else if strpos("`v'", "ln_tot_inc_final_growth_") > 0 {
  9.         local base2 "ln_tot_inc_final_growth_"
 10.         local yr2 = substr("`v'", `=length("`base2'")'+1, .)
 11.         local ifcond "if year == `yr2' & !missing(`v')"
 12.     }
 13. 
.     if "`wopt'" != "" {
 14.         quietly summarize `v' `wopt' `ifcond'
 15.         local N = r(N)
 16.         local mean = r(mean)
 17.         local sd = r(sd)
 18.         local min = r(min)
 19.         local max = r(max)
 20.         quietly centile `v' `wopt' `ifcond', centile(1 5 50 95 99)
 21.         local p1 = r(c_1)
 22.         local p5 = r(c_2)
 23.         local p50 = r(c_3)
 24.         local p95 = r(c_4)
 25.         local p99 = r(c_5)
 26.         post handle ("`v'") (`N') (`mean') (`sd') (`p1') (`p5') (`p50') (`p9
> 5') (`p99') (`min') (`max')
 27.     }
 28.     else {
 29.         quietly summarize `v' `ifcond', detail
 30.         post handle ("`v'") (r(N)) (r(mean)) (r(sd)) (r(p1)) (r(p5)) (r(p50)
> ) (r(p95)) (r(p99)) (r(min)) (r(max))
 31.     }
 32. }

. postclose handle

. use "`growth_stats'", clear

. file open fh using "${DESCRIPTIVE}/Tables/income_growth_tabstat.tex", write rep
> lace

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Income growth:
>  summary statistics}" _n "\label{tab:income_growth_tabstat}" _n "\resizebox{\te
> xtwidth}{!}{\begin{tabular}{lrrrrrrr}\toprule" _n "Variable & Obs & Mean & SD &
>  P50 & P95 & Min & Max \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     * Skip variables with zero observations (e.g. earliest growth year)
.     if obs[`r'] == 0 continue
  3. 
.     local vraw = varname[`r']
  4.     local vname "`vraw'"
  5. 
.     * Make labels more interpretable by attaching the end year of the growth pe
> riod
.     if strpos("`vraw'", "ln_lab_inc_final_growth_") > 0 {
  6.         local base "ln_lab_inc_final_growth_"
  7.         local yr = substr("`vraw'", `=length("`base'")'+1, .)
  8.         local vname "Log labor income growth (`yr')"
  9.     }
 10.     else if strpos("`vraw'", "ln_tot_inc_final_growth_") > 0 {
 11.         local base2 "ln_tot_inc_final_growth_"
 12.         local yr2 = substr("`vraw'", `=length("`base2'")'+1, .)
 13.         local vname "Log total income growth (`yr2')"
 14.     }
 15. 
.     local obs_s = string(obs[`r'], "%9.0fc")
 16.     local mean_s = string(mean[`r'], "%9.4f")
 17.     local sd_s = string(sd[`r'], "%9.4f")
 18.     local p50_s = string(p50[`r'], "%9.4f")
 19.     local p95_s = string(p95[`r'], "%9.4f")
 20.     local min_s = string(min[`r'], "%9.4f")
 21.     local max_s = string(max[`r'], "%9.4f")
 22.     file write fh "`vname' & `obs_s' & `mean_s' & `sd_s' & `p50_s' & `p95_s'
>  & `min_s' & `max_s' \\\\" _n
 23. }

. file write fh "\bottomrule" _n "\multicolumn{8}{l}{\footnotesize Two-year log d
> ifference by end year; ln(income), zero income dropped (N reflects). Labor = ea
> rnings+unemployment; total = all components.} \\\\" _n "\end{tabular}}" _n "\en
> d{table}" _n

. file close fh

. restore

. 
. * Income vs wealth percentile: mean+IQR ribbon and binscatter (titles/labels al
> igned with 07 returns)
. * Wealth percentiles by year (1-100)
. local pctvars "wealth_core wealth_ira wealth_res wealth_total gross_wealth"

. foreach v of local pctvars {
  2.     sort year `v'
  3.     by year: gen long _rank_`v' = sum(!missing(`v'))
  4.     by year: gen long _N_`v' = _rank_`v'[_N]
  5.     gen int `v'_pct = .
  6.     replace `v'_pct = ceil(100 * _rank_`v' / _N_`v') if !missing(`v')
  7.     drop _rank_`v' _N_`v'
  8. }
(542,808 missing values generated)
(224,494 real changes made)
(542,808 missing values generated)
(224,528 real changes made)
(542,808 missing values generated)
(224,528 real changes made)
(542,808 missing values generated)
(144,138 real changes made)
(542,808 missing values generated)
(210,180 real changes made)

. 
. capture which binscatter

. if _rc capture ssc install binscatter, replace

. 
. display "=== Log income vs wealth percentile: mean+IQR and binscatter ==="
=== Log income vs wealth percentile: mean+IQR and binscatter ===

. local years "2002 2022"

. foreach y of local years {
  2.     quietly count if year == `y' & !missing(wealth_total_pct)
  3.     if r(N) < 10 continue
  4. 
.     * --- Labor income: mean + P10-P90 range; binscatter uses log ---
.     quietly count if year == `y' & !missing(labor_income_real_win_) & !missing(
> wealth_total_pct)
  5.     if r(N) >= 10 {
  6.         preserve
  7.         keep if year == `y'
  8.         collapse (mean) mean_inc = labor_income_real_win_ (p10) p10_inc = la
> bor_income_real_win_ (p90) p90_inc = labor_income_real_win_, by(wealth_total_pc
> t)
  9.         twoway (rarea p90_inc p10_inc wealth_total_pct, color(gs12)) (line m
> ean_inc wealth_total_pct, lcolor(navy) lwidth(medthick)), ///
>             xtitle("Wealth total (pct.)") ytitle("Labor income (real, win, $)")
>  ylabel(, format(%9.0fc)) ///
>             title("Mean/P10-P90: Labor income by wealth (pct.) (`y')") legend(o
> ff)
 10.         graph export "${DESCRIPTIVE}/Figures/labor_income_real_win_p10p90_by
> _wealthpct_`y'.png", replace
 11.         restore
 12.     }
 13.     quietly count if year == `y' & !missing(ln_lab_inc_final_) & !missing(we
> alth_total_pct)
 14.     if r(N) >= 10 {
 15.         capture binscatter ln_lab_inc_final_ wealth_total_pct if year == `y'
> , nquantiles(50) ///
>             ytitle("Log labor income") xtitle("Wealth total (pct.)") ///
>             title("Binscatter: Labor income by wealth (pct.) (`y')")
 16.         if _rc == 0 graph export "${DESCRIPTIVE}/Figures/log_labor_income_bi
> nscatter_`y'.png", replace
 17.     }
 18. 
.     * --- Total income: mean+IQR uses real winsorized (level); binscatter uses 
> log ---
.     quietly count if year == `y' & !missing(total_income_real_win_) & !missing(
> wealth_total_pct)
 19.     if r(N) >= 10 {
 20.         preserve
 21.         keep if year == `y'
 22.         collapse (mean) mean_inc = total_income_real_win_ (p25) p25_inc = to
> tal_income_real_win_ (p75) p75_inc = total_income_real_win_, by(wealth_total_pc
> t)
 23.         twoway (rarea p75_inc p25_inc wealth_total_pct, color(gs12)) (line m
> ean_inc wealth_total_pct, lcolor(maroon) lwidth(medthick)), ///
>             xtitle("Wealth total (pct.)") ytitle("Total income (real, win, $)")
>  ylabel(, format(%9.0fc)) ///
>             title("Mean/IQR: Total income by wealth (pct.) (`y')") legend(off)
 24.         graph export "${DESCRIPTIVE}/Figures/total_income_real_win_iqr_by_we
> althpct_`y'.png", replace
 25.         restore
 26.     }
 27.     quietly count if year == `y' & !missing(ln_tot_inc_final_) & !missing(we
> alth_total_pct)
 28.     if r(N) >= 10 {
 29.         capture binscatter ln_tot_inc_final_ wealth_total_pct if year == `y'
> , nquantiles(50) ///
>             ytitle("Log total income") xtitle("Wealth total (pct.)") ///
>             title("Binscatter: Total income by wealth (pct.) (`y')")
 30.         if _rc == 0 graph export "${DESCRIPTIVE}/Figures/log_total_income_bi
> nscatter_`y'.png", replace
 31.     }
 32. }
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labor_income
    > _real_win_p10p90_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_labor_in
    > come_binscatter_2002.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/total_income
    > _real_win_iqr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_total_in
    > come_binscatter_2002.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/labor_income
    > _real_win_p10p90_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_labor_in
    > come_binscatter_2022.png saved as PNG format
(497,574 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/total_income
    > _real_win_iqr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/log_total_in
    > come_binscatter_2022.png saved as PNG format

. 
. * ---------------------------------------------------------------------
. * Income vs trust (2022): deflated+winsorized and scaled-asinh transforms
. * ---------------------------------------------------------------------
. display "=== Income vs trust (2022): deflated+winsor and scaled asinh ==="
=== Income vs trust (2022): deflated+winsor and scaled asinh ===

. 
. preserve

. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Restrict to 2022 if year variable exists
. capture confirm variable year

. if !_rc keep if year == 2022

. 
. * Single-panel: scaled asinh labor income vs trust
. capture confirm variable ihs_lab_inc_defl_win_s_2022 trust_others_2020

. if !_rc {
.     twoway scatter ihs_lab_inc_defl_win_s_2022 trust_others_2020 if !missing(ih
> s_lab_inc_defl_win_s_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(navy%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Scaled asinh labor income vs trust (2022)")
.     graph export "${DESCRIPTIVE}/Figures/as_lab_trust_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/as_lab_trust
    > _2022.png saved as PNG format
. }

. 
. * Single-panel: scaled asinh total income vs trust
. capture confirm variable ihs_tot_inc_defl_win_s_2022 trust_others_2020

. if !_rc {
.     twoway scatter ihs_tot_inc_defl_win_s_2022 trust_others_2020 if !missing(ih
> s_tot_inc_defl_win_s_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(maroon%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Scaled asinh total income vs trust (2022)")
.     graph export "${DESCRIPTIVE}/Figures/as_tot_trust_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/as_tot_trust
    > _2022.png saved as PNG format
. }

. 
. * Three-panel combined figure: labor income (Defl+Win, Defl+Win+ln(x), Defl+Win
> +asinh(x/med+))
. capture confirm variable lab_inc_defl_win_2022 ln_lab_inc_defl_win_2022 ihs_lab
> _inc_defl_win_s_2022 trust_others_2020

. if !_rc {
.     twoway scatter lab_inc_defl_win_2022 trust_others_2020 if !missing(lab_inc_
> defl_win_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(navy%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win") ///
>         name(g_l1, replace)
.     twoway scatter ln_lab_inc_defl_win_2022 trust_others_2020 if !missing(ln_la
> b_inc_defl_win_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(navy%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win+ln(x)") ///
>         name(g_l2, replace)
.     twoway scatter ihs_lab_inc_defl_win_s_2022 trust_others_2020 if !missing(ih
> s_lab_inc_defl_win_s_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(navy%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win+asinh(x/med+)") ///
>         name(g_l3, replace)
.     graph combine g_l1 g_l2 g_l3, cols(2) ///
>         title("Labor income vs trust (2022)")
.     graph export "${DESCRIPTIVE}/Figures/dw_lab_trust_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/dw_lab_trust
    > _2022.png saved as PNG format
. }

. 
. * Three-panel combined figure: total income (Defl+Win, Defl+Win+ln(x), Defl+Win
> +asinh(x/med+))
. capture confirm variable tot_inc_defl_win_2022 ln_tot_inc_defl_win_2022 ihs_tot
> _inc_defl_win_s_2022 trust_others_2020

. if !_rc {
.     twoway scatter tot_inc_defl_win_2022 trust_others_2020 if !missing(tot_inc_
> defl_win_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(maroon%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win") ///
>         name(g_t1, replace)
.     twoway scatter ln_tot_inc_defl_win_2022 trust_others_2020 if !missing(ln_to
> t_inc_defl_win_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(maroon%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win+ln(x)") ///
>         name(g_t2, replace)
.     twoway scatter ihs_tot_inc_defl_win_s_2022 trust_others_2020 if !missing(ih
> s_tot_inc_defl_win_s_2022) & !missing(trust_others_2020), ///
>         msize(vsmall) mcolor(maroon%40) ///
>         xtitle("General trust (2020)") ///
>         ytitle("Income transform value") ///
>         title("Defl+Win+asinh(x/med+)") ///
>         name(g_t3, replace)
.     graph combine g_t1 g_t2 g_t3, cols(2) ///
>         title("Total income vs trust (2022)")
.     graph export "${DESCRIPTIVE}/Figures/dw_tot_trust_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/dw_tot_trust
    > _2022.png saved as PNG format
. }

. 
. restore

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/06_des
> criptive_income.log
  log type:  text
 closed on:  19 Feb 2026, 13:50:07
---------------------------------------------------------------------------------
