-------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/07_descriptive_returns.log
  log type:  text
 opened on:   7 Feb 2026, 20:00:59

. 
. capture mkdir "${DESCRIPTIVE}"

. capture mkdir "${DESCRIPTIVE}/Figures"

. capture mkdir "${DESCRIPTIVE}/Tables"

. 
. * ---------------------------------------------------------------------
. * Part A: Components, flows, incomes, wealth, debt (from all_data_merged)
. * ---------------------------------------------------------------------
. use "${CLEANED}/all_data_merged.dta", clear

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Build wealth_total_YYYY (net), gross_wealth_YYYY, wealth_ira_YYYY, wealth_res_YYYY
. local years "2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. forvalues w = 5/16 {
  2.     local y = 1990 + (2*`w')
  3.     capture confirm variable h`w'atotb
  4.     if !_rc {
  5.         capture drop wealth_total_`y' gross_wealth_`y'
  6.         capture drop _gross_n_`y' _debt_total_`y' _debt_n_`y'
  7.         egen byte _gross_n_`y' = rownonmiss(h`w'atoth h`w'anethb h`w'arles h`w'atran h`w'absns h`w'aira 
> h`w'astck h`w'achck h`w'acd h`w'abond h`w'aothr)
  8.         egen byte _debt_n_`y' = rownonmiss(h`w'amort h`w'ahmln h`w'adebt h`w'amrtb)
  9.         gen double _debt_total_`y' = ///
>             max(h`w'amort,0) + max(h`w'ahmln,0) + max(h`w'adebt,0) + max(h`w'amrtb,0)
 10.         replace _debt_total_`y' = . if _debt_n_`y' == 0
 11.         gen double gross_wealth_`y' = ///
>             max(h`w'atoth,0) + max(h`w'anethb,0) + max(h`w'arles,0) + max(h`w'atran,0) + ///
>             max(h`w'absns,0) + max(h`w'aira,0) + max(h`w'astck,0) + max(h`w'achck,0) + ///
>             max(h`w'acd,0) + max(h`w'abond,0) + max(h`w'aothr,0)
 12.         replace gross_wealth_`y' = . if _gross_n_`y' == 0
 13.         gen double wealth_total_`y' = gross_wealth_`y' - _debt_total_`y'
 14.         replace wealth_total_`y' = . if _gross_n_`y' == 0 & _debt_n_`y' == 0
 15.     }
 16.     capture confirm variable h`w'aira
 17.     if !_rc {
 18.         capture drop wealth_ira_`y'
 19.         gen double wealth_ira_`y' = h`w'aira
 20.     }
 21.     capture confirm variable h`w'atoth h`w'anethb
 22.     if !_rc {
 23.         capture drop wealth_res_`y'
 24.         gen double wealth_res_`y' = h`w'atoth + h`w'anethb if !missing(h`w'atoth) & !missing(h`w'anethb)
 25.     }
 26. }
(25,656 real changes made, 25,656 to missing)
(25,656 real changes made, 25,656 to missing)
(25,656 missing values generated)
(0 real changes made)
(25,656 missing values generated)
(25,656 missing values generated)
(27,069 real changes made, 27,069 to missing)
(27,069 real changes made, 27,069 to missing)
(27,069 missing values generated)
(0 real changes made)
(27,069 missing values generated)
(27,069 missing values generated)
(25,105 real changes made, 25,105 to missing)
(25,105 real changes made, 25,105 to missing)
(25,105 missing values generated)
(0 real changes made)
(25,105 missing values generated)
(25,105 missing values generated)
(26,765 real changes made, 26,765 to missing)
(26,765 real changes made, 26,765 to missing)
(26,765 missing values generated)
(0 real changes made)
(26,765 missing values generated)
(26,765 missing values generated)
(28,017 real changes made, 28,017 to missing)
(28,017 real changes made, 28,017 to missing)
(28,017 missing values generated)
(0 real changes made)
(28,017 missing values generated)
(28,017 missing values generated)
(23,200 real changes made, 23,200 to missing)
(23,200 real changes made, 23,200 to missing)
(23,200 missing values generated)
(0 real changes made)
(23,201 missing values generated)
(23,200 missing values generated)
(24,680 real changes made, 24,680 to missing)
(24,680 real changes made, 24,680 to missing)
(24,680 missing values generated)
(0 real changes made)
(24,680 missing values generated)
(24,681 missing values generated)
(26,487 real changes made, 26,487 to missing)
(26,487 real changes made, 26,487 to missing)
(26,487 missing values generated)
(0 real changes made)
(26,488 missing values generated)
(26,488 missing values generated)
(24,322 real changes made, 24,322 to missing)
(24,322 real changes made, 24,322 to missing)
(24,322 missing values generated)
(0 real changes made)
(24,322 missing values generated)
(24,322 missing values generated)
(28,088 real changes made, 28,088 to missing)
(28,088 real changes made, 28,088 to missing)
(28,088 missing values generated)
(0 real changes made)
(28,088 missing values generated)
(28,088 missing values generated)
(29,511 real changes made, 29,511 to missing)
(29,511 real changes made, 29,511 to missing)
(29,511 missing values generated)
(0 real changes made)
(29,511 missing values generated)
(29,511 missing values generated)
(29,378 real changes made, 29,378 to missing)
(29,378 real changes made, 29,378 to missing)
(29,378 missing values generated)
(0 real changes made)
(29,378 missing values generated)
(29,378 missing values generated)

. 
. * Capital gains components over time (selected assets)
. preserve

. keep hhidpn cg_res_* cg_res2_* cg_re_* cg_bus_* cg_ira_* cg_stk_* cg_bnd_* cg_chk_* cg_cd_* cg_veh_* cg_oth
> _*

. reshape long cg_res_ cg_res2_ cg_re_ cg_bus_ cg_ira_ cg_stk_ cg_bnd_ cg_chk_ cg_cd_ cg_veh_ cg_oth_, i(hhid
> pn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                 144   ->   35          
j variable (11 values)                    ->   year
xij variables:
cg_res_2002 cg_res_2004 ... cg_res_2022   ->   cg_res_
cg_res2_2002 cg_res2_2004 ... cg_res2_2022->   cg_res2_
   cg_re_2002 cg_re_2004 ... cg_re_2022   ->   cg_re_
cg_bus_2002 cg_bus_2004 ... cg_bus_2022   ->   cg_bus_
cg_ira_2002 cg_ira_2004 ... cg_ira_2022   ->   cg_ira_
cg_stk_2002 cg_stk_2004 ... cg_stk_2022   ->   cg_stk_
cg_bnd_2002 cg_bnd_2004 ... cg_bnd_2022   ->   cg_bnd_
cg_chk_2002 cg_chk_2004 ... cg_chk_2022   ->   cg_chk_
   cg_cd_2002 cg_cd_2004 ... cg_cd_2022   ->   cg_cd_
cg_veh_2002 cg_veh_2004 ... cg_veh_2022   ->   cg_veh_
cg_oth_2002 cg_oth_2004 ... cg_oth_2022   ->   cg_oth_
-----------------------------------------------------------------------------

. collapse (mean) cg_res_mean=cg_res_ cg_res2_mean=cg_res2_ cg_re_mean=cg_re_ cg_bus_mean=cg_bus_ cg_stk_mean
> =cg_stk_ cg_bnd_mean=cg_bnd_ ///
>     (p50) cg_res_p50=cg_res_ cg_res2_p50=cg_res2_ cg_re_p50=cg_re_ cg_bus_p50=cg_bus_ cg_stk_p50=cg_stk_ cg
> _bnd_p50=cg_bnd_ `wopt', by(year)

. local cg_assets "res res2 re bus stk bnd"

. forvalues i = 1/6 {
  2.     local a : word `i' of `cg_assets'
  3.     local lab = cond("`a'"=="res","Primary residence", ///
>         cond("`a'"=="res2","Secondary residence", ///
>         cond("`a'"=="re","Real estate", ///
>         cond("`a'"=="bus","Business", ///
>         cond("`a'"=="stk","Stocks","Bonds")))))
  4.     twoway line cg_`a'_mean year || line cg_`a'_p50 year, ///
>         title("`lab' capital gains") ///
>         xtitle("Year") ytitle("Capital gains ($)") ylabel(, format(%9.0fc)) ///
>         legend(order(1 "Mean" 2 "Median"))
  5.     graph export "${DESCRIPTIVE}/Figures/cg_`a'_mean_median_by_year.png", replace
  6. }
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_res_mean_median_by_year.png saved as
    PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_res2_mean_median_by_year.png saved as
    PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_re_mean_median_by_year.png saved as
    PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_bus_mean_median_by_year.png saved as
    PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_stk_mean_median_by_year.png saved as
    PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_bnd_mean_median_by_year.png saved as
    PNG format

. restore

. 
. * Zero-share diagnostics for 2022 capital gains (valid asset pairs only)
. preserve

. local y = 2022

. gen double cg_res_`y'_raw  = h16atoth  - h15atoth  if !missing(h16atoth, h15atoth)
(33,066 missing values generated)

. gen double cg_res2_`y'_raw = h16anethb - h15anethb if !missing(h16anethb, h15anethb)
(33,066 missing values generated)

. gen double cg_re_`y'_raw   = h16arles  - h15arles  if !missing(h16arles, h15arles)
(33,066 missing values generated)

. gen double cg_bus_`y'_raw  = h16absns  - h15absns  if !missing(h16absns, h15absns)
(33,066 missing values generated)

. gen double cg_stk_`y'_raw  = h16astck  - h15astck  if !missing(h16astck, h15astck)
(33,066 missing values generated)

. gen double cg_bnd_`y'_raw  = h16abond  - h15abond  if !missing(h16abond, h15abond)
(33,066 missing values generated)

. display "=== 2022 CG zero-share diagnostics (valid pairs only) ==="
=== 2022 CG zero-share diagnostics (valid pairs only) ===

. foreach v in cg_res_`y'_raw cg_res2_`y'_raw cg_re_`y'_raw cg_bus_`y'_raw cg_stk_`y'_raw cg_bnd_`y'_raw {
  2.     quietly count if !missing(`v')
  3.     local nn = r(N)
  4.     quietly count if `v' == 0
  5.     local n0 = r(N)
  6.     di "`v'  zeros=" `n0' "  N(nonmiss)=" `nn' "  zero share=" %6.3f (`n0'/`nn')
  7. }
cg_res_2022_raw  zeros=3628  N(nonmiss)=12168  zero share= 0.298
cg_res2_2022_raw  zeros=10348  N(nonmiss)=12168  zero share= 0.850
cg_re_2022_raw  zeros=10397  N(nonmiss)=12168  zero share= 0.854
cg_bus_2022_raw  zeros=11164  N(nonmiss)=12168  zero share= 0.917
cg_stk_2022_raw  zeros=9317  N(nonmiss)=12168  zero share= 0.766
cg_bnd_2022_raw  zeros=11489  N(nonmiss)=12168  zero share= 0.944

. restore

. 
. * Income components (capital/IRA/total interest) on the same graph
. preserve

. keep hhidpn y_core_inc_* y_ira_inc_* y_total_int_* 

. reshape long y_core_inc_ y_ira_inc_ y_total_int_, i(hhidpn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                  34   ->   5           
j variable (11 values)                    ->   year
xij variables:
y_core_inc_2002 y_core_inc_2004 ... y_core_inc_2022->y_core_inc_
y_ira_inc_2002 y_ira_inc_2004 ... y_ira_inc_2022->y_ira_inc_
y_total_int_2002 y_total_int_2004 ... y_total_int_2022->y_total_int_
-----------------------------------------------------------------------------

. collapse (mean) y_core_inc_=y_core_inc_ y_ira_inc_=y_ira_inc_ y_total_int_=y_total_int_ `wopt', by(year)

. twoway line y_core_inc_ year || line y_ira_inc_ year || line y_total_int_ year, ///
>     title("Mean interest income by year") ///
>     xtitle("Year") ytitle("Mean value ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Capital income (core)" 2 "Retirement income (IRA)" 3 "Total interest income"))

. graph export "${DESCRIPTIVE}/Figures/interest_income_mean_by_year.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/interest_income_mean_by_year.png saved
    as PNG format

. restore

. 
. * Flow measures by asset class on the same graph
. preserve

. keep hhidpn flow_bus_* flow_re_* flow_stk_* flow_ira_* flow_res_*

. reshape long flow_bus_ flow_re_ flow_stk_ flow_ira_ flow_res_, i(hhidpn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                  78   ->   29          
j variable (11 values)                    ->   year
xij variables:
flow_bus_2002 flow_bus_2004 ... flow_bus_2022->flow_bus_
flow_re_2002 flow_re_2004 ... flow_re_2022->   flow_re_
flow_stk_2002 flow_stk_2004 ... flow_stk_2022->flow_stk_
flow_ira_2002 flow_ira_2004 ... flow_ira_2022->flow_ira_
flow_res_2002 flow_res_2004 ... flow_res_2022->flow_res_
-----------------------------------------------------------------------------

. collapse (mean) flow_bus_=flow_bus_ flow_re_=flow_re_ flow_stk_=flow_stk_ flow_ira_=flow_ira_ flow_res_=flo
> w_res_ `wopt', by(year)

. twoway line flow_bus_ year || line flow_re_ year || line flow_stk_ year || line flow_ira_ year || line flow
> _res_ year, ///
>     title("Mean net investment flows by asset class") ///
>     xtitle("Year") ytitle("Mean value ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Business" 2 "Real estate" 3 "Stocks" 4 "IRA" 5 "Residences"))

. graph export "${DESCRIPTIVE}/Figures/flows_by_asset_mean_by_year.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/flows_by_asset_mean_by_year.png saved as
    PNG format

. restore

. 
. * Wealth measures over time (total net, gross, IRA, residential)
. preserve

. keep hhidpn wealth_total_* gross_wealth_* wealth_ira_* wealth_res_*

. reshape long wealth_total_ gross_wealth_ wealth_ira_ wealth_res_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  49   ->   6           
j variable (12 values)                    ->   year
xij variables:
wealth_total_2000 wealth_total_2002 ... wealth_total_2022->wealth_total_
gross_wealth_2000 gross_wealth_2002 ... gross_wealth_2022->gross_wealth_
wealth_ira_2000 wealth_ira_2002 ... wealth_ira_2022->wealth_ira_
wealth_res_2000 wealth_res_2002 ... wealth_res_2022->wealth_res_
-----------------------------------------------------------------------------

. * Means by year (each series uses its own nonmissing sample, like summarize)
. collapse (mean) wealth_total_=wealth_total_ gross_wealth_=gross_wealth_ wealth_ira_=wealth_ira_ wealth_res_
> =wealth_res_ `wopt', by(year)

. display "=== Wealth mean-by-year (series-specific samples) ==="
=== Wealth mean-by-year (series-specific samples) ===

. list year wealth_total_ gross_wealth_ wealth_ira_ wealth_res_, noobs

  +------------------------------------------------------+
  | year   wealth~l_   gross_w~_   wealth~a_   wealth~s_ |
  |------------------------------------------------------|
  | 2000   328447.88   353815.49   49574.505   103901.21 |
  | 2002    348472.8   376071.25   45702.357   121505.09 |
  | 2004    388840.8   428272.91    51155.23   147403.71 |
  | 2006   463311.95   507559.48   65440.559   180491.12 |
  | 2008   466850.48    512875.7   63679.662   183121.68 |
  |------------------------------------------------------|
  | 2010   349232.94   402999.63   55024.233   137531.91 |
  | 2012   349710.37   399533.85    59460.93   132904.11 |
  | 2014   404508.17   452071.01   71500.185   148799.94 |
  | 2016   393224.04   444507.59   69611.764   150211.41 |
  | 2018   477886.48   529734.35   91578.582   179954.81 |
  |------------------------------------------------------|
  | 2020    509648.9   561507.03   106817.44   198761.55 |
  | 2022   584136.73   641892.09   123274.27   247264.86 |
  +------------------------------------------------------+

. twoway line wealth_total_ year || line gross_wealth_ year || line wealth_ira_ year || line wealth_res_ year
> , ///
>     title("Mean wealth by year") ///
>     xtitle("Year") ytitle("Mean wealth ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Total net wealth" 2 "Gross wealth" 3 "Ret. wealth" 4 "Residential wealth"))

. graph export "${DESCRIPTIVE}/Figures/wealth_mean_by_year.png", replace
file /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/wealth_mean_by_year.png
    saved as PNG format

. restore

. 
. * ---------------------------------------------------------------------
. * Participation: share of respondents with non-missing value (0-1), 2002 and 2022
. * Interest income: 4 vars (capital income, pension, SSDI, ret. income). Holdings: capital income + asset ho
> ldings from note.
. * ---------------------------------------------------------------------
. preserve

. foreach yr in 2002 2022 {
  2.     local w = cond(`yr' == 2002, 6, 16)
  3.     * Interest income (4 vars): hicap, ipena, issdi, isret
.     capture confirm variable h`w'icap r`w'ipena r`w'issdi r`w'isret
  4.     if !_rc {
  5.         capture drop p_icap p_ipena p_issdi p_isret
  6.         gen byte p_icap   = !missing(h`w'icap)
  7.         gen byte p_ipena  = !missing(r`w'ipena)
  8.         gen byte p_issdi  = !missing(r`w'issdi)
  9.         gen byte p_isret  = !missing(r`w'isret)
 10.         graph bar (mean) p_icap p_ipena p_issdi p_isret, ///
>             bar(1, color(navy)) bar(2, color(maroon)) bar(3, color(orange)) bar(4, color(green)) ///
>             title("Participation: interest income (`yr')") ///
>             ytitle("Share with non-missing") ylabel(0(0.2)1, format(%3.2f)) ///
>             legend(label(1 "Capital income") label(2 "Pension") label(3 "Social security") label(4 "Ret. in
> come") ///
>                    cols(2) size(small) position(6) ring(0) region(lstyle(none))) ///
>             ysize(4) xsize(5.5)
 11.         graph export "${DESCRIPTIVE}/Figures/participation_interest_income_`yr'.png", replace
 12.         drop p_icap p_ipena p_issdi p_isret
 13.     }
 14.     * Holdings: asset values only from note (Primary res, Secondary res, Real estate, Business, IRA, Sto
> cks, Bonds, Checking) â€” wave-specific
.     capture confirm variable h`w'atoth h`w'anethb h`w'arles h`w'absns h`w'aira h`w'astck h`w'abond h`w'achc
> k
 15.     if !_rc {
 16.         capture drop p_atoth p_anethb p_arles p_absns p_aira p_astck p_abond p_achck
 17.         gen byte p_atoth  = !missing(h`w'atoth)
 18.         gen byte p_anethb = !missing(h`w'anethb)
 19.         gen byte p_arles  = !missing(h`w'arles)
 20.         gen byte p_absns  = !missing(h`w'absns)
 21.         gen byte p_aira   = !missing(h`w'aira)
 22.         gen byte p_astck  = !missing(h`w'astck)
 23.         gen byte p_abond  = !missing(h`w'abond)
 24.         gen byte p_achck  = !missing(h`w'achck)
 25.         graph bar (mean) p_atoth p_anethb p_arles p_absns p_aira p_astck p_abond p_achck, ///
>             bar(1, color(navy)) bar(2, color(maroon)) bar(3, color(orange)) bar(4, color(green)) bar(5, col
> or(teal)) ///
>             bar(6, color(cyan)) bar(7, color(blue)) bar(8, color(lavender)) ///
>             title("Participation: holdings (`yr')") ///
>             ytitle("Share with non-missing") ylabel(0(0.2)1, format(%3.2f)) ///
>             legend(order(1 "Primary res" 2 "Secondary res" 3 "Real estate" 4 "Business" ///
>                 5 "IRA" 6 "Stocks" 7 "Bonds" 8 "Checking") cols(2) size(small) position(6) ring(0) region(l
> style(none))) ///
>             ysize(4) xsize(7)
 26.         graph export "${DESCRIPTIVE}/Figures/participation_holdings_`yr'.png", replace
 27.         drop p_atoth p_anethb p_arles p_absns p_aira p_astck p_abond p_achck
 28.     }
 29. }
I/O error writing .dta file
    Usually such I/O errors are caused by the disk or file system being full.
r(693);

end of do-file

r(693);

