---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/07_des
> criptive_returns.log
  log type:  text
 opened on:  17 Feb 2026, 16:21:01

. 
. capture mkdir "${DESCRIPTIVE}"

. capture mkdir "${DESCRIPTIVE}/Figures"

. capture mkdir "${DESCRIPTIVE}/Tables"

. 
. * ---------------------------------------------------------------------
. * Part A: Components, flows, incomes, wealth, debt (from all_data_merged)
. * ---------------------------------------------------------------------
. use "${CLEANED}/all_data_merged.dta", clear

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Build wealth_total_YYYY (net), gross_wealth_YYYY, wealth_ira_YYYY, wealth_res
> _YYYY
. local years "2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. forvalues w = 5/16 {
  2.     local y = 1990 + (2*`w')
  3.     capture confirm variable h`w'atotb
  4.     if !_rc {
  5.         capture drop wealth_total_`y' gross_wealth_`y'
  6.         capture drop _gross_n_`y' _debt_total_`y' _debt_n_`y'
  7.         egen byte _gross_n_`y' = rownonmiss(h`w'atoth h`w'anethb h`w'arles h
> `w'atran h`w'absns h`w'aira h`w'astck h`w'achck h`w'acd h`w'abond h`w'aothr)
  8.         egen byte _debt_n_`y' = rownonmiss(h`w'amort h`w'ahmln h`w'adebt)
  9.         gen double _debt_total_`y' = ///
>             max(h`w'amort,0) + max(h`w'ahmln,0) + max(h`w'adebt,0)
 10.         replace _debt_total_`y' = . if _debt_n_`y' == 0
 11.         gen double gross_wealth_`y' = ///
>             max(h`w'atoth,0) + max(h`w'anethb,0) + max(h`w'arles,0) + max(h`w'a
> tran,0) + ///
>             max(h`w'absns,0) + max(h`w'aira,0) + max(h`w'astck,0) + max(h`w'ach
> ck,0) + ///
>             max(h`w'acd,0) + max(h`w'abond,0) + max(h`w'aothr,0)
 12.         replace gross_wealth_`y' = . if _gross_n_`y' == 0
 13.         gen double wealth_total_`y' = gross_wealth_`y' - _debt_total_`y'
 14.         replace wealth_total_`y' = . if _gross_n_`y' == 0 & _debt_n_`y' == 0
 15.     }
 16.     capture confirm variable h`w'aira
 17.     if !_rc {
 18.         capture drop wealth_ira_`y'
 19.         gen double wealth_ira_`y' = h`w'aira
 20.     }
 21.     capture confirm variable h`w'atoth h`w'anethb
 22.     if !_rc {
 23.         capture drop wealth_res_`y'
 24.         gen double wealth_res_`y' = h`w'atoth + h`w'anethb if !missing(h`w'a
> toth) & !missing(h`w'anethb)
 25.     }
 26.     * Core wealth (re+bus+stk+bond+chck+cd) and Core+ret. for mean-by-year g
> raph
.     capture confirm variable h`w'arles h`w'absns h`w'astck h`w'abond h`w'achck 
> h`w'acd
 27.     if !_rc {
 28.         capture drop wealth_core_`y'
 29.         gen double wealth_core_`y' = max(h`w'arles,0)+max(h`w'absns,0)+max(h
> `w'astck,0)+max(h`w'abond,0)+max(h`w'achck,0)+max(h`w'acd,0) if !missing(h`w'ar
> les) & !missing(h`w'absns) & !missing(h`w'astck) & !missing(h`w'abond) & !missi
> ng(h`w'achck) & !missing(h`w'acd)
 30.         capture drop wealth_coreira_`y'
 31.         gen double wealth_coreira_`y' = wealth_core_`y' + wealth_ira_`y' if 
> !missing(wealth_core_`y') & !missing(wealth_ira_`y')
 32.     }
 33. }
(25,656 real changes made, 25,656 to missing)
(25,656 real changes made, 25,656 to missing)
(25,656 missing values generated)
(0 real changes made)
(25,656 missing values generated)
(25,656 missing values generated)
(25,657 missing values generated)
(25,657 missing values generated)
(27,069 real changes made, 27,069 to missing)
(27,069 real changes made, 27,069 to missing)
(27,069 missing values generated)
(0 real changes made)
(27,069 missing values generated)
(27,069 missing values generated)
(27,069 missing values generated)
(27,069 missing values generated)
(25,105 real changes made, 25,105 to missing)
(25,105 real changes made, 25,105 to missing)
(25,105 missing values generated)
(0 real changes made)
(25,105 missing values generated)
(25,105 missing values generated)
(25,113 missing values generated)
(25,113 missing values generated)
(26,765 real changes made, 26,765 to missing)
(26,765 real changes made, 26,765 to missing)
(26,765 missing values generated)
(0 real changes made)
(26,765 missing values generated)
(26,765 missing values generated)
(26,769 missing values generated)
(26,769 missing values generated)
(28,017 real changes made, 28,017 to missing)
(28,017 real changes made, 28,017 to missing)
(28,017 missing values generated)
(0 real changes made)
(28,017 missing values generated)
(28,017 missing values generated)
(28,017 missing values generated)
(28,017 missing values generated)
(23,200 real changes made, 23,200 to missing)
(23,200 real changes made, 23,200 to missing)
(23,200 missing values generated)
(0 real changes made)
(23,201 missing values generated)
(23,200 missing values generated)
(23,206 missing values generated)
(23,207 missing values generated)
(24,680 real changes made, 24,680 to missing)
(24,680 real changes made, 24,680 to missing)
(24,680 missing values generated)
(0 real changes made)
(24,680 missing values generated)
(24,681 missing values generated)
(24,682 missing values generated)
(24,682 missing values generated)
(26,487 real changes made, 26,487 to missing)
(26,487 real changes made, 26,487 to missing)
(26,487 missing values generated)
(0 real changes made)
(26,488 missing values generated)
(26,488 missing values generated)
(26,488 missing values generated)
(26,489 missing values generated)
(24,322 real changes made, 24,322 to missing)
(24,322 real changes made, 24,322 to missing)
(24,322 missing values generated)
(0 real changes made)
(24,322 missing values generated)
(24,322 missing values generated)
(24,326 missing values generated)
(24,326 missing values generated)
(28,088 real changes made, 28,088 to missing)
(28,088 real changes made, 28,088 to missing)
(28,088 missing values generated)
(0 real changes made)
(28,088 missing values generated)
(28,088 missing values generated)
(28,091 missing values generated)
(28,091 missing values generated)
(29,511 real changes made, 29,511 to missing)
(29,511 real changes made, 29,511 to missing)
(29,511 missing values generated)
(0 real changes made)
(29,511 missing values generated)
(29,511 missing values generated)
(29,512 missing values generated)
(29,512 missing values generated)
(29,378 real changes made, 29,378 to missing)
(29,378 real changes made, 29,378 to missing)
(29,378 missing values generated)
(0 real changes made)
(29,378 missing values generated)
(29,378 missing values generated)
(29,384 missing values generated)
(29,384 missing values generated)

. 
. * Capital gains components over time (selected assets)
. preserve

. keep hhidpn cg_res_* cg_res2_* cg_re_* cg_bus_* cg_ira_* cg_stk_* cg_bnd_* cg_c
> hk_* cg_cd_* cg_veh_* cg_oth_*

. reshape long cg_res_ cg_res2_ cg_re_ cg_bus_ cg_ira_ cg_stk_ cg_bnd_ cg_chk_ cg
> _cd_ cg_veh_ cg_oth_, i(hhidpn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                 144   ->   35          
j variable (11 values)                    ->   year
xij variables:
cg_res_2002 cg_res_2004 ... cg_res_2022   ->   cg_res_
cg_res2_2002 cg_res2_2004 ... cg_res2_2022->   cg_res2_
   cg_re_2002 cg_re_2004 ... cg_re_2022   ->   cg_re_
cg_bus_2002 cg_bus_2004 ... cg_bus_2022   ->   cg_bus_
cg_ira_2002 cg_ira_2004 ... cg_ira_2022   ->   cg_ira_
cg_stk_2002 cg_stk_2004 ... cg_stk_2022   ->   cg_stk_
cg_bnd_2002 cg_bnd_2004 ... cg_bnd_2022   ->   cg_bnd_
cg_chk_2002 cg_chk_2004 ... cg_chk_2022   ->   cg_chk_
   cg_cd_2002 cg_cd_2004 ... cg_cd_2022   ->   cg_cd_
cg_veh_2002 cg_veh_2004 ... cg_veh_2022   ->   cg_veh_
cg_oth_2002 cg_oth_2004 ... cg_oth_2022   ->   cg_oth_
-----------------------------------------------------------------------------

. collapse (mean) cg_res_mean=cg_res_ cg_res2_mean=cg_res2_ cg_re_mean=cg_re_ cg_
> bus_mean=cg_bus_ cg_stk_mean=cg_stk_ cg_bnd_mean=cg_bnd_ ///
>     (p50) cg_res_p50=cg_res_ cg_res2_p50=cg_res2_ cg_re_p50=cg_re_ cg_bus_p50=c
> g_bus_ cg_stk_p50=cg_stk_ cg_bnd_p50=cg_bnd_ `wopt', by(year)

. local cg_assets "res res2 re bus stk bnd"

. forvalues i = 1/6 {
  2.     local a : word `i' of `cg_assets'
  3.     local lab = cond("`a'"=="res","Primary residence", ///
>         cond("`a'"=="res2","Secondary residence", ///
>         cond("`a'"=="re","Real estate", ///
>         cond("`a'"=="bus","Business", ///
>         cond("`a'"=="stk","Stocks","Bonds")))))
  4.     twoway line cg_`a'_mean year || line cg_`a'_p50 year, ///
>         title("`lab' capital gains") ///
>         xtitle("Year") ytitle("Capital gains ($)") ylabel(, format(%9.0fc)) ///
>         legend(order(1 "Mean" 2 "Median"))
  5.     graph export "${DESCRIPTIVE}/Figures/cg_`a'_mean_median_by_year.png", re
> place
  6. }
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_res_mean_
    > median_by_year.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_res2_mean
    > _median_by_year.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_re_mean_m
    > edian_by_year.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_bus_mean_
    > median_by_year.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_stk_mean_
    > median_by_year.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/cg_bnd_mean_
    > median_by_year.png saved as PNG format

. restore

. 
. * Zero-share diagnostics for 2022 capital gains (valid asset pairs only)
. preserve

. local y = 2022

. gen double cg_res_`y'_raw  = h16atoth  - h15atoth  if !missing(h16atoth, h15ato
> th)
(33,066 missing values generated)

. gen double cg_res2_`y'_raw = h16anethb - h15anethb if !missing(h16anethb, h15an
> ethb)
(33,066 missing values generated)

. gen double cg_re_`y'_raw   = h16arles  - h15arles  if !missing(h16arles, h15arl
> es)
(33,066 missing values generated)

. gen double cg_bus_`y'_raw  = h16absns  - h15absns  if !missing(h16absns, h15abs
> ns)
(33,066 missing values generated)

. gen double cg_stk_`y'_raw  = h16astck  - h15astck  if !missing(h16astck, h15ast
> ck)
(33,066 missing values generated)

. gen double cg_bnd_`y'_raw  = h16abond  - h15abond  if !missing(h16abond, h15abo
> nd)
(33,066 missing values generated)

. display "=== 2022 CG zero-share diagnostics (valid pairs only) ==="
=== 2022 CG zero-share diagnostics (valid pairs only) ===

. foreach v in cg_res_`y'_raw cg_res2_`y'_raw cg_re_`y'_raw cg_bus_`y'_raw cg_stk
> _`y'_raw cg_bnd_`y'_raw {
  2.     quietly count if !missing(`v')
  3.     local nn = r(N)
  4.     quietly count if `v' == 0
  5.     local n0 = r(N)
  6.     di "`v'  zeros=" `n0' "  N(nonmiss)=" `nn' "  zero share=" %6.3f (`n0'/`
> nn')
  7. }
cg_res_2022_raw  zeros=3628  N(nonmiss)=12168  zero share= 0.298
cg_res2_2022_raw  zeros=10348  N(nonmiss)=12168  zero share= 0.850
cg_re_2022_raw  zeros=10397  N(nonmiss)=12168  zero share= 0.854
cg_bus_2022_raw  zeros=11164  N(nonmiss)=12168  zero share= 0.917
cg_stk_2022_raw  zeros=9317  N(nonmiss)=12168  zero share= 0.766
cg_bnd_2022_raw  zeros=11489  N(nonmiss)=12168  zero share= 0.944

. restore

. 
. * Income components (capital/IRA/total interest) on the same graph
. preserve

. keep hhidpn y_core_inc_* y_ira_inc_* y_total_int_* 

. reshape long y_core_inc_ y_ira_inc_ y_total_int_, i(hhidpn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                  34   ->   5           
j variable (11 values)                    ->   year
xij variables:
y_core_inc_2002 y_core_inc_2004 ... y_core_inc_2022->y_core_inc_
y_ira_inc_2002 y_ira_inc_2004 ... y_ira_inc_2022->y_ira_inc_
y_total_int_2002 y_total_int_2004 ... y_total_int_2022->y_total_int_
-----------------------------------------------------------------------------

. collapse (mean) y_core_inc_=y_core_inc_ y_ira_inc_=y_ira_inc_ y_total_int_=y_to
> tal_int_ `wopt', by(year)

. twoway line y_core_inc_ year || line y_ira_inc_ year || line y_total_int_ year,
>  ///
>     title("Mean interest income by year") ///
>     xtitle("Year") ytitle("Mean value ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Capital income (core)" 2 "Retirement income (IRA)" 3 "Total
>  interest income"))

. graph export "${DESCRIPTIVE}/Figures/interest_income_mean_by_year.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/interest_inc
    > ome_mean_by_year.png saved as PNG format

. restore

. 
. * Flow measures by asset class on the same graph
. preserve

. keep hhidpn flow_bus_* flow_re_* flow_stk_* flow_ira_* flow_res_*

. reshape long flow_bus_ flow_re_ flow_stk_ flow_ira_ flow_res_, i(hhidpn) j(year
> )
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                  78   ->   29          
j variable (11 values)                    ->   year
xij variables:
flow_bus_2002 flow_bus_2004 ... flow_bus_2022->flow_bus_
flow_re_2002 flow_re_2004 ... flow_re_2022->   flow_re_
flow_stk_2002 flow_stk_2004 ... flow_stk_2022->flow_stk_
flow_ira_2002 flow_ira_2004 ... flow_ira_2022->flow_ira_
flow_res_2002 flow_res_2004 ... flow_res_2022->flow_res_
-----------------------------------------------------------------------------

. collapse (mean) flow_bus_=flow_bus_ flow_re_=flow_re_ flow_stk_=flow_stk_ flow_
> ira_=flow_ira_ flow_res_=flow_res_ `wopt', by(year)

. twoway line flow_bus_ year || line flow_re_ year || line flow_stk_ year || line
>  flow_ira_ year || line flow_res_ year, ///
>     title("Mean net investment flows by asset class") ///
>     xtitle("Year") ytitle("Mean value ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Business" 2 "Real estate" 3 "Stocks" 4 "IRA" 5 "Residences"
> ))

. graph export "${DESCRIPTIVE}/Figures/flows_by_asset_mean_by_year.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/flows_by_ass
    > et_mean_by_year.png saved as PNG format

. restore

. 
. * Wealth measures over time: (1) components = core, IRA, residential; (2) aggre
> gated = core, Core+ret., net wealth
. preserve

. keep hhidpn wealth_total_* wealth_core_* wealth_ira_* wealth_res_* wealth_corei
> ra_*

. reshape long wealth_total_ wealth_core_ wealth_ira_ wealth_res_ wealth_coreira_
> , i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  61   ->   7           
j variable (12 values)                    ->   year
xij variables:
wealth_total_2000 wealth_total_2002 ... wealth_total_2022->wealth_total_
wealth_core_2000 wealth_core_2002 ... wealth_core_2022->wealth_core_
wealth_ira_2000 wealth_ira_2002 ... wealth_ira_2022->wealth_ira_
wealth_res_2000 wealth_res_2002 ... wealth_res_2022->wealth_res_
wealth_coreira_2000 wealth_coreira_2002 ... wealth_coreira_2022->wealth_coreira_
-----------------------------------------------------------------------------

. * Means by year (each series uses its own nonmissing sample)
. collapse (mean) wealth_total_=wealth_total_ wealth_core_=wealth_core_ wealth_ir
> a_=wealth_ira_ wealth_res_=wealth_res_ wealth_coreira_=wealth_coreira_ `wopt', 
> by(year)

. display "=== Wealth mean-by-year (series-specific samples) ==="
=== Wealth mean-by-year (series-specific samples) ===

. list year wealth_total_ wealth_core_ wealth_ira_ wealth_res_ wealth_coreira_, n
> oobs

  +------------------------------------------------------------------+
  | year   wealth~l_   wealth~e_   wea~_ira_   wealth~s_   wea~eira_ |
  |------------------------------------------------------------------|
  | 2000    330145.7   177296.73   49574.505   103901.21   226873.77 |
  | 2002   350089.58   177262.17   45702.357   121505.09   222964.53 |
  | 2004   391123.84   201680.91    51155.23   147403.71   252856.48 |
  | 2006   465798.04   229978.73   65440.559   180491.12   295433.47 |
  | 2008   469832.96   235889.95   63679.662   183121.68   299569.61 |
  |------------------------------------------------------------------|
  | 2010   352433.67   179731.42   55024.233   137531.91   234778.78 |
  | 2012    352816.2   179460.28    59460.93   132904.11   238926.99 |
  | 2014   407923.46   203843.02   71500.185   148799.94   275357.81 |
  | 2016   396287.29      197635   69611.764   150211.41   267260.02 |
  | 2018   481012.47   223660.75   91578.582   179954.81   315255.35 |
  |------------------------------------------------------------------|
  | 2020   512349.05    223228.5   106817.44   198761.55   330052.74 |
  | 2022    586614.8   233903.32   123274.27   247264.86   357224.26 |
  +------------------------------------------------------------------+

. * Components: core, IRA, residential
. twoway line wealth_core_ year || line wealth_ira_ year || line wealth_res_ year
> , ///
>     title("Mean wealth by year (components)") ///
>     xtitle("Year") ytitle("Mean wealth ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Core" 2 "Retirement (IRA)" 3 "Residential"))

. graph export "${DESCRIPTIVE}/Figures/wealth_mean_by_year_components.png", repla
> ce
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/wealth_mean_
    > by_year_components.png saved as PNG format

. * Aggregated: core, Core+ret., net wealth
. twoway line wealth_core_ year || line wealth_coreira_ year || line wealth_total
> _ year, ///
>     title("Mean wealth by year (aggregated)") ///
>     xtitle("Year") ytitle("Mean wealth ($)") ylabel(, format(%9.0fc)) ///
>     legend(order(1 "Core" 2 "Core+ret." 3 "Net wealth"))

. graph export "${DESCRIPTIVE}/Figures/wealth_mean_by_year_agg.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/wealth_mean_
    > by_year_agg.png saved as PNG format

. restore

. 
. * ---------------------------------------------------------------------
. * Part B: Returns (from analysis_ready_processed)
. * ---------------------------------------------------------------------
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Returns list (waves + averages) â€” r1 core, r2 retirement, r3 residential, r4 
> Core+ret., r5 net wealth
. local years "2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. local retvars ""

. foreach y of local years {
  2.     foreach v in r1_annual_`y' r2_annual_`y' r3_annual_`y' r4_annual_`y' r5_
> annual_`y' {
  3.         capture confirm variable `v'
  4.         if !_rc {
  5.             local retvars "`retvars' `v'"
  6.         }
  7.     }
  8. }

. foreach v in r1_annual_avg r2_annual_avg r3_annual_avg r4_annual_avg r5_annual_
> avg {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local retvars "`retvars' `v'"
  5.     }
  6. }

. 
. * Tabstat for final return measures (unwinsorized)
. display "=== Return measures tabstat (unwinsorized) ==="
=== Return measures tabstat (unwinsorized) ===

. tabstat `retvars' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13839      6934     13566      6713     14222     12995      6427
    Mean |  .3396622  .1886169  .1090722  .1307731   .184071  .3029203  .3083907
      SD |  1.541005  1.047375  .5250122  .6565495  .6265629  1.425314  1.182581
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036  .0164603  .0787754  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  31.90998  16.79725  10.78983  10.79102  14.16723  25.46074  23.66292
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12697      6230     13378     14147      7247     13772      6970
    Mean |  .1063545  .1851812  .1934519  .3239473  .3262825  .1479926  .1959171
      SD |  .5481141  .6781613  .5842016   1.65343  1.302864  .5879566  .6819433
      p1 |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
      p5 | -.5451412 -.4799117  -.397324 -.9483774        -1 -.5327307 -.5387344
     p50 |  .0595106  .0654357  .0955441    .02053  .0996786  .0940058  .0821008
     p95 |  .7507762  1.227771  1.076938  2.403116  1.966479  .8641539  1.289254
     p99 |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  10.61895  15.65697  11.12834  69.89464  20.25135  25.27468  10.50237
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14325     13155      6735     12823      6496     13311     11929
    Mean |  .2379549  .3333812  .2615255  .0191759  .1597092   .143163  .2243223
      SD |  .6682234  1.586558  1.017483   .464199  .6429026  .5829101  1.549668
      p1 | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
      p5 | -.4169048 -.9728337        -1 -.5686689 -.5368095 -.4558613        -1
     p50 |  .1182693  .0074907  .0602312         0  .0477834  .0467583 -.0526641
     p95 |  1.196941  2.605551  1.923765  .5811388  1.168572  .9966639  2.278028
     p99 |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  14.88412  24.93995  13.09965  8.354143  7.647382  13.60593   30.6291
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6129     11528      5926     11929     14018      7136     13705
    Mean |  .2312687 -.0333831  .0935677  .1020659  .2596012  .2308468  .0174181
      SD |  1.086622  .4485891  .5855996   .774325  1.478589  1.170044   .532927
      p1 |        -1        -1   -.78236 -.7937624        -1        -1        -1
      p5 | -.8267949 -.7113249 -.5530107 -.4892756        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0052885  .0018197         0  .0369716         0
     p95 |  1.910762  .5374122  1.003842  .9832947  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  18.19091  6.905694  7.127139  38.86622  32.21445  23.73228  7.732125
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |      6785     14119     12536      6358     12496      5995     13108
    Mean |  .1159706  .1497033   .335425  .2840321  .0870768  .1730203    .20282
      SD |  .5818238  .6961885  1.675398  1.183632  .5695118  .6421902  .6821051
      p1 | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
      p5 | -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0354307  .0381487  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  1.054829  1.074333  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  8.007892  15.16014   53.0643  19.52766  10.63329   11.4638  16.48519
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11136      5709     11131      5431     11759     11127      5584
    Mean |  .3009084  .2866775  .0837633  .1576778  .2101002  .3332256  .2998575
      SD |   1.59319  1.235879  .5333981  .6894531  .7109116  1.850102  1.457984
      p1 |        -1        -1        -1  -.872792  -.831225        -1        -1
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546        -1        -1
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  29.41156  14.40202  9.148892  17.27344  13.91854  69.73189   58.4359
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11342      5278     11881      9539      4966      9911      4674
    Mean |   .104337  .1756961  .2274402  .3558075  .2642764  .1003054   .145126
      SD |  .5772518  .6775247  .8503276   1.64541  1.230544  .5717823  .6135485
      p1 |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
      p5 | -.6358617 -.5635265 -.4916469        -1        -1 -.5948098 -.5397827
     p50 |  .0508033  .0707762  .0933268  .0319569  .0421834  .0488088  .0438695
     p95 |  .8257419  1.263184  1.342823    2.8735  2.134042  .7888544  1.186608
     p99 |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |    11.498  17.07862  52.74273  28.18904   21.9638  14.09967  7.063589
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann~g
---------+----------------------------------------------------------------------
       N |     10424      8330      4431      8523      4152      9190     27784
    Mean |  .2183637  .3785716  .3445914  .2032635   .200118  .3198696   .256425
      SD |  .7286876  1.836335  1.412149  .6688735  .7291838  .8504767  1.070319
      p1 | -.7730061        -1        -1        -1 -.8203947 -.7842487        -1
      p5 | -.4683276        -1 -.8036039 -.5690029 -.5210837 -.4271745        -1
     p50 |   .076495  .0382838  .0887893  .1319231   .081766  .1544909  .1139262
     p95 |  1.358543  2.751666  1.974895  1.009975  1.202837   1.58457  1.766544
     p99 |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437  4.221698
     Min |        -1        -1        -1        -1        -1        -1        -1
     Max |  26.14854  41.09515  24.23998  12.82027  13.01873  19.67032  26.80398
--------------------------------------------------------------------------------

   Stats |  r2_ann~g  r3_ann~g  r4_ann~g  r5_ann~g
---------+----------------------------------------
       N |     15130     25975     14548     28378
    Mean |  .2003307  .0566878  .1467673   .219458
      SD |  .8406199  .4089999  .5165544  .5162117
      p1 |        -1        -1 -.9247556 -.7674735
      p5 |        -1 -.6348516 -.5162661 -.3306088
     p50 |  .1155588  .0598376  .0958943  .1222377
     p95 |  1.458741  .5475788  .8874586  1.029693
     p99 |  2.872983  1.326594  1.988103  2.112304
     Min |        -1        -1        -1        -1
     Max |  16.80075  10.78983  13.01873  13.45894
--------------------------------------------------

. 
. * Winsorized return vars (r*_annual_win_YYYY) when present
. local retwinvars ""

. foreach y of local years {
  2.     foreach r in 1 2 3 4 5 {
  3.         capture confirm variable r`r'_annual_win_`y'
  4.         if !_rc local retwinvars "`retwinvars' r`r'_annual_win_`y'"
  5.     }
  6. }

. if "`retwinvars'" != "" {
.     display "=== Return measures tabstat (winsorized, all years) ==="
=== Return measures tabstat (winsorized, all years) ===
.     tabstat `retwinvars' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min max
> )

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     13839      6934     13566      6713     14222     12995      6427
    Mean |  .3011539  .1634941  .0953002  .1158142  .1684074  .2668898  .2754771
      SD |  1.239727  .8549975  .4179342  .5475666  .5020858   1.13311   .901556
      p1 |        -1        -1        -1 -.8113064 -.6937918        -1        -1
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791 -.9086369 -.7999173
     p50 |  .0079683         0  .0660036  .0164603  .0787754  .0157756  .0709268
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154  2.464102  2.002999
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
     Min |        -1        -1        -1 -.8113064 -.6937918        -1        -1
     Max |  6.870338  4.196152  1.966479  2.508917  2.675682   6.20243  4.682331
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     12697      6230     13378     14147      7247     13772      6970
    Mean |  .0889824  .1704482  .1799437   .278753  .2854054  .1323946  .1798595
      SD |  .4139833  .5460955  .4729423  1.206663  .9537506  .4384954  .5542911
      p1 |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
      p5 | -.5451412 -.4799117  -.397324 -.9483774        -1 -.5327307 -.5387344
     p50 |  .0595106  .0654357  .0955441    .02053  .0996786  .0940058  .0821008
     p95 |  .7507762  1.227771  1.076938  2.403116  1.966479  .8641539  1.289254
     p99 |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
     Min |        -1 -.7609543  -.677244        -1        -1        -1 -.8039658
     Max |  1.910959  2.631804  2.427754  6.877563  5.449806         2  2.572623
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..
---------+----------------------------------------------------------------------
       N |     14325     13155      6735     12823      6496     13311     11929
    Mean |  .2223367  .2912837  .2457926  .0065366  .1496728  .1309695   .179421
      SD |  .5425705  1.275345  .9171129  .3737956  .5669265   .477685  1.175284
      p1 | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
      p5 | -.4169048 -.9728337        -1 -.5686689 -.5368095 -.4558613        -1
     p50 |  .1182693  .0074907  .0602312         0  .0477834  .0467583 -.0526641
     p95 |  1.196941  2.605551  1.923765  .5811388  1.168572  .9966639  2.278028
     p99 |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
     Min | -.7104068        -1        -1        -1 -.7961735  -.728433        -1
     Max |  2.840652  7.103497  4.800067  1.645751  2.958517  2.399934   6.64635
--------------------------------------------------------------------------------

   Stats |  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..
---------+----------------------------------------------------------------------
       N |      6129     11528      5926     11929     14018      7136     13705
    Mean |  .2099511 -.0454634  .0821969  .0825397   .220547  .2007094  .0024621
      SD |  .9321084  .3669636  .5004744  .4816109  1.168684  .9233212  .4188875
      p1 |        -1        -1   -.78236 -.7937624        -1        -1        -1
      p5 | -.8267949 -.7113249 -.5530107 -.4892756        -1        -1 -.6600654
     p50 |  .0166924 -.0398133  .0052885  .0018197         0  .0369716         0
     p95 |  1.910762  .5374122  1.003842  .9832947  2.397546  1.898196  .6457015
     p99 |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
     Min |        -1        -1   -.78236 -.7937624        -1        -1        -1
     Max |  5.125684   1.44949  2.430641  2.355794  6.472728   4.91608  2.056931
--------------------------------------------------------------------------------

   Stats |  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+----------------------------------------------------------------------
       N |      6785     14119     12536      6358     12496      5995     13108
    Mean |  .1057823  .1307248  .2908527   .256128   .070085  .1619814  .1890789
      SD |  .5106501  .5258028  1.246577  .9634451  .4474334  .5554295  .5550473
      p1 | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
      p5 | -.5735529 -.4960107        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0354307  .0381487  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  1.054829  1.074333  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
     Min | -.8756493 -.8068895        -1        -1        -1  -.839531 -.7965277
     Max |  2.367306  2.760476         7  5.403124  2.162278  2.785142  3.017123
--------------------------------------------------------------------------------

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..
---------+----------------------------------------------------------------------
       N |     11136      5709     11131      5431     11759     11127      5584
    Mean |   .257207   .261529  .0702787  .1394711  .1930497  .2796762  .2627762
      SD |  1.253791  1.059876   .439928  .5358224  .5728341  1.289207  1.023494
      p1 |        -1        -1        -1  -.872792  -.831225        -1        -1
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546        -1        -1
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494  .0067374  .0613111
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137  2.676955  2.162278
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
     Min |        -1        -1        -1  -.872792  -.831225        -1        -1
     Max |  6.937254  6.117423  2.117991  2.494468  3.010855  7.017027  5.831301
--------------------------------------------------------------------------------

   Stats |  r3_ann..  r4_ann..  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..
---------+----------------------------------------------------------------------
       N |     11342      5278     11881      9539      4966      9911      4674
    Mean |   .087912  .1652487  .2080546  .3174164   .233656  .0845597  .1326769
      SD |  .4541565  .5780907  .5856326  1.348276  .9766672  .4450098  .5279058
      p1 |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
      p5 | -.6358617 -.5635265 -.4916469        -1        -1 -.5948098 -.5397827
     p50 |  .0508033  .0707762  .0933268  .0319569  .0421834  .0488088  .0438695
     p95 |  .8257419  1.263184  1.342823    2.8735  2.134042  .7888544  1.186608
     p99 |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
     Min |        -1 -.8559418 -.8168963        -1        -1        -1 -.7833597
     Max |  2.229795   2.97907  3.032204  7.575514  5.287554  2.162278  2.489861
--------------------------------------------------------------------------------

   Stats |  r5_ann..  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+------------------------------------------------------------
       N |     10424      8330      4431      8523      4152      9190
    Mean |  .2050545  .3241761  .3007727  .1843175  .1805164  .2987002
      SD |  .5951951  1.356852  1.041758  .5070959   .570291  .6613798
      p1 | -.7730061        -1        -1        -1 -.8203947 -.7842487
      p5 | -.4683276        -1 -.8036039 -.5690029 -.5210837 -.4271745
     p50 |   .076495  .0382838  .0887893  .1319231   .081766  .1544909
     p95 |  1.358543  2.751666  1.974895  1.009975  1.202837   1.58457
     p99 |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437
     Min | -.7730061        -1        -1        -1 -.8203947 -.7842487
     Max |  3.106588  7.660254  6.271499  2.546681     2.833  3.610437
----------------------------------------------------------------------
.     display "=== Return measures tabstat (winsorized) by year ==="
=== Return measures tabstat (winsorized) by year ===
.     foreach y of local years {
  2.         local win_yr ""
  3.         foreach r in 1 2 3 4 5 {
  4.             capture confirm variable r`r'_annual_win_`y'
  5.             if !_rc local win_yr "`win_yr' r`r'_annual_win_`y'"
  6.         }
  7.         if "`win_yr'" != "" {
  8.             display "--- Year `y' (winsorized) ---"
  9.             tabstat `win_yr' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 
> min max)
 10.         }
 11.     }
--- Year 2002 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     13839      6934     13566      6713     14222
    Mean |  .3011539  .1634941  .0953002  .1158142  .1684074
      SD |  1.239727  .8549975  .4179342  .5475666  .5020858
      p1 |        -1        -1        -1 -.8113064 -.6937918
      p5 | -.8911069        -1 -.5302583 -.5623271 -.4260791
     p50 |  .0079683         0  .0660036  .0164603  .0787754
     p95 |  2.649658  1.823048  .7460757  1.196811  1.081154
     p99 |  6.870338  4.196152  1.966479  2.508917  2.675682
     Min |        -1        -1        -1 -.8113064 -.6937918
     Max |  6.870338  4.196152  1.966479  2.508917  2.675682
------------------------------------------------------------
--- Year 2004 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     12995      6427     12697      6230     13378
    Mean |  .2668898  .2754771  .0889824  .1704482  .1799437
      SD |   1.13311   .901556  .4139833  .5460955  .4729423
      p1 |        -1        -1        -1 -.7609543  -.677244
      p5 | -.9086369 -.7999173 -.5451412 -.4799117  -.397324
     p50 |  .0157756  .0709268  .0595106  .0654357  .0955441
     p95 |  2.464102  2.002999  .7507762  1.227771  1.076938
     p99 |   6.20243  4.682331  1.910959  2.631804  2.427754
     Min |        -1        -1        -1 -.7609543  -.677244
     Max |   6.20243  4.682331  1.910959  2.631804  2.427754
------------------------------------------------------------
--- Year 2006 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     14147      7247     13772      6970     14325
    Mean |   .278753  .2854054  .1323946  .1798595  .2223367
      SD |  1.206663  .9537506  .4384954  .5542911  .5425705
      p1 |        -1        -1        -1 -.8039658 -.7104068
      p5 | -.9483774        -1 -.5327307 -.5387344 -.4169048
     p50 |    .02053  .0996786  .0940058  .0821008  .1182693
     p95 |  2.403116  1.966479  .8641539  1.289254  1.196941
     p99 |  6.877563  5.449806         2  2.572623  2.840652
     Min |        -1        -1        -1 -.8039658 -.7104068
     Max |  6.877563  5.449806         2  2.572623  2.840652
------------------------------------------------------------
--- Year 2008 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     13155      6735     12823      6496     13311
    Mean |  .2912837  .2457926  .0065366  .1496728  .1309695
      SD |  1.275345  .9171129  .3737956  .5669265   .477685
      p1 |        -1        -1        -1 -.7961735  -.728433
      p5 | -.9728337        -1 -.5686689 -.5368095 -.4558613
     p50 |  .0074907  .0602312         0  .0477834  .0467583
     p95 |  2.605551  1.923765  .5811388  1.168572  .9966639
     p99 |  7.103497  4.800067  1.645751  2.958517  2.399934
     Min |        -1        -1        -1 -.7961735  -.728433
     Max |  7.103497  4.800067  1.645751  2.958517  2.399934
------------------------------------------------------------
--- Year 2010 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     11929      6129     11528      5926     11929
    Mean |   .179421  .2099511 -.0454634  .0821969  .0825397
      SD |  1.175284  .9321084  .3669636  .5004744  .4816109
      p1 |        -1        -1        -1   -.78236 -.7937624
      p5 |        -1 -.8267949 -.7113249 -.5530107 -.4892756
     p50 | -.0526641  .0166924 -.0398133  .0052885  .0018197
     p95 |  2.278028  1.910762  .5374122  1.003842  .9832947
     p99 |   6.64635  5.125684   1.44949  2.430641  2.355794
     Min |        -1        -1        -1   -.78236 -.7937624
     Max |   6.64635  5.125684   1.44949  2.430641  2.355794
------------------------------------------------------------
--- Year 2012 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     14018      7136     13705      6785     14119
    Mean |   .220547  .2007094  .0024621  .1057823  .1307248
      SD |  1.168684  .9233212  .4188875  .5106501  .5258028
      p1 |        -1        -1        -1 -.8756493 -.8068895
      p5 |        -1        -1 -.6600654 -.5735529 -.4960107
     p50 |         0  .0369716         0  .0354307  .0381487
     p95 |  2.397546  1.898196  .6457015  1.054829  1.074333
     p99 |  6.472728   4.91608  2.056931  2.367306  2.760476
     Min |        -1        -1        -1 -.8756493 -.8068895
     Max |  6.472728   4.91608  2.056931  2.367306  2.760476
------------------------------------------------------------
--- Year 2014 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     12536      6358     12496      5995     13108
    Mean |  .2908527   .256128   .070085  .1619814  .1890789
      SD |  1.246577  .9634451  .4474334  .5554295  .5550473
      p1 |        -1        -1        -1  -.839531 -.7965277
      p5 |        -1        -1 -.5983903 -.5527864 -.4522774
     p50 |  .0207523  .0836325  .0297761  .0702015  .0806943
     p95 |  2.563706  1.994054  .8126539  1.193482  1.203145
     p99 |         7  5.403124  2.162278  2.785142  3.017123
     Min |        -1        -1        -1  -.839531 -.7965277
     Max |         7  5.403124  2.162278  2.785142  3.017123
------------------------------------------------------------
--- Year 2016 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     11136      5709     11131      5431     11759
    Mean |   .257207   .261529  .0702787  .1394711  .1930497
      SD |  1.253791  1.059876   .439928  .5358224  .5728341
      p1 |        -1        -1        -1  -.872792  -.831225
      p5 |        -1        -1 -.6181187 -.5585142 -.4634546
     p50 |  .0012243  .0422847   .041465  .0503055  .0762494
     p95 |   2.57398  2.027925  .7663522  1.141799  1.279137
     p99 |  6.937254  6.117423  2.117991  2.494468  3.010855
     Min |        -1        -1        -1  -.872792  -.831225
     Max |  6.937254  6.117423  2.117991  2.494468  3.010855
------------------------------------------------------------
--- Year 2018 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |     11127      5584     11342      5278     11881
    Mean |  .2796762  .2627762   .087912  .1652487  .2080546
      SD |  1.289207  1.023494  .4541565  .5780907  .5856326
      p1 |        -1        -1        -1 -.8559418 -.8168963
      p5 |        -1        -1 -.6358617 -.5635265 -.4916469
     p50 |  .0067374  .0613111  .0508033  .0707762  .0933268
     p95 |  2.676955  2.162278  .8257419  1.263184  1.342823
     p99 |  7.017027  5.831301  2.229795   2.97907  3.032204
     Min |        -1        -1        -1 -.8559418 -.8168963
     Max |  7.017027  5.831301  2.229795   2.97907  3.032204
------------------------------------------------------------
--- Year 2020 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |      9539      4966      9911      4674     10424
    Mean |  .3174164   .233656  .0845597  .1326769  .2050545
      SD |  1.348276  .9766672  .4450098  .5279058  .5951951
      p1 |        -1        -1        -1 -.7833597 -.7730061
      p5 |        -1        -1 -.5948098 -.5397827 -.4683276
     p50 |  .0319569  .0421834  .0488088  .0438695   .076495
     p95 |    2.8735  2.134042  .7888544  1.186608  1.358543
     p99 |  7.575514  5.287554  2.162278  2.489861  3.106588
     Min |        -1        -1        -1 -.7833597 -.7730061
     Max |  7.575514  5.287554  2.162278  2.489861  3.106588
------------------------------------------------------------
--- Year 2022 (winsorized) ---

   Stats |  r1_ann..  r2_ann..  r3_ann..  r4_ann..  r5_ann..
---------+--------------------------------------------------
       N |      8330      4431      8523      4152      9190
    Mean |  .3241761  .3007727  .1843175  .1805164  .2987002
      SD |  1.356852  1.041758  .5070959   .570291  .6613798
      p1 |        -1        -1        -1 -.8203947 -.7842487
      p5 |        -1 -.8036039 -.5690029 -.5210837 -.4271745
     p50 |  .0382838  .0887893  .1319231   .081766  .1544909
     p95 |  2.751666  1.974895  1.009975  1.202837   1.58457
     p99 |  7.660254  6.271499  2.546681     2.833  3.610437
     Min |        -1        -1        -1 -.8203947 -.7842487
     Max |  7.660254  6.271499  2.546681     2.833  3.610437
------------------------------------------------------------
. }

. else display "=== No winsorized return variables found; skip winsorized tabstat
>  ==="

. 
. * ---------------------------------------------------------------------
. * Share descriptive statistics (debt = amort+ahmln only, no amrtb)
. * ---------------------------------------------------------------------
. * Block 1: Tabstat table for 2002 and 2022
. local share_years "2002 2022"

. local share_asset_vars "share_pri_res share_sec_res share_re share_bus share_ir
> a share_stk share_bond share_chck share_other"

. local share_agg_vars "share_res share_core share_fin"

. local share_debt_vars "share_debt_long share_debt_other"

. local share_rowlabels "Share in primary residence" "Share in secondary residenc
> e" "Share in real estate" "Share in private business" "Share in IRA" "Share in 
> stocks" "Share in bonds" "Share in checking" "Share in other assets" "Share res
> idential (operative)" "Share core" "Share financial" "Share long-term debt" "Sh
> are other debt"

. 
. preserve

. tempfile share_stats

. postfile sh_handle str32 varname int year double obs mean sd p50 p95 min max us
> ing "`share_stats'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_30768.000008 not
    found)

. foreach y of local share_years {
  2.     foreach v in `share_asset_vars' `share_agg_vars' `share_debt_vars' {
  3.         local v_y "`v'_`y'"
  4.         capture confirm variable `v_y'
  5.         if _rc continue
  6.         quietly summarize `v_y' `wopt', detail
  7.         post sh_handle ("`v'") (`y') (r(N)) (r(mean)) (r(sd)) (r(p50)) (r(p9
> 5)) (r(min)) (r(max))
  8.     }
  9. }

. postclose sh_handle

. 
. use "`share_stats'", clear

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/share_tabstat_2002_2022.tex", write r
> eplace

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Portfolio shar
> e summary statistics (2002 and 2022)}" _n "\label{tab:share_tabstat_2002_2022}"
>  _n "\resizebox{\textwidth}{!}{\begin{tabular}{llrrrrrrr}\toprule" _n "Variable
>  & Year & Obs & Mean & SD & P50 & P95 & Min & Max \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local v = varname[`r']
  3.     local v_lab "`v'"
  4.     * Map varname to display label
.     if "`v'" == "share_pri_res" local v_lab "Share in primary residence"
  5.     if "`v'" == "share_sec_res" local v_lab "Share in secondary residence"
  6.     if "`v'" == "share_re" local v_lab "Share in real estate"
  7.     if "`v'" == "share_bus" local v_lab "Share in private business"
  8.     if "`v'" == "share_ira" local v_lab "Share in IRA"
  9.     if "`v'" == "share_stk" local v_lab "Share in stocks"
 10.     if "`v'" == "share_bond" local v_lab "Share in bonds"
 11.     if "`v'" == "share_chck" local v_lab "Share in checking"
 12.     if "`v'" == "share_other" local v_lab "Share in other assets"
 13.     if "`v'" == "share_res" local v_lab "Share residential (operative)"
 14.     if "`v'" == "share_core" local v_lab "Share core"
 15.     if "`v'" == "share_fin" local v_lab "Share financial"
 16.     if "`v'" == "share_debt_long" local v_lab "Share long-term debt"
 17.     if "`v'" == "share_debt_other" local v_lab "Share other debt"
 18.     local yr_s = string(year[`r'], "%9.0f")
 19.     local o_s = string(obs[`r'], "%9.0fc")
 20.     local m_s = string(mean[`r'], "%6.4f")
 21.     local sd_s = string(sd[`r'], "%6.4f")
 22.     local p50_s = string(p50[`r'], "%6.4f")
 23.     local p95_s = string(p95[`r'], "%6.4f")
 24.     local min_s = string(min[`r'], "%6.4f")
 25.     local max_s = string(max[`r'], "%6.4f")
 26.     file write fh "`v_lab' & `yr_s' & `o_s' & `m_s' & `sd_s' & `p50_s' & `p9
> 5_s' & `min_s' & `max_s' \\\\" _n
 27. }

. file write fh "\bottomrule" _n "\multicolumn{9}{l}{\footnotesize Shares = compo
> nent / gross assets. Long-term debt = amort + ahmln only.} \\\\" _n "\end{tabul
> ar}}" _n "\end{table}" _n

. file close fh

. restore

. 
. * Block 2: Mean share per year â€” four graphs
. preserve

. local share_stubs "share_re share_bus share_fin share_core share_res share_ira 
> share_debt_amort share_debt_ahmln share_debt_long share_debt_other"

. local share_keep ""

. foreach s of local share_stubs {
  2.     capture unab tmp : `s'_*
  3.     if !_rc local share_keep "`share_keep' `tmp'"
  4. }

. keep hhidpn `share_keep'

. reshape long share_re_ share_bus_ share_fin_ share_core_ share_res_ share_ira_ 
> share_debt_amort_ share_debt_ahmln_ share_debt_long_ share_debt_other_, i(hhidp
> n) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                 121   ->   12          
j variable (12 values)                    ->   year
xij variables:
share_re_2000 share_re_2002 ... share_re_2022->share_re_
share_bus_2000 share_bus_2002 ... share_bus_2022->share_bus_
share_fin_2000 share_fin_2002 ... share_fin_2022->share_fin_
share_core_2000 share_core_2002 ... share_core_2022->share_core_
share_res_2000 share_res_2002 ... share_res_2022->share_res_
share_ira_2000 share_ira_2002 ... share_ira_2022->share_ira_
share_debt_amort_2000 share_debt_amort_2002 ... share_debt_amort_2022->share_debt
> _amort_
share_debt_ahmln_2000 share_debt_ahmln_2002 ... share_debt_ahmln_2022->share_debt
> _ahmln_
share_debt_long_2000 share_debt_long_2002 ... share_debt_long_2022->share_debt_lo
> ng_
share_debt_other_2000 share_debt_other_2002 ... share_debt_other_2022->share_debt
> _other_
-----------------------------------------------------------------------------

. * 2a: Assets within core (share_re, share_bus, share_fin)
. collapse (mean) share_re_ share_bus_ share_fin_ `wopt', by(year)

. graph bar (asis) share_re_ share_bus_ share_fin_, over(year) legend(order(1 "Re
> al estate" 2 "Business" 3 "Financial")) title("Mean Holdings within Core Assets
> ")

. graph export "${DESCRIPTIVE}/Figures/share_mean_by_year_core_components.png", r
> eplace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/share_mean_b
    > y_year_core_components.png saved as PNG format

. restore

. 
. preserve

. local share_stubs "share_core share_res share_ira"

. local share_keep ""

. foreach s of local share_stubs {
  2.     capture unab tmp : `s'_*
  3.     if !_rc local share_keep "`share_keep' `tmp'"
  4. }

. keep hhidpn `share_keep'

. reshape long share_core_ share_res_ share_ira_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  37   ->   5           
j variable (12 values)                    ->   year
xij variables:
share_core_2000 share_core_2002 ... share_core_2022->share_core_
share_res_2000 share_res_2002 ... share_res_2022->share_res_
share_ira_2000 share_ira_2002 ... share_ira_2022->share_ira_
-----------------------------------------------------------------------------

. collapse (mean) share_core_ share_res_ share_ira_ `wopt', by(year)

. graph bar (asis) share_core_ share_res_ share_ira_, over(year) legend(order(1 "
> Core" 2 "Residential" 3 "Retirement")) title("Mean Asset Shares")

. graph export "${DESCRIPTIVE}/Figures/share_mean_by_year_core_res_ret.png", repl
> ace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/share_mean_b
    > y_year_core_res_ret.png saved as PNG format

. restore

. 
. preserve

. local share_stubs "share_debt_amort share_debt_ahmln"

. local share_keep ""

. foreach s of local share_stubs {
  2.     capture unab tmp : `s'_*
  3.     if !_rc local share_keep "`share_keep' `tmp'"
  4. }

. keep hhidpn `share_keep'

. reshape long share_debt_amort_ share_debt_ahmln_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  25   ->   4           
j variable (12 values)                    ->   year
xij variables:
share_debt_amort_2000 share_debt_amort_2002 ... share_debt_amort_2022->share_debt
> _amort_
share_debt_ahmln_2000 share_debt_ahmln_2002 ... share_debt_ahmln_2022->share_debt
> _ahmln_
-----------------------------------------------------------------------------

. collapse (mean) share_debt_amort_ share_debt_ahmln_ `wopt', by(year)

. graph bar (asis) share_debt_amort_ share_debt_ahmln_, over(year) legend(order(1
>  "Mortgage" 2 "Other home loans")) title("Mean holdings within Long debt")

. graph export "${DESCRIPTIVE}/Figures/share_mean_by_year_debt_long_components.pn
> g", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/share_mean_b
    > y_year_debt_long_components.png saved as PNG format

. restore

. 
. preserve

. local share_stubs "share_debt_long share_debt_other"

. local share_keep ""

. foreach s of local share_stubs {
  2.     capture unab tmp : `s'_*
  3.     if !_rc local share_keep "`share_keep' `tmp'"
  4. }

. keep hhidpn `share_keep'

. reshape long share_debt_long_ share_debt_other_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  25   ->   4           
j variable (12 values)                    ->   year
xij variables:
share_debt_long_2000 share_debt_long_2002 ... share_debt_long_2022->share_debt_lo
> ng_
share_debt_other_2000 share_debt_other_2002 ... share_debt_other_2022->share_debt
> _other_
-----------------------------------------------------------------------------

. collapse (mean) share_debt_long_ share_debt_other_ `wopt', by(year)

. graph bar (asis) share_debt_long_ share_debt_other_, over(year) legend(order(1 
> "Long-term debt" 2 "Other debt")) title("Mean Liability Shares")

. graph export "${DESCRIPTIVE}/Figures/share_mean_by_year_debt_long_other.png", r
> eplace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/share_mean_b
    > y_year_debt_long_other.png saved as PNG format

. restore

. 
. * Block 3: Share by income/wealth percentile (2002, 2022) â€” data must be wide
. * Force clean reload so Block 3 does not depend on prior preserve/restore/resha
> pe state
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. display "=== Block 3 asset_shares: reloaded wide data, N=" _N " ==="
=== Block 3 asset_shares: reloaded wide data, N=45234 ===

. 
. foreach yr in 2002 2022 {
  2.     foreach dec_type in labor_inc total_inc gross net {
  3.         preserve
  4.         local skip 0
  5.         if "`dec_type'" == "labor_inc" capture confirm variable labor_income
> _real_win_`yr'
  6.         else if "`dec_type'" == "total_inc" capture confirm variable total_i
> ncome_real_win_`yr'
  7.         else if "`dec_type'" == "gross" capture confirm variable gross_wealt
> h_`yr'
  8.         else if "`dec_type'" == "net" capture confirm variable wealth_total_
> `yr'
  9.         if _rc local skip 1
 10.         if !`skip' {
 11.             capture confirm variable share_core_`yr'
 12.             if _rc local skip 1
 13.         }
 14.         if !`skip' {
 15.             capture confirm variable share_res_`yr'
 16.             if _rc local skip 1
 17.         }
 18.         if !`skip' {
 19.             capture confirm variable share_ira_`yr'
 20.             if _rc local skip 1
 21.         }
 22.         if !`skip' {
 23.             if "`dec_type'" == "labor_inc" local rankvar "labor_income_real_
> win_`yr'"
 24.             else if "`dec_type'" == "total_inc" local rankvar "total_income_
> real_win_`yr'"
 25.             else if "`dec_type'" == "gross" local rankvar "gross_wealth_`yr'
> "
 26.             else local rankvar "wealth_total_`yr'"
 27.             if "`dec_type'" == "labor_inc" local dec_lab "Labor Income"
 28.             else if "`dec_type'" == "total_inc" local dec_lab "Total Income"
 29.             else if "`dec_type'" == "gross" local dec_lab "Gross Wealth"
 30.             else local dec_lab "Net Wealth"
 31.             keep hhidpn share_core_`yr' share_res_`yr' share_ira_`yr' `rankv
> ar'
 32.             keep if !missing(`rankvar') & `rankvar' >= 0
 33.             quietly count if !missing(share_core_`yr') | !missing(share_res_
> `yr') | !missing(share_ira_`yr')
 34.             if r(N) >= 10 {
 35.                 sort `rankvar'
 36.                 gen long _rank = sum(!missing(`rankvar'))
 37.                 gen long _total = _rank[_N]
 38.                 gen int pct = ceil(100 * _rank / _total) if !missing(`rankva
> r')
 39.                 drop _rank _total
 40.                 gen byte pct_grp = ceil(pct/20) if !missing(pct)
 41.                 replace pct_grp = 5 if pct_grp > 5
 42.                 collapse (mean) mean_core=share_core_`yr' mean_res=share_res
> _`yr' mean_ira=share_ira_`yr', by(pct_grp)
 43.                 graph bar mean_core mean_res mean_ira, over(pct_grp, relabel
> (1 "0-20" 2 "20-40" 3 "40-60" 4 "60-80" 5 "80-100")) ///
>                     ytitle("Mean share") ///
>                     legend(order(1 "Core" 2 "Residential" 3 "Retirement")) titl
> e("Asset Shares by `dec_lab' Percentile (`yr')")
 44.                 graph export "${DESCRIPTIVE}/Figures/asset_shares_by_`dec_ty
> pe'_pct_`yr'.png", replace
 45.             }
 46.         }
 47.         restore
 48.     }
 49. }
(27,069 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_labor_inc_pct_2002.png saved as PNG format
(27,069 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_total_inc_pct_2002.png saved as PNG format
(27,824 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_gross_pct_2002.png saved as PNG format
(33,274 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_net_pct_2002.png saved as PNG format
(29,378 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_labor_inc_pct_2022.png saved as PNG format
(29,378 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_total_inc_pct_2022.png saved as PNG format
(30,767 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_gross_pct_2022.png saved as PNG format
(36,361 observations deleted)
(0 real changes made)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/asset_shares
    > _by_net_pct_2022.png saved as PNG format

. foreach yr in 2002 2022 {
  2.     foreach dec_type in labor_inc total_inc gross net {
  3.         preserve
  4.         local skip 0
  5.         if "`dec_type'" == "labor_inc" capture confirm variable labor_income
> _real_win_`yr'
  6.         else if "`dec_type'" == "total_inc" capture confirm variable total_i
> ncome_real_win_`yr'
  7.         else if "`dec_type'" == "gross" capture confirm variable gross_wealt
> h_`yr'
  8.         else if "`dec_type'" == "net" capture confirm variable wealth_total_
> `yr'
  9.         if _rc local skip 1
 10.         if !`skip' {
 11.             capture confirm variable share_debt_long_`yr'
 12.             if _rc local skip 1
 13.         }
 14.         if !`skip' {
 15.             capture confirm variable share_debt_other_`yr'
 16.             if _rc local skip 1
 17.         }
 18.         if !`skip' {
 19.             if "`dec_type'" == "labor_inc" local rankvar "labor_income_real_
> win_`yr'"
 20.             else if "`dec_type'" == "total_inc" local rankvar "total_income_
> real_win_`yr'"
 21.             else if "`dec_type'" == "gross" local rankvar "gross_wealth_`yr'
> "
 22.             else local rankvar "wealth_total_`yr'"
 23.             if "`dec_type'" == "labor_inc" local dec_lab "Labor Income"
 24.             else if "`dec_type'" == "total_inc" local dec_lab "Total Income"
 25.             else if "`dec_type'" == "gross" local dec_lab "Gross Wealth"
 26.             else local dec_lab "Net Wealth"
 27.             keep hhidpn share_debt_long_`yr' share_debt_other_`yr' `rankvar'
 28.             keep if !missing(`rankvar') & `rankvar' >= 0
 29.             quietly count if !missing(share_debt_long_`yr') | !missing(share
> _debt_other_`yr')
 30.             if r(N) >= 10 {
 31.                 sort `rankvar'
 32.                 gen long _rank = sum(!missing(`rankvar'))
 33.                 gen long _total = _rank[_N]
 34.                 gen int pct = ceil(100 * _rank / _total) if !missing(`rankva
> r')
 35.                 drop _rank _total
 36.                 gen byte pct_grp = ceil(pct/20) if !missing(pct)
 37.                 replace pct_grp = 5 if pct_grp > 5 & !missing(pct_grp)
 38.                 drop if missing(pct_grp)
 39.                 collapse (mean) mean_long=share_debt_long_`yr' mean_other=sh
> are_debt_other_`yr', by(pct_grp)
 40.                 graph bar mean_long mean_other, over(pct_grp, relabel(1 "0-2
> 0" 2 "20-40" 3 "40-60" 4 "60-80" 5 "80-100")) ///
>                     ytitle("Mean share") ///
>                     legend(order(1 "Long-term debt" 2 "Other debt")) title("Deb
> t Shares by `dec_lab' Percentile (`yr')")
 41.                 graph export "${DESCRIPTIVE}/Figures/debt_shares_by_`dec_typ
> e'_pct_`yr'.png", replace
 42.             }
 43.         }
 44.         restore
 45.     }
 46. }
(27,069 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_labor_inc_pct_2002.png saved as PNG format
(27,069 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_total_inc_pct_2002.png saved as PNG format
(27,824 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_gross_pct_2002.png saved as PNG format
(33,274 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_net_pct_2002.png saved as PNG format
(29,378 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_labor_inc_pct_2022.png saved as PNG format
(29,378 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_total_inc_pct_2022.png saved as PNG format
(30,767 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_gross_pct_2022.png saved as PNG format
(36,361 observations deleted)
(0 real changes made)
(0 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/debt_shares_
    > by_net_pct_2022.png saved as PNG format

. 
. * Mean returns by year: (1) components = r1, r2, r3; (2) aggregated = r1, r4, r
> 5
. preserve

. keep hhidpn r1_annual_* r2_annual_* r3_annual_* r4_annual_* r5_annual_*

. reshape long r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_, i(hhidpn) 
> j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                 214   ->   165         
j variable (11 values)                    ->   year
xij variables:
r1_annual_2002 r1_annual_2004 ... r1_annual_2022->r1_annual_
r2_annual_2002 r2_annual_2004 ... r2_annual_2022->r2_annual_
r3_annual_2002 r3_annual_2004 ... r3_annual_2022->r3_annual_
r4_annual_2002 r4_annual_2004 ... r4_annual_2022->r4_annual_
r5_annual_2002 r5_annual_2004 ... r5_annual_2022->r5_annual_
-----------------------------------------------------------------------------

. collapse (mean) r1=r1_annual_ r2=r2_annual_ r3=r3_annual_ r4=r4_annual_ r5=r5_a
> nnual_ `wopt', by(year)

. * Components: core, retirement, residential
. twoway line r1 year || line r2 year || line r3 year, ///
>     title("Mean returns by year (components)") ///
>     xtitle("Year") ytitle("Mean return") ///
>     legend(order(1 "Core" 2 "Retirement" 3 "Residential"))

. graph export "${DESCRIPTIVE}/Figures/returns_mean_by_year_components.png", repl
> ace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_mean
    > _by_year_components.png saved as PNG format

. * Aggregated: core, Core+ret., net wealth
. twoway line r1 year || line r4 year || line r5 year, ///
>     title("Mean returns by year (aggregated)") ///
>     xtitle("Year") ytitle("Mean return") ///
>     legend(order(1 "Core" 2 "Core+ret." 3 "Net wealth"))

. graph export "${DESCRIPTIVE}/Figures/returns_mean_by_year_agg.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_mean
    > _by_year_agg.png saved as PNG format

. restore

. 
. * Mean returns by age group and education group
. preserve

. keep hhidpn educ_yrs age_* r1_annual_* r2_annual_* r3_annual_* r4_annual_* r5_a
> nnual_*

. capture drop age_2000

. reshape long age_ r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_, i(hhi
> dpn) j(year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                 238   ->   179         
j variable (11 values)                    ->   year
xij variables:
         age_2002 age_2004 ... age_2022   ->   age_
r1_annual_2002 r1_annual_2004 ... r1_annual_2022->r1_annual_
r2_annual_2002 r2_annual_2004 ... r2_annual_2022->r2_annual_
r3_annual_2002 r3_annual_2004 ... r3_annual_2022->r3_annual_
r4_annual_2002 r4_annual_2004 ... r4_annual_2022->r4_annual_
r5_annual_2002 r5_annual_2004 ... r5_annual_2022->r5_annual_
-----------------------------------------------------------------------------

. rename age_ age

. gen int age_group = floor(age/5)*5 if !missing(age)
(292,622 missing values generated)

. tabstat r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_ `wopt', by(age_g
> roup) statistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  r1_ann~_  r2_ann~_  r3_ann~_  r4_ann~_  r5_ann~_
----------+--------------------------------------------------
       15 |         0         0         0         0         0
          |         .         .         .         .         .
          |         .         .         .         .         .
          |         .         .         .         .         .
          |         .         .         .         .         .
----------+--------------------------------------------------
       20 |         1         0         0         0         3
          |   .050714         .         .         .   -.41291
          |         .         .         .         .  .7370292
          |   .050714         .         .         . -.6529436
          |   .050714         .         .         .  .4142136
----------+--------------------------------------------------
       25 |        17         3         6         3        12
          |  .9409763 -.6228764 -.7825163  1.275228  .1811166
          |  2.449681  .6531973  .4773227  2.085365  .7962179
          |  .1813363        -1        -1  .2415324  .2368201
          |  7.124038  .1313708  .1870514  3.675518  1.529822
----------+--------------------------------------------------
       30 |        55        16        42        16        53
          |  .6188091 -.0223774  .3269255  .1422719  .3411684
          |  1.538563   .854165  1.411209   .502945  .9864314
          |   .183216  .0584167  .2185711  .1846379  .1026827
          |  5.204837  2.162278  1.081666  1.212137  2.084286
----------+--------------------------------------------------
       35 |       158        46       140        42       158
          |  .4906502 -.1062296  .1057669  .1327381  .2260933
          |  1.754078  .7898386  .6784683  .7705875   .706835
          |  .1578267 -.1627883  .0685964  .1029111  .1108873
          |  3.092676  1.401922  1.146829   .685354  1.538819
----------+--------------------------------------------------
       40 |       507       178       493       163       473
          |   .395396 -.0138036  .1276804  .1390122  .2653486
          |  1.815229  1.076153  .6948199  .9526772  .8849104
          |         0         0  .0478737 -.0028374  .0688477
          |  3.198039  1.236068  1.236068  1.931357  1.821474
----------+--------------------------------------------------
       45 |      1585       673      1533       615      1451
          |  .4620641  .0193481   .182727  .1292265  .2926121
          |  1.832343  1.060213  .8421904  .6530569  .9695349
          |  .0195639 -.0117882  .0731537  .0517482  .0807643
          |  3.472136  1.598076  1.220293  1.310565  1.880972
----------+--------------------------------------------------
       50 |      6730      3166      6657      2985      6217
          |  .5156064  .0756997   .134507   .166993  .2431322
          |  2.046638  1.173426  .6261462  .7034953  .8146356
          |  .0701874         0  .0638311  .0691457  .0919979
          |  3.472136  1.636665  .9847907  1.420153  1.478957
----------+--------------------------------------------------
       55 |     18336      9242     18356      8667     17748
          |  .4751139  .1268952   .130665  .1768862  .2436899
          |  1.893516  1.261041  .6317343   .797963  .8199337
          |  .0531523         0  .0600097  .0570911  .0911689
          |  3.312772  1.725541  .9364917  1.402316   1.47317
----------+--------------------------------------------------
       60 |     21044     11425     21477     10796     21523
          |  .3888416  .2004052  .1215819  .1674993   .235236
          |  1.713803  1.208402  .6015936   .711994   .751872
          |  .0391927  .0281745  .0567245  .0557313  .0907238
          |  2.898718  1.901149  .8801286   1.27738  1.362058
----------+--------------------------------------------------
       65 |     21498     12010     22086     11499     22712
          |   .313609  .3511508   .106288  .1733146  .2211467
          |  1.638707  1.252763  .5414659  .6249566  .7304004
          |  .0107843  .0889759  .0488088  .0611551  .0950497
          |  2.464102  2.114672  .7950549  1.193291  1.221157
----------+--------------------------------------------------
       70 |     20006     11271     20584     10872     21483
          |   .237111  .3444015  .0670108  .1423358  .1682145
          |  1.377369  1.195784  .4734836  .5527532  .5486115
          |         0  .0727195  .0290813   .043004  .0705374
          |  2.164987  2.053247    .64781   1.01049  1.010318
----------+--------------------------------------------------
       75 |     17308      9244     17539      8944     18638
          |  .2225154  .3062951  .0503008  .1401955  .1510905
          |  1.381569  1.177423  .4920267  .5682172  .6122435
          |         0  .0674523  .0183502  .0469548  .0622268
          |  2.162278  1.915476  .5976345  .9840472  .9216808
----------+--------------------------------------------------
       80 |     13330      6364     12793      6166     14375
          |  .1909759  .3522345  .0209283  .1384861  .1362355
          |  1.342315  1.151238  .4468812  .6110176  .5379628
          | -.0046352  .0810417  .0101525     .0406  .0579477
          |  1.917944  2.094511  .5352989  1.063426  .9158086
----------+--------------------------------------------------
       85 |      7868      2992      6730      2906      8344
          |  .2130114  .3536067 -.0080874  .1214486  .1527818
          |  1.539258  1.081242  .4572094  .6149086  .7584291
          | -.0333637  .1053673         0  .0280222  .0491725
          |  2.134666         2  .5512092  1.025702  1.054175
----------+--------------------------------------------------
       90 |      3353       895      2504       850      3510
          |  .1549573  .5104383 -.0587382  .1683804  .1453838
          |  1.388195  1.322995   .578506  .7160081  .8020192
          | -.0564742  .1315838         0  .0474322  .0349026
          |  2.039713  2.859345  .5352989  1.282275  1.247383
----------+--------------------------------------------------
       95 |       854       124       510       119       854
          |  .2438669  .3149068 -.0765522  .0466437  .2133651
          |  1.815304  .9433175  .5333299  .5844475  1.115128
          | -.0668182  .0715268 -.0053159   .008535  .0262559
          |  2.660874  1.852367  .6996732  1.182821   1.50722
----------+--------------------------------------------------
      100 |        96         6        42         6        89
          |  .2358099  .9893576 -.1873917   .565335  .2020862
          |  1.959782  2.168562  .8700436  1.086524  .7114491
          | -.0721692  .3781357 -.0646811   .250162  .0629658
          |  2.023716   4.91608  .6903085  2.492312  1.588436
----------+--------------------------------------------------
      105 |         5         1         2         1         3
          |  -.455296       -.6        -1 -.8559551 -.6489578
          |  .7548885         .         0         .  .2589957
          | -.9931028       -.6        -1 -.8559551 -.7115751
          |  .5491933       -.6        -1 -.8559551 -.3643942
----------+--------------------------------------------------
    Total |    132751     67656    131494     64650    137646
          |  .3143609  .2725081  .0828813  .1563194  .1954186
          |  1.614412  1.208711  .5502487  .6524518   .704076
          |  .0059821  .0550125  .0350983  .0500459  .0753119
          |  2.537655  1.994996  .7559423  1.176349  1.186321
-------------------------------------------------------------

. 
. gen byte educ_group = .
(497,574 missing values generated)

. replace educ_group = 1 if educ_yrs < 12
(132,770 real changes made)

. replace educ_group = 2 if educ_yrs == 12
(149,721 real changes made)

. replace educ_group = 3 if inrange(educ_yrs,13,15)
(106,414 real changes made)

. replace educ_group = 4 if educ_yrs == 16
(54,648 real changes made)

. replace educ_group = 5 if educ_yrs >= 17 & !missing(educ_yrs)
(46,882 real changes made)

. label define educ_group 1 "no hs" 2 "hs" 3 "some college" 4 "4yr degree" 5 "gra
> d"

. label values educ_group educ_group

. tabstat r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_ `wopt', by(educ_
> group) statistics(n mean sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: educ_group 

  educ_group |  r1_ann~_  r2_ann~_  r3_ann~_  r4_ann~_  r5_ann~_
-------------+--------------------------------------------------
       no hs |     19023      5218     24003      4745     25722
             |  .1626184  .2709254  .0474856  .1446701  .2013772
             |  1.529154  1.177018  .5871004  .6782827  .6917695
             | -.1055728  .0555993  .0080323  .0358152  .0848671
             |  2.464102  2.157003  .8071942  1.252465   1.27303
-------------+--------------------------------------------------
          hs |     42980     20029     41632     18993     44582
             |  .2861302  .2824621  .0665556  .1480053  .1850921
             |  1.591911  1.260391  .5060345  .6561046  .6860961
             |         0  .0556136  .0289915  .0390202  .0674023
             |  2.464102  2.051557  .7066048  1.176081  1.148255
-------------+--------------------------------------------------
some college |     32457     16758     30301     15970     31458
             |  .3565442  .2488561  .0962763  .1518836  .2037389
             |  1.670209  1.167906  .5684646   .661821  .7416463
             |  .0144166  .0400157  .0422125  .0416629  .0728572
             |  2.746287  2.022813  .7888544   1.21084   1.23547
-------------+--------------------------------------------------
  4yr degree |     18926     12336     17643     11958     17745
             |  .3763647  .2593172   .114044  .1609177  .1962458
             |  1.595613  1.228612  .5541119  .6649929  .6693716
             |  .0523566  .0517412  .0540926  .0605549  .0788579
             |  2.557114  1.789595  .7684097  1.150518  1.135533
-------------+--------------------------------------------------
        grad |     19036     13185     17614     12868     17826
             |  .3910966  .3024657  .1154548   .173578  .1944459
             |   1.64566  1.171047  .5589987  .6115251   .724987
             |  .0654442  .0793453  .0519563  .0732727  .0820475
             |  2.475955   1.95804  .7505759  1.135767  1.057092
-------------+--------------------------------------------------
       Total |    132422     67526    131193     64534    137333
             |  .3136315  .2729082  .0828825  .1562116  .1950689
             |  1.612659  1.208541  .5502945  .6522984  .7032754
             |   .005971  .0551064  .0350983  .0500422  .0751577
             |  2.536005  1.994996  .7557639  1.175107  1.184508
----------------------------------------------------------------

. restore

. 
. 
. * Returns vs wealth percentile: mean+IQR ribbon and binscatter (2002 and 2022)
. capture confirm variable wealth_core_2002

. if !_rc {
.     local wkeep "wealth_core_* wealth_ira_* wealth_res_* wealth_total_* gross_w
> ealth_*"
.     capture confirm variable wealth_coreira_2002
.     if !_rc local wkeep "wealth_core_* wealth_ira_* wealth_coreira_* wealth_res
> _* wealth_total_* gross_wealth_*"
.     keep hhidpn `wkeep' r1_annual_* r2_annual_* r3_annual_* r4_annual_* r5_annu
> al_*
.     * Returns exist only 2002-2022; drop wealth_*_2000 so reshape j = 2002 2004
>  ... 2022
.     foreach stub in wealth_core_ wealth_ira_ wealth_res_ wealth_total_ gross_we
> alth_ {
  2.         capture drop `stub'2000
  3.     }
.     capture drop wealth_coreira_2000
.     capture confirm variable wealth_coreira_2002
.     if !_rc {
.         reshape long wealth_core_ wealth_ira_ wealth_coreira_ wealth_res_ wealt
> h_total_ gross_wealth_ ///
>             r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_, i(hhidpn) j
> (year)
(j = 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   497,574     
Number of variables                 808   ->   699         
j variable (11 values)                    ->   year
xij variables:
wealth_core_2002 wealth_core_2004 ... wealth_core_2022->wealth_core_
wealth_ira_2002 wealth_ira_2004 ... wealth_ira_2022->wealth_ira_
wealth_coreira_2002 wealth_coreira_2004 ... wealth_coreira_2022->wealth_coreira_
wealth_res_2002 wealth_res_2004 ... wealth_res_2022->wealth_res_
wealth_total_2002 wealth_total_2004 ... wealth_total_2022->wealth_total_
gross_wealth_2002 gross_wealth_2004 ... gross_wealth_2022->gross_wealth_
r1_annual_2002 r1_annual_2004 ... r1_annual_2022->r1_annual_
r2_annual_2002 r2_annual_2004 ... r2_annual_2022->r2_annual_
r3_annual_2002 r3_annual_2004 ... r3_annual_2022->r3_annual_
r4_annual_2002 r4_annual_2004 ... r4_annual_2022->r4_annual_
r5_annual_2002 r5_annual_2004 ... r5_annual_2022->r5_annual_
-----------------------------------------------------------------------------
.         rename (wealth_core_ wealth_ira_ wealth_coreira_ wealth_res_ wealth_tot
> al_ gross_wealth_) (wealth_core wealth_ira wealth_coreira wealth_res wealth_tot
> al gross_wealth)
.     }
.     else {
.         reshape long wealth_core_ wealth_ira_ wealth_res_ wealth_total_ gross_w
> ealth_ ///
>             r1_annual_ r2_annual_ r3_annual_ r4_annual_ r5_annual_, i(hhidpn) j
> (year)
.         rename (wealth_core_ wealth_ira_ wealth_res_ wealth_total_ gross_wealth
> _) (wealth_core wealth_ira wealth_res wealth_total gross_wealth)
.         gen double wealth_coreira = wealth_core + wealth_ira if !missing(wealth
> _core) & !missing(wealth_ira)
.     }
. 
.     local pctvars "wealth_core wealth_ira wealth_res wealth_coreira wealth_tota
> l gross_wealth"
.     foreach v of local pctvars {
  2.         sort year `v'
  3.         by year: gen long _rank_`v' = sum(!missing(`v'))
  4.         by year: gen long _N_`v' = _rank_`v'[_N]
  5.         gen int `v'_pct = .
  6.         replace `v'_pct = ceil(100 * _rank_`v' / _N_`v') if !missing(`v')
  7.         drop _rank_`v' _N_`v'
  8.     }
(497,574 missing values generated)
(204,917 real changes made)
(497,574 missing values generated)
(204,950 real changes made)
(497,574 missing values generated)
(204,950 real changes made)
(497,574 missing values generated)
(204,915 real changes made)
(497,574 missing values generated)
(134,508 real changes made)
(497,574 missing values generated)
(191,434 real changes made)
. 
.     capture which binscatter
.     if _rc capture ssc install binscatter, replace
. 
.     foreach yr in 2002 2022 {
  2.         * r1 core, r2 ret, r3 res, r4 Core+ret., r5 net wealth
.         foreach pair in "r1_annual_ wealth_core_pct core Core" "r2_annual_ weal
> th_ira_pct ret Retirement" "r3_annual_ wealth_res_pct res Residential" "r4_annu
> al_ wealth_coreira_pct coreira Core+ret." "r5_annual_ wealth_total_pct netwealt
> h Net wealth" {
  3.             tokenize `pair'
  4.             local retvar "`1'"
  5.             local wvar "`2'"
  6.             local rlab_short "`3'"
  7.             local rlab_abbrev "`4' `5'"
  8.             local rlab_portfolio = cond("`rlab_short'"=="core","core assets"
> ,cond("`rlab_short'"=="ret","retirement assets",cond("`rlab_short'"=="res","res
> idential assets",cond("`rlab_short'"=="coreira","Core+ret.","net wealth"))))
  9.             local wlab = cond("`wvar'"=="wealth_core_pct","core",cond("`wvar
> '"=="wealth_ira_pct","retirement",cond("`wvar'"=="wealth_res_pct","residential"
> ,cond("`wvar'"=="wealth_coreira_pct","core+ret.","total"))))
 10.             quietly count if year == `yr' & !missing(`retvar') & !missing(`w
> var')
 11.             if r(N) < 10 continue
 12. 
.             * Mean + IQR ribbon
.             preserve
 13.             keep if year == `yr'
 14.             collapse (mean) mean_r = `retvar' (p25) p25_r = `retvar' (p75) p
> 75_r = `retvar', by(`wvar')
 15.             twoway (rarea p75_r p25_r `wvar', color(gs12)) (line mean_r `wva
> r', lcolor(navy) lwidth(medthick)), ///
>                 xtitle("Wealth `wlab' (pct.)") ytitle("`rlab_abbrev' return") /
> //
>                 title("Mean/IQR: Returns to `rlab_portfolio' and wealth (`yr')"
> ) legend(off)
 16.             graph export "${DESCRIPTIVE}/Figures/`rlab_short'_return_iqr_by_
> wealthpct_`yr'.png", replace
 17.             restore
 18. 
.             * Binscatter
.             capture binscatter `retvar' `wvar' if year == `yr', nquantiles(50) 
> ///
>                 ytitle("`rlab_abbrev' return") xtitle("Wealth `wlab' (pct.)") /
> //
>                 title("Binscatter: Returns to `rlab_portfolio' and wealth (`yr'
> )")
 19.             if _rc == 0 graph export "${DESCRIPTIVE}/Figures/`rlab_short'_re
> turn_binscatter_`yr'.png", replace
 20.         }
 21.     }
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/core_return_
    > iqr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/core_return_
    > binscatter_2002.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ret_return_i
    > qr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ret_return_b
    > inscatter_2002.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/res_return_i
    > qr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/res_return_b
    > inscatter_2002.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/coreira_retu
    > rn_iqr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/coreira_retu
    > rn_binscatter_2002.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/netwealth_re
    > turn_iqr_by_wealthpct_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/netwealth_re
    > turn_binscatter_2002.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/core_return_
    > iqr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/core_return_
    > binscatter_2022.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ret_return_i
    > qr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ret_return_b
    > inscatter_2022.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/res_return_i
    > qr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/res_return_b
    > inscatter_2022.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/coreira_retu
    > rn_iqr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/coreira_retu
    > rn_binscatter_2022.png saved as PNG format
(452,340 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/netwealth_re
    > turn_iqr_by_wealthpct_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/netwealth_re
    > turn_binscatter_2022.png saved as PNG format
. }

. 
. * ---------------------------------------------------------------------
. * Distribution of returns (histogram): (1) components r1,r2,r3; (2) aggregated 
> r1,r4,r5 (2002 and 2022; winsorized when available)
. * ---------------------------------------------------------------------
. clear

. use "${PROCESSED}/analysis_ready_processed.dta", clear

. display "=== Return distributions (2002 and 2022) ==="
=== Return distributions (2002 and 2022) ===

. local _tdir `c(tmpdir)'

. foreach yr in 2002 2022 {
  2.     capture confirm variable r1_annual_`yr'
  3.     if _rc continue
  4.     * Build one .gph per return (r1â€“r5)
.     foreach r in 1 2 3 4 5 {
  5.         local v "r`r'_annual_`yr'"
  6.         local use_win 0
  7.         capture confirm variable r`r'_annual_win_`yr'
  8.         if !_rc {
  9.             local v "r`r'_annual_win_`yr'"
 10.             local use_win 1
 11.         }
 12.         capture confirm variable `v'
 13.         if _rc continue
 14.         local rname_sub = cond(`r'==1,"Core",cond(`r'==2,"Retirement",cond(`
> r'==3,"Residential",cond(`r'==4,"Core+ret.","Net wealth"))))
 15.         local xtit = cond(`use_win', "Annual return (winsorized 1%)", "Annua
> l return")
 16.         histogram `v' if !missing(`v'), ///
>             bin(80) fraction ///
>             xtitle("`xtit'") ytitle("Fraction of households") ///
>             xlabel(, format(%3.2f)) ///
>             title("`rname_sub'") ///
>             saving("`_tdir'_r`r'_hist_`yr'.gph", replace)
 17.     }
 18.     * Components: r1, r2, r3
.     local gph_comp ""
 19.     foreach r in 1 2 3 {
 20.         capture confirm file "`_tdir'_r`r'_hist_`yr'.gph"
 21.         if !_rc {
 22.             if "`gph_comp'" == "" local gph_comp "`_tdir'_r`r'_hist_`yr'.gph
> "
 23.             else local gph_comp "`gph_comp' `_tdir'_r`r'_hist_`yr'.gph"
 24.         }
 25.     }
 26.     if "`gph_comp'" != "" {
 27.         graph combine `gph_comp', cols(2) title("Returns by portfolio (`yr')
> : components")
 28.         graph export "${DESCRIPTIVE}/Figures/returns_histogram_components_`y
> r'.png", replace
 29.     }
 30.     * Aggregated: r1, r4, r5
.     local gph_agg ""
 31.     foreach r in 1 4 5 {
 32.         capture confirm file "`_tdir'_r`r'_hist_`yr'.gph"
 33.         if !_rc {
 34.             if "`gph_agg'" == "" local gph_agg "`_tdir'_r`r'_hist_`yr'.gph"
 35.             else local gph_agg "`gph_agg' `_tdir'_r`r'_hist_`yr'.gph"
 36.         }
 37.     }
 38.     if "`gph_agg'" != "" {
 39.         graph combine `gph_agg', cols(2) title("Returns by portfolio (`yr'):
>  aggregated")
 40.         graph export "${DESCRIPTIVE}/Figures/returns_histogram_agg_`yr'.png"
> , replace
 41.     }
 42. }
(bin=80, start=-1, width=.09837923)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r1_hist_2002.gph saved
(bin=80, start=-1, width=.06495191)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r2_hist_2002.gph saved
(bin=80, start=-1, width=.03708099)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r3_hist_2002.gph saved
(bin=80, start=-.81130636, width=.04150279)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r4_hist_2002.gph saved
(bin=80, start=-.69379183, width=.04211842)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r5_hist_2002.gph saved
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_hist
    > ogram_components_2002.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_hist
    > ogram_agg_2002.png saved as PNG format
(bin=80, start=-1, width=.10825318)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r1_hist_2022.gph saved
(bin=80, start=-1, width=.09089373)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r2_hist_2022.gph saved
(bin=80, start=-1, width=.04433351)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r3_hist_2022.gph saved
(bin=80, start=-.8203947, width=.04566744)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r4_hist_2022.gph saved
(bin=80, start=-.78424874, width=.05493357)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T/_r5_hist_2022.gph saved
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_hist
    > ogram_components_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/returns_hist
    > ogram_agg_2022.png saved as PNG format

. 
. * ---------------------------------------------------------------------
. * Lorenz curves + Gini table (income + wealth)
. * ---------------------------------------------------------------------
. clear

. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Measures for Lorenz (income, wealth incl. gross, Core+ret.)
. local lorenz_measures "labor_income_real_win total_income_real_win wealth_core 
> wealth_ira wealth_coreira wealth_res wealth_total gross_wealth"

. local lorenz_years "2002 2022"

. 
. * Measures for Gini table (income 2 + wealth 6)
. local gini_measures "labor_income_real_win total_income_real_win wealth_core we
> alth_ira wealth_coreira wealth_res wealth_total gross_wealth"

. local gini_years "2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022"

. 
. * Prepare Lorenz output (use postfile to avoid append issues)
. tempfile lorenz_all

. postfile lor_handle str32 measure int year double cum_pop cum_share using "`lor
> enz_all'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_30768.000017 not
    found)

. 
. * Gini table output
. tempfile gini_out

. postfile gini_handle str32 measure int year double gini obs total_sum using "`g
> ini_out'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_30768.000018 not
    found)

. 
. foreach y of local gini_years {
  2.     foreach m of local gini_measures {
  3.         local v = "`m'_`y'"
  4.         capture confirm variable `v'
  5.         if _rc continue
  6.         preserve
  7.         capture confirm variable `wtvar'
  8.         if !_rc keep `v' `wtvar'
  9.         else keep `v'
 10.         keep if !missing(`v')
 11.         keep if `v' >= 0
 12.         if "`wopt'" != "" {
 13.             keep if !missing(`wtvar') & `wtvar' > 0
 14.         }
 15.         gen double _w = 1
 16.         capture confirm variable `wtvar'
 17.         if !_rc & "`wopt'" != "" replace _w = `wtvar'
 18.         gen double _wy = _w * `v'
 19.         quietly summarize _w, meanonly
 20.         local totalw = r(sum)
 21.         quietly summarize _wy, meanonly
 22.         local totaly = r(sum)
 23.         if (`totalw' <= 0 | `totaly' <= 0) {
 24.             post gini_handle ("`m'") (`y') (.) (r(N)) (`totaly')
 25.             restore
 26.             continue
 27.         }
 28.         sort `v'
 29.         gen double cum_w = sum(_w)/`totalw'
 30.         gen double cum_y = sum(_wy)/`totaly'
 31.         gen double cum_w_l = cum_w[_n-1]
 32.         gen double cum_y_l = cum_y[_n-1]
 33.         replace cum_w_l = 0 in 1
 34.         replace cum_y_l = 0 in 1
 35.         gen double area = (cum_y + cum_y_l) * (cum_w - cum_w_l)
 36.         quietly summarize area, meanonly
 37.         local g = 1 - r(sum)
 38.         post gini_handle ("`m'") (`y') (`g') (r(N)) (`totaly')
 39. 
.         * Save Lorenz points for 2002/2022 (selected measures)
.         if inlist(`y',2002,2022) & inlist("`m'", "labor_income_real_win", "tota
> l_income_real_win", ///
>             "wealth_core", "wealth_ira", "wealth_coreira", "wealth_res", "wealt
> h_total", "gross_wealth") {
 40.             keep cum_w cum_y
 41.             rename cum_w cum_pop
 42.             rename cum_y cum_share
 43.             forvalues i = 1/`=_N' {
 44.                 post lor_handle ("`m'") (`y') (cum_pop[`i']) (cum_share[`i']
> )
 45.             }
 46.         }
 47.         restore
 48.     }
 49. }
(45,234 observations deleted)
(0 observations deleted)
(45,234 observations deleted)
(0 observations deleted)
(25,657 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,656 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,657 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,656 observations deleted)
(171 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(35,604 observations deleted)
(822 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,488 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,069 observations deleted)
(182 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(32,392 observations deleted)
(882 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,824 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,105 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,105 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,113 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,105 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,113 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(25,105 observations deleted)
(224 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(33,551 observations deleted)
(767 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,004 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,765 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,765 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,769 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,765 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,769 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,765 observations deleted)
(197 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(30,898 observations deleted)
(1,010 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,555 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,017 observations deleted)
(227 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(32,073 observations deleted)
(966 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,778 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,200 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,200 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,206 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,201 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,207 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(23,200 observations deleted)
(797 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(33,303 observations deleted)
(1,123 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,722 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,680 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,680 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,682 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,680 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,682 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,681 observations deleted)
(752 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(31,670 observations deleted)
(1,733 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,131 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,487 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,487 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,488 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,488 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,489 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,488 observations deleted)
(428 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(33,180 observations deleted)
(1,492 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(27,791 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,322 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,322 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,326 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,322 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,326 observations deleted)
(2 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(24,322 observations deleted)
(338 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(34,757 observations deleted)
(1,309 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(26,130 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,088 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,088 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,091 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,088 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,091 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(28,088 observations deleted)
(190 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(32,432 observations deleted)
(1,911 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,598 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,511 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,511 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,512 observations deleted)
(1 observation deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,511 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,512 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,511 observations deleted)
(131 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(33,414 observations deleted)
(1,477 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(30,840 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,378 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,378 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,384 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,378 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,384 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(29,378 observations deleted)
(117 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(35,396 observations deleted)
(965 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)
(30,767 observations deleted)
(0 observations deleted)
(1 missing value generated)
(1 missing value generated)
(1 real change made)
(1 real change made)

. postclose gini_handle

. postclose lor_handle

. 
. use "`gini_out'", clear

. local dl = char(92) + char(36)

. file open fh using "${DESCRIPTIVE}/Tables/gini_by_year.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Gini coefficient by 
> measure and year}" _n "\label{tab:gini_by_year}" _n "\begin{tabular}{llrrr}\top
> rule" _n "Measure & Year & Gini & Obs & Total (sum `dl') \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local m = measure[`r']
  3.     local m_lab = cond("`m'"=="labor_income_real_win","Labor income (real, w
> in)",cond("`m'"=="total_income_real_win","Total income (real, win)",cond("`m'"=
> ="wealth_core","Wealth core",cond("`m'"=="wealth_ira","Wealth IRA",cond("`m'"==
> "wealth_coreira","Wealth Core+ret.",cond("`m'"=="wealth_res","Wealth residentia
> l",cond("`m'"=="wealth_total","Wealth total",cond("`m'"=="gross_wealth","Gross 
> wealth","`m'"))))))))
  4.     local yr_s = string(year[`r'], "%9.0f")
  5.     local g_s = string(gini[`r'], "%5.3f")
  6.     local o_s = string(obs[`r'], "%9.0fc")
  7.     local t_s = string(total_sum[`r'], "%12.0fc")
  8.     file write fh "`m_lab' & `yr_s' & `g_s' & `o_s' & `t_s' \\\\" _n
  9. }

. file write fh "\bottomrule" _n "\multicolumn{5}{l}{\footnotesize Total = sum of
>  variable in wave. Income in real USD, winsorized.} \\\\" _n "\end{tabular}" _n
>  "\end{table}" _n

. file close fh

. 
. * Lorenz plots
. use "`lorenz_all'", clear

. 
. * Labels for measures
. gen str40 mlabel = ""
(256,525 missing values generated)

. replace mlabel = "Labor income (real, win)" if measure == "labor_income_real_wi
> n"
(34,021 real changes made)

. replace mlabel = "Total income (real, win)" if measure == "total_income_real_wi
> n"
(34,021 real changes made)

. replace mlabel = "Wealth core" if measure == "wealth_core"
(34,015 real changes made)

. replace mlabel = "Wealth IRA" if measure == "wealth_ira"
(34,021 real changes made)

. replace mlabel = "Wealth Core+ret." if measure == "wealth_coreira"
(34,015 real changes made)

. replace mlabel = "Wealth residential" if measure == "wealth_res"
(33,722 real changes made)

. replace mlabel = "Wealth total" if measure == "wealth_total"
(20,833 real changes made)

. replace mlabel = "Gross wealth" if measure == "gross_wealth"
(31,877 real changes made)

. 
. * Income Lorenz: one graph per year (2002 and 2022 separately)
. twoway line cum_share cum_pop if year==2002 & measure=="labor_income_real_win",
>  lcolor(navy) || ///
>        line cum_share cum_pop if year==2002 & measure=="total_income_real_win",
>  lcolor(blue) ///
>        , title("Lorenz curves: income (2002)") xtitle("Cumulative population sh
> are") ytitle("Cumulative share") ///
>        legend(order(1 "Labor income" 2 "Total income"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_income_2002.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_incom
    > e_2002.png saved as PNG format

. 
. twoway line cum_share cum_pop if year==2022 & measure=="labor_income_real_win",
>  lcolor(navy) || ///
>        line cum_share cum_pop if year==2022 & measure=="total_income_real_win",
>  lcolor(blue) ///
>        , title("Lorenz curves: income (2022)") xtitle("Cumulative population sh
> are") ytitle("Cumulative share") ///
>        legend(order(1 "Labor income" 2 "Total income"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_income_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_incom
    > e_2022.png saved as PNG format

. 
. * Wealth Lorenz: (1) components = core, IRA, residential; (2) aggregated = core
> , Core+ret., net wealth
. * Components (core, IRA, residential)
. twoway line cum_share cum_pop if year==2002 & measure=="wealth_core", lcolor(ma
> roon) || ///
>        line cum_share cum_pop if year==2002 & measure=="wealth_ira", lcolor(red
> ) || ///
>        line cum_share cum_pop if year==2002 & measure=="wealth_res", lcolor(ora
> nge) ///
>        , title("Lorenz curves: wealth components (2002)") xtitle("Cumulative po
> pulation share") ytitle("Cumulative share") ///
>        legend(order(1 "Core" 2 "Retirement (IRA)" 3 "Residential"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_wealth_components_2002.png", replac
> e
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_wealt
    > h_components_2002.png saved as PNG format

. 
. twoway line cum_share cum_pop if year==2022 & measure=="wealth_core", lcolor(ma
> roon) || ///
>        line cum_share cum_pop if year==2022 & measure=="wealth_ira", lcolor(red
> ) || ///
>        line cum_share cum_pop if year==2022 & measure=="wealth_res", lcolor(ora
> nge) ///
>        , title("Lorenz curves: wealth components (2022)") xtitle("Cumulative po
> pulation share") ytitle("Cumulative share") ///
>        legend(order(1 "Core" 2 "Retirement (IRA)" 3 "Residential"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_wealth_components_2022.png", replac
> e
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_wealt
    > h_components_2022.png saved as PNG format

. 
. * Aggregated (core, Core+ret., net wealth)
. twoway line cum_share cum_pop if year==2002 & measure=="wealth_core", lcolor(ma
> roon) || ///
>        line cum_share cum_pop if year==2002 & measure=="wealth_coreira", lcolor
> (magenta) || ///
>        line cum_share cum_pop if year==2002 & measure=="wealth_total", lcolor(g
> reen) ///
>        , title("Lorenz curves: wealth aggregated (2002)") xtitle("Cumulative po
> pulation share") ytitle("Cumulative share") ///
>        legend(order(1 "Core" 2 "Core+ret." 3 "Net wealth"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_wealth_agg_2002.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_wealt
    > h_agg_2002.png saved as PNG format

. 
. twoway line cum_share cum_pop if year==2022 & measure=="wealth_core", lcolor(ma
> roon) || ///
>        line cum_share cum_pop if year==2022 & measure=="wealth_coreira", lcolor
> (magenta) || ///
>        line cum_share cum_pop if year==2022 & measure=="wealth_total", lcolor(g
> reen) ///
>        , title("Lorenz curves: wealth aggregated (2022)") xtitle("Cumulative po
> pulation share") ytitle("Cumulative share") ///
>        legend(order(1 "Core" 2 "Core+ret." 3 "Net wealth"))

. graph export "${DESCRIPTIVE}/Figures/lorenz_wealth_agg_2022.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/lorenz_wealt
    > h_agg_2022.png saved as PNG format

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/07_des
> criptive_returns.log
  log type:  text
 closed on:  17 Feb 2026, 16:27:25
---------------------------------------------------------------------------------
