---------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/08_des
> criptive_controls.log
  log type:  text
 opened on:  19 Feb 2026, 13:55:23

. 
. capture mkdir "${DESCRIPTIVE}"

. capture mkdir "${DESCRIPTIVE}/Figures"

. capture mkdir "${DESCRIPTIVE}/Tables"

. 
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * Respondent weight (optional)
. local wtvar "RwWTRESP"

. capture confirm variable `wtvar'

. local wopt ""

. if !_rc local wopt "[aw=`wtvar']"

. 
. * Label definitions for region and population size
. capture label define region_lbl 1 "Northeast" 2 "Midwest" 3 "South" 4 "West" 5 
> "Other", replace

. capture label define pop_lbl 1 "Less than 1,000" 2 "1,000 to 10,000" 3 "10,000 
> to 50,000" ///
>     4 "50,000 to 100,000" 5 "100,000 to 1 million" 6 "Greater than 1 million" /
> //
>     8 "DK/NA" 9 "Refused", replace

. capture label define pop3_lbl 1 "Small town (<10k)" 2 "Small/med city (10k-100k
> )" 3 "Large metro (100k+)", replace

. capture label define race_eth_lbl 1 "White (NH)" 2 "Black (NH)" 3 "Hispanic" 4 
> "Other (NH)", replace

. foreach v of varlist censreg_* {
  2.     capture label values `v' region_lbl
  3. }

. capture label values population_2020 pop_lbl

. capture label values race_eth race_eth_lbl

. 
. * Program: return display label for variable name (for .tex tables)
. program define _vlabel, rclass
  1.     args v
  2.     return local vlabel "`v'"
  3.     if "`v'"=="trust_others_2020" return local vlabel "General trust"
  4.     if "`v'"=="trust_social_security_2020" return local vlabel "Social Secur
> ity"
  5.     if "`v'"=="trust_medicare_2020" return local vlabel "Medicare"
  6.     if "`v'"=="trust_banks_2020" return local vlabel "Banks"
  7.     if "`v'"=="trust_advisors_2020" return local vlabel "Financial advisors"
  8.     if "`v'"=="trust_mutual_funds_2020" return local vlabel "Mutual funds"
  9.     if "`v'"=="trust_insurance_2020" return local vlabel "Insurance"
 10.     if "`v'"=="trust_media_2020" return local vlabel "Media"
 11.     if "`v'"=="depression_2020" return local vlabel "Depression"
 12.     if "`v'"=="health_cond_2020" return local vlabel "Health conditions"
 13.     if "`v'"=="medicare_2020" return local vlabel "Medicare"
 14.     if "`v'"=="medicaid_2020" return local vlabel "Medicaid"
 15.     if "`v'"=="life_ins_2020" return local vlabel "Life insurance"
 16.     if "`v'"=="num_divorce_2020" return local vlabel "Times divorced"
 17.     if "`v'"=="num_widow_2020" return local vlabel "Times widowed"
 18.     if "`v'"=="age_2020" return local vlabel "Age"
 19.     if "`v'"=="educ_yrs" return local vlabel "Years of education"
 20.     if "`v'"=="gender" return local vlabel "Female"
 21.     if "`v'"=="immigrant" return local vlabel "Immigrant"
 22.     if "`v'"=="born_us" return local vlabel "Born in U.S."
 23.     if "`v'"=="race_eth" return local vlabel "Race/ethnicity"
 24.     if "`v'"=="married_2020" return local vlabel "Married"
 25.     if "`v'"=="inlbrf_2020" return local vlabel "Labor force status"
 26.     if "`v'"=="interest_2020" return local vlabel "Interest"
 27.     if "`v'"=="inflation_2020" return local vlabel "Inflation"
 28.     if "`v'"=="risk_div_2020" return local vlabel "Risk diversification"
 29.     if "`v'"=="par_citizen_2020" return local vlabel "Parent citizenship"
 30.     if "`v'"=="par_loyalty_2020" return local vlabel "Parent loyalty"
 31.     if "`v'"=="population_2020" return local vlabel "Population size"
 32. end

. 
. * ---------------------------------------------------------------------
. * Demographics: general controls + race + employment (2020) -> demographics_gen
> eral.tex
. * Uses wide analysis_ready_processed.dta: one row per respondent.
. * ---------------------------------------------------------------------
. preserve

.     keep if !missing(age_2020)
(29,511 observations deleted)

.     gen byte female = (gender == 2) if !missing(gender)

. 
.     file open fh using "${DESCRIPTIVE}/Tables/demographics_general.tex", write 
> replace

.     file write fh "\begin{table}[htbp]\centering\small" _n ///
>         "\caption{Demographics: general controls (2020)}" _n ///
>         "\label{tab:demographics_general}" _n ///
>         "\begin{tabular}{lrrr}\toprule" _n ///
>         "Variable & N & Mean & SD \\\\ \midrule" _n

. 
.     * General controls (2020 sample)
.     foreach v in age_2020 female educ_yrs married_2020 immigrant born_us {
  2.         capture confirm variable `v'
  3.         if _rc continue
  4.         quietly summarize `v' `wopt'
  5.         if r(N) == 0 continue
  6.         local vlab "`v'"
  7.         if "`v'"=="age_2020" local vlab "Age"
  8.         if "`v'"=="female" local vlab "Female"
  9.         if "`v'"=="educ_yrs" local vlab "Years of education"
 10.         if "`v'"=="married_2020" local vlab "Married"
 11.         if "`v'"=="immigrant" local vlab "Immigrant"
 12.         if "`v'"=="born_us" local vlab "Born in U.S."
 13.         local n_s = string(r(N), "%9.0f")
 14.         local m_s = string(r(mean), "%9.3f")
 15.         local s_s = string(r(sd), "%9.3f")
 16.         file write fh "`vlab' & `n_s' & `m_s' & `s_s' \\\\" _n
 17.     }

. 
.     * Race: one row per category (2020 sample)
.     capture confirm variable race_eth

.     if !_rc {
.         tempfile demog_work
.         save "`demog_work'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000003 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000003 saved as
    .dta format
.         if "`wopt'" != "" {
.             gen byte _one = 1
.             collapse (sum) n=_one `wopt', by(race_eth)
.         }
.         else {
.             contract race_eth, freq(n)
.         }
.         drop if missing(race_eth)
(1 observation deleted)
.         egen long total_n = total(n)
.         gen double pct = n / total_n
.         gen double sd_p = sqrt(pct * (1 - pct))
.         label values race_eth race_eth_lbl
.         decode race_eth, gen(race_lab)
.         forvalues r = 1/`=_N' {
  2.             local rlab = race_lab[`r']
  3.             local n_r = string(n[`r'], "%9.0f")
  4.             local pct_s = string(pct[`r'], "%9.3f")
  5.             local sd_s = string(sd_p[`r'], "%9.3f")
  6.             file write fh "Race: `rlab' & `n_r' & `pct_s' & `sd_s' \\\\" _n
  7.         }
.         use "`demog_work'", clear
.     }

. 
.     * Employment: Working (proportion); verify inlbrf_2020 is dummy (1=working)
.     capture confirm variable inlbrf_2020

.     if !_rc {
.         quietly summarize inlbrf_2020 `wopt'
.         local n_s = string(r(N), "%9.0f")
.         local m_s = string(r(mean), "%9.3f")
.         local s_s = string(r(sd), "%9.3f")
.         file write fh "Working (in labor force) & `n_s' & `m_s' & `s_s' \\\\" _
> n
.     }

. 
.     file write fh "\bottomrule" _n ///
>         "\multicolumn{4}{l}{\footnotesize 2020. Mean and SD; for dummies/catego
> ries mean = proportion (pct). Respondent weights used when available.} \\\\" _n
>  ///
>         "\end{tabular}\end{table}" _n

.     file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Summaries: trust, fin lit, IVs
. * ---------------------------------------------------------------------
. display "=== Trust variables summary ==="
=== Trust variables summary ===

. summarize trust_others_2020 trust_social_security_2020 trust_medicare_2020 trus
> t_banks_2020 ///
>     trust_advisors_2020 trust_mutual_funds_2020 trust_insurance_2020 trust_medi
> a_2020 `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
trust_o~2020 |        900         5.4    2.615518          0         10
trust_s~2020 |      1,013    5.765054    2.819344          0         10
trus~re_2020 |      1,029    5.797862    2.692394          0         10
trust_b~2020 |        990    5.352525    2.930259          0         10
trust_a~2020 |      1,080    4.294444    2.852306          0         10
-------------+---------------------------------------------------------
trust_mutu~0 |      1,072     4.29291    2.761957          0         10
trust_i~2020 |      1,147     4.34612    2.601783          0         10
trust~a_2020 |      1,235    2.974089    2.602699          0         10

. 
. display "=== Financial literacy + IV variables summary ==="
=== Financial literacy + IV variables summary ===

. summarize interest_2020 inflation_2020 risk_div_2020 ///
>     par_citizen_2020 par_loyalty_2020 population_2020 `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
interes~2020 |      1,302    2.620584    .6828121          1          3
inflati~2020 |      1,273    2.663001    .6530211          1          3
risk_di~2020 |      1,072    4.018657    1.721948          1          5
par_cit~2020 |      1,028    9.337549    1.883116          0         10
par_loy~2020 |      1,019    7.078508    3.310061          0         10
-------------+---------------------------------------------------------
popu~on_2020 |      1,114    3.685817    1.400178          1          6

. 
. display "=== Additional trust regression controls summary ==="
=== Additional trust regression controls summary ===

. summarize depression_2020 health_cond_2020 medicare_2020 medicaid_2020 life_ins
> _2020 ///
>     num_divorce_2020 num_widow_2020 `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
depress~2020 |     14,998    1.545673    2.043636          0          8
health_~2020 |     15,723    2.389811    1.560138          0          8
medicar~2020 |     15,498    .5965931    .4905969          0          1
medicai~2020 |     15,383    .1400247    .3470239          0          1
life_in~2020 |     15,340    .5257497    .4993528          0          1
-------------+---------------------------------------------------------
num_div~2020 |     15,723    .5722826     .793715          0          5
num_wid~2020 |     15,723    .2203778    .4492705          0          3

. 
. display "=== Contextual trust IVs summary ==="
=== Contextual trust IVs summary ===

. summarize townsize_trust_* pop_trust_* regional_trust_* `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
townsize_~00 |     45,234    5.220774    .1130603        3.5         10
townsize_~02 |     45,234    5.240723    .1024772   3.636364         10
townsize_~04 |     45,234    5.186406    .1029318   3.928571   7.833333
townsize_~06 |     45,233    5.150312    .1118687          4   8.666667
townsize_~08 |     45,234    5.154008    .1102435          4   8.666667
-------------+---------------------------------------------------------
townsize_~10 |     45,234     5.12249    .0932803        4.5        6.6
townsize_~12 |     45,234    5.119932    .0877161        4.5          7
townsize_~14 |     45,234    5.159663    .0775808        4.5          7
townsize_~16 |     45,234     5.28655    .0594688   4.666667          7
townsize_~18 |     45,233    5.188839    .0667908   4.666667   6.230769
-------------+---------------------------------------------------------
townsize_~20 |     45,233    5.384855    .0544647   4.666667   6.230769
townsize_~22 |     45,233    5.362429    .0588273      4.625          6
pop_tru~2000 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2002 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2004 |     45,234    5.384718    .0270688   5.102804   5.590164
-------------+---------------------------------------------------------
pop_tru~2006 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2008 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2010 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2012 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2014 |     45,234    5.384718    .0270688   5.102804   5.590164
-------------+---------------------------------------------------------
pop_tru~2016 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2018 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2020 |     45,234    5.384718    .0270688   5.102804   5.590164
pop_tru~2022 |     45,234    5.384718    .0270688   5.102804   5.590164
regiona~2000 |     45,234    5.641948    .6968583          5     6.8125
-------------+---------------------------------------------------------
regiona~2002 |     45,234    5.567385     .603153          5   6.647059
regiona~2004 |     45,234    5.445502    .5056923          5   6.521739
regiona~2006 |     45,234    5.413115    .5509216          5   6.755556
regiona~2008 |     45,234    5.383481    .5041052          5   6.622222
regiona~2010 |     45,234    5.287002     .328685          5   6.083969
-------------+---------------------------------------------------------
regiona~2012 |     45,234    5.245997    .3370254   4.986784   6.007576
regiona~2014 |     45,234    5.250104    .2796246   5.048458          6
regiona~2016 |     45,234    5.084603    .3524174   4.785714          6
regiona~2018 |     45,234     4.95366    .4292827   4.633803   5.815789
regiona~2020 |     15,723    5.413185    .1825532          5    5.72956
-------------+---------------------------------------------------------
regiona~2022 |     45,234    5.425236    .3572859        3.5        6.7

. 
. display "=== Region + population summaries ==="
=== Region + population summaries ===

. summarize population_2020 `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
popu~on_2020 |      1,114    3.685817    1.400178          1          6

. summarize censreg_* `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
censreg_2000 |     19,578    2.592604    .9667457          1          5
censreg_2002 |     18,165    2.603799    .9646225          1          5
censreg_2004 |     20,129    2.624373    .9763418          1          5
censreg_2006 |     18,469    2.633873    .9699918          1          5
censreg_2008 |     17,217    2.641169    .9674999          1          5
-------------+---------------------------------------------------------
censreg_2010 |     22,034    2.683262    .9776351          1          5
censreg_2012 |     20,554     2.69062    .9770303          1          5
censreg_2014 |     18,747    2.696645    .9781519          1          5
censreg_2016 |     20,912    2.730777    .9659269          1          5
censreg_2018 |     17,146    2.741514    .9629591          1          5
-------------+---------------------------------------------------------
censreg_2020 |     15,723    2.752719     .963808          1          5
censreg_2022 |     12,883    2.767989     .965542          1          5

. summarize region_pop_group_* `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
region_pop.. |        310    267.5903    93.22491        101        505
region_pop.. |        320    268.4438    93.72967        101        505
region_pop.. |        483    270.9752     99.0455        101        505
region_pop.. |        489    271.5706    98.64602        101        505
region_pop.. |        493    271.4462    97.95228        101        505
-------------+---------------------------------------------------------
region_pop.. |        829    272.9747    98.87384        101        505
region_pop.. |        842     272.981    99.50531        101        506
region_pop.. |        838    273.0573    99.43198        101        506
region_pop.. |      1,077     276.467     98.7665        101        506
region_pop.. |      1,014     276.858    98.20344        101        506
-------------+---------------------------------------------------------
region_pop.. |      1,114    276.6661    98.04547        101        506
region_pop.. |        889    275.5973    98.70103        101        506

. summarize hometown_size_* `wopt'

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hometow~2000 |        310    267.5903    93.22491        101        505
hometow~2002 |        320    268.4438    93.72967        101        505
hometow~2004 |        483    270.9752     99.0455        101        505
hometow~2006 |        489    271.5706    98.64602        101        505
hometow~2008 |        493    271.4462    97.95228        101        505
-------------+---------------------------------------------------------
hometow~2010 |        829    272.9747    98.87384        101        505
hometow~2012 |        842     272.981    99.50531        101        506
hometow~2014 |        838    273.0573    99.43198        101        506
hometow~2016 |      1,077     276.467     98.7665        101        506
hometow~2018 |      1,014     276.858    98.20344        101        506
-------------+---------------------------------------------------------
hometow~2020 |      1,114    276.6661    98.04547        101        506
hometow~2022 |        889    275.5973    98.70103        101        506

. 
. * Export label mappings for region and population
. preserve

. clear

. input byte code str30 label

         code                           label
  1. 1 "Northeast"
  2. 2 "Midwest"
  3. 3 "South"
  4. 4 "West"
  5. 5 "Other"
  6. end

. file open fh using "${DESCRIPTIVE}/Tables/region_labels.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Region code labels}"
>  _n "\label{tab:region_labels}" _n "\begin{tabular}{rl}\toprule" _n "Code & Reg
> ion \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local c = string(code[`r'], "%9.0f")
  3.     local lab = label[`r']
  4.     file write fh "`c' & `lab' \\\\" _n
  5. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. preserve

. clear

. input byte code str30 label

         code                           label
  1. 1 "Less than 1,000"
  2. 2 "1,000 to 10,000"
  3. 3 "10,000 to 50,000"
  4. 4 "50,000 to 100,000"
  5. 5 "100,000 to 1 million"
  6. 6 "Greater than 1 million"
  7. 8 "DK/NA"
  8. 9 "Refused"
  9. end

. file open fh using "${DESCRIPTIVE}/Tables/population_labels.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Population size (hom
> etown) code labels}" _n "\label{tab:population_labels}" _n "\begin{tabular}{rl}
> \toprule" _n "Code & Population size \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local c = string(code[`r'], "%9.0f")
  3.     local plab = label[`r']
  4.     file write fh "`c' & `plab' \\\\" _n
  5. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Demographics: demographics.tex = general (age, gender, educ, marital, immigra
> nt, born US) + race + employment.
. * demographics_other.tex = other controls – same style as finlit.
. preserve

. 
. * -----------------------------------------------------------------------
. * demographics.tex: general vars + race + employment, all restricted to 2020 sa
> mple
. * 2020 sample defined by nonmissing age_2020.
. * -----------------------------------------------------------------------
. keep if !missing(age_2020)
(29,511 observations deleted)

. 
. file open fh using "${DESCRIPTIVE}/Tables/demographics.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Demographics (
> 2020)}" _n "\label{tab:demographics}" _n "\begin{tabular}{lrrr}\toprule" _n "Va
> riable & N & Mean & SD \\\\ \midrule" _n

. 
. foreach v in age_2020 gender educ_yrs married_2020 immigrant born_us {
  2.     capture confirm variable `v'
  3.     if _rc continue
  4.     quietly summarize `v' `wopt'
  5.     if r(N) == 0 continue
  6.     _vlabel `v'
  7.     local vlab `r(vlabel)'
  8.     local n_s = string(r(N), "%9.0f")
  9.     local m_s = string(r(mean), "%9.3f")
 10.     local s_s = string(r(sd), "%9.3f")
 11.     file write fh "`vlab' & `n_s' & `m_s' & `s_s' \\\\" _n
 12. }

. 
. * Race: one row per category (2020 sample)
. capture confirm variable race_eth

. if !_rc {
.     tempfile demog_work
.     save "`demog_work'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000007 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000007 saved as
    .dta format
.     contract race_eth, freq(n)
.     drop if missing(race_eth)
(1 observation deleted)
.     egen long total_n = total(n)
.     gen double pct = 100 * n / total_n
.     gen double sd_p = 100 * sqrt((pct/100) * (1 - pct/100))
.     label values race_eth race_eth_lbl
.     decode race_eth, gen(race_lab)
.     forvalues r = 1/`=_N' {
  2.         local rlab = race_lab[`r']
  3.         local n_r = string(n[`r'], "%9.0f")
  4.         local pct_s = string(pct[`r'], "%9.1f")
  5.         local sd_s = string(sd_p[`r'], "%9.2f")
  6.         file write fh "Race: `rlab' & `n_r' & `pct_s' & `sd_s' \\\\" _n
  7.     }
.     use "`demog_work'", clear
. }

. 
. * Employment: one row only — Working (proportion); no code labels (2020 sample)
. capture confirm variable inlbrf_2020

. if !_rc {
.     tempfile demog_work
.     save "`demog_work'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000008 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000008 saved as
    .dta format
.     contract inlbrf_2020, freq(n)
.     drop if missing(inlbrf_2020)
(5 observations deleted)
.     egen long total_n = total(n)
.     gen double pct = 100 * n / total_n
.     gen double sd_p = 100 * sqrt((pct/100) * (1 - pct/100))
.     forvalues r = 1/`=_N' {
  2.         if inlbrf_2020[`r'] != 1 continue
  3.         local n_r = string(n[`r'], "%9.0f")
  4.         local pct_s = string(pct[`r'], "%9.1f")
  5.         local sd_s = string(sd_p[`r'], "%9.2f")
  6.         file write fh "Working & `n_r' & `pct_s' & `sd_s' \\\\" _n
  7.         break
  8.     }
.     use "`demog_work'", clear
. }

. 
. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize 2020. Mean and
>  SD; for dummies/categories mean = proportion (pct).} \\\\" _n "\end{tabular}\e
> nd{table}" _n

. file close fh

. restore

. 
. * -----------------------------------------------------------------------
. * demographics_other.tex: other controls – same style as finlit (Variable, N, M
> ean, SD, p50)
. * -----------------------------------------------------------------------
. file open fh using "${DESCRIPTIVE}/Tables/demographics_other.tex", write replac
> e

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Demographics: 
> other controls (2020)}" _n "\label{tab:demographics_other}" _n "\begin{tabular}
> {lrrrr}\toprule" _n "Variable & N & Mean & SD & p50 \\\\ \midrule" _n

. 
. foreach pair in "depression_2020 Depression" "health_cond_2020 Health condition
> s" "medicare_2020 Medicare" "medicaid_2020 Medicaid" "life_ins_2020 Life insura
> nce" "num_divorce_2020 Times divorced" "num_widow_2020 Times widowed" {
  2.     tokenize `pair'
  3.     local v "`1'"
  4.     local vlab "`2'"
  5.     if "`3'" != "" local vlab "`vlab' `3'"
  6.     capture confirm variable `v'
  7.     if _rc continue
  8.     quietly summarize `v', detail
  9.     if r(N) == 0 continue
 10.     local n_s = string(r(N), "%9.0f")
 11.     local m_s = string(r(mean), "%9.2f")
 12.     local s_s = string(r(sd), "%9.2f")
 13.     local p50_s = string(r(p50), "%9.2f")
 14.     file write fh "`vlab' & `n_s' & `m_s' & `s_s' & `p50_s' \\\\" _n
 15. }

. 
. file write fh "\bottomrule" _n "\multicolumn{5}{l}{\footnotesize 2020. Mean, SD
> , and median.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. 
. * Financial literacy summary (2020): rv565_2020=Interest, rv566_2020=Inflation,
>  rv567_2020=Risk diversification (HRS 2020)
. preserve

. capture confirm variable year

. if !_rc keep if year == 2020

. * Use renamed vars if present, else raw rv* (so table works whether 03 prep ran
>  or not)
. foreach v in interest_2020 inflation_2020 risk_div_2020 {
  2.     capture confirm variable `v'
  3.     if _rc {
  4.         if "`v'"=="interest_2020"  capture gen interest_2020  = rv565_2020
  5.         if "`v'"=="inflation_2020" capture gen inflation_2020 = rv566_2020
  6.         if "`v'"=="risk_div_2020"  capture gen risk_div_2020  = rv567_2020
  7.     }
  8. }

. file open fh using "${DESCRIPTIVE}/Tables/finlit_summary.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Financial literacy s
> ummary (2020)}" _n "\label{tab:finlit_summary}" _n "\begin{tabular}{lrrrr}\topr
> ule" _n "Variable & N & Mean & SD & p50 \\\\ \midrule" _n

. * Fixed mapping: rv565_2020=Interest, rv566_2020=Inflation, rv567_2020=Risk div
> ersification (HRS 2020)
. foreach pair in "interest_2020 Interest" "inflation_2020 Inflation" "risk_div_2
> 020 Risk diversification" {
  2.     tokenize `pair'
  3.     local v "`1'"
  4.     local vlab "`2'"
  5.     capture confirm variable `v'
  6.     if _rc continue
  7.     quietly summarize `v' `wopt', detail
  8.     if r(N) == 0 continue
  9.     local n_s = string(r(N), "%9.0f")
 10.     local m_s = string(r(mean), "%9.2f")
 11.     local s_s = string(r(sd), "%9.2f")
 12.     local p50_s = string(r(p50), "%9.2f")
 13.     file write fh "`vlab' & `n_s' & `m_s' & `s_s' & `p50_s' \\\\" _n
 14. }

. file write fh "\bottomrule" _n "\multicolumn{5}{l}{\footnotesize HRS 2020: rv56
> 5 (interest), rv566 (inflation), rv567 (risk diversification).} \\\\" _n "\end{
> tabular}\end{table}" _n

. file close fh

. restore

. 
. * Population size summary (2020)
. preserve

. capture confirm variable population_2020

. if !_rc {
.     quietly summarize population_2020 `wopt', detail
.     file open fh using "${DESCRIPTIVE}/Tables/population_summary.tex", write re
> place
.     file write fh "\begin{table}[htbp]\centering" _n "\caption{Population size 
> (hometown) summary (2020)}" _n "\label{tab:population_summary}" _n "\begin{tabu
> lar}{lrrr}\toprule" _n "Variable & N & Mean & SD \\\\ \midrule" _n
.     local n_s = string(r(N), "%9.0f")
.     local m_s = string(r(mean), "%9.2f")
.     local s_s = string(r(sd), "%9.2f")
.     file write fh "Population size (code) & `n_s' & `m_s' & `s_s' \\\\" _n
.     file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize 2020 sampl
> e.} \\\\" _n "\end{tabular}\end{table}" _n
.     file close fh
. }

. restore

. 
. * Overlap diagnostics: trust with region/pop groupings
. display "=== Overlap: trust x region (2020 only) ==="
=== Overlap: trust x region (2020 only) ===

. preserve

. keep hhidpn trust_others_2020 censreg_* 

. reshape long censreg_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  14   ->   4           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
-----------------------------------------------------------------------------

. keep if year == 2020
(497,574 observations deleted)

. keep if !missing(trust_others_2020) & !missing(censreg_)
(44,334 observations deleted)

. decode censreg_, gen(region_label)

. contract year censreg_ region_label, freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/trust_region_groups_2020.tex", write 
> replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Trust and region ove
> rlap (2020): observations by region}" _n "\label{tab:trust_region_groups_2020}"
>  _n "\begin{tabular}{rrlr}\toprule" _n "Year & Region (code) & Region & Obs \\\
> \ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local reg_s = string(censreg_[`r'], "%9.0f")
  4.     local rlab = region_label[`r']
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`yr_s' & `reg_s' & `rlab' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Sample: 2020 w
> ave, nonmissing general trust.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. display "=== Overlap: trust x region_pop_group (2020 only) ==="
=== Overlap: trust x region_pop_group (2020 only) ===

. preserve

. keep hhidpn trust_others_2020 censreg_* population_2020

. reshape long censreg_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  15   ->   5           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
-----------------------------------------------------------------------------

. keep if year == 2020
(497,574 observations deleted)

. keep if !missing(trust_others_2020) & !missing(censreg_) & !missing(population_
> 2020)
(44,511 observations deleted)

. decode censreg_, gen(region_label)

. decode population_2020, gen(pop_label)

. gen int region_pop_group = censreg_ * 100 + population_2020

. contract year censreg_ region_label population_2020 pop_label region_pop_group,
>  freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/trust_regionpop_groups_2020.tex", wri
> te replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Trust and region--po
> pulation overlap (2020)}" _n "\label{tab:trust_regionpop_groups_2020}" _n "\beg
> in{tabular}{rrllrr}\toprule" _n "Year & Region (code) & Region & Pop (code) & P
> opulation size & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local reg_s = string(censreg_[`r'], "%9.0f")
  4.     local rlab = region_label[`r']
  5.     local pop_s = string(population_2020[`r'], "%9.0f")
  6.     local plab = pop_label[`r']
  7.     local n_s = string(n[`r'], "%9.0f")
  8.     file write fh "`yr_s' & `reg_s' & `rlab' & `pop_s' & `plab' & `n_s' \\\\
> " _n
  9. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. display "=== Overlap: trust x region_pop3_group (2020 only) ==="
=== Overlap: trust x region_pop3_group (2020 only) ===

. preserve

. keep hhidpn trust_others_2020 censreg_2020 population_3bin_2020

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & !missing(populat
> ion_3bin_2020)
(44,511 observations deleted)

. label values censreg_2020 region_lbl

. label values population_3bin_2020 pop3_lbl

. decode censreg_2020, gen(region_label)

. decode population_3bin_2020, gen(pop3_label)

. gen int region_pop3_group = censreg_2020 * 10 + population_3bin_2020

. contract censreg_2020 region_label population_3bin_2020 pop3_label region_pop3_
> group, freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/trust_regionpop3_groups_2020.tex", wr
> ite replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Trust and region--po
> pulation (3 bins) overlap (2020)}" _n "\label{tab:trust_regionpop3_groups_2020}
> " _n "\begin{tabular}{rllrr}\toprule" _n "Region (code) & Region & Pop3 (code) 
> & Population & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_2020[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local p3_s = string(population_3bin_2020[`r'], "%9.0f")
  5.     local p3lab = pop3_label[`r']
  6.     local n_s = string(n[`r'], "%9.0f")
  7.     file write fh "`r_s' & `rlab' & `p3_s' & `p3lab' & `n_s' \\\\" _n
  8. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. display "=== Bin counts: region, population, townsize3 (2020 only) ==="
=== Bin counts: region, population, townsize3 (2020 only) ===

. preserve

. keep if !missing(trust_others_2020)
(44,334 observations deleted)

. label values censreg_2020 region_lbl

. label values population_2020 pop_lbl

. label values population_3bin_2020 pop3_lbl

. contract censreg_2020, freq(n)

. decode censreg_2020, gen(region_label)

. file open fh using "${DESCRIPTIVE}/Tables/bin_counts_censreg_2020.tex", write r
> eplace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Bin counts by region
>  (2020)}" _n "\label{tab:bin_counts_censreg_2020}" _n "\begin{tabular}{rlr}\top
> rule" _n "Region (code) & Region & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_2020[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`r_s' & `rlab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020)
(44,334 observations deleted)

. label values population_2020 pop_lbl

. contract population_2020, freq(n)

. decode population_2020, gen(pop_label)

. file open fh using "${DESCRIPTIVE}/Tables/bin_counts_population_2020.tex", writ
> e replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Bin counts by popula
> tion size (2020)}" _n "\label{tab:bin_counts_population_2020}" _n "\begin{tabul
> ar}{rlr}\toprule" _n "Population (code) & Population size & Obs \\\\ \midrule" 
> _n

. forvalues r = 1/`=_N' {
  2.     local p_s = string(population_2020[`r'], "%9.0f")
  3.     local plab = pop_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`p_s' & `plab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020)
(44,334 observations deleted)

. label values population_3bin_2020 pop3_lbl

. contract population_3bin_2020, freq(n)

. decode population_3bin_2020, gen(pop3_label)

. file open fh using "${DESCRIPTIVE}/Tables/bin_counts_population3_2020.tex", wri
> te replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Bin counts by popula
> tion (3 bins, 2020)}" _n "\label{tab:bin_counts_population3_2020}" _n "\begin{t
> abular}{rlr}\toprule" _n "Pop3 (code) & Population & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local p3_s = string(population_3bin_2020[`r'], "%9.0f")
  3.     local p3lab = pop3_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`p3_s' & `p3lab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & !missing(populat
> ion_2020)
(44,511 observations deleted)

. label values censreg_2020 region_lbl

. label values population_2020 pop_lbl

. gen int region_pop_group = censreg_2020 * 100 + population_2020

. decode censreg_2020, gen(region_label)

. decode population_2020, gen(pop_label)

. contract censreg_2020 region_label population_2020 pop_label region_pop_group, 
> freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/bin_counts_regionpop_2020.tex", write
>  replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Bin counts by region
> --population (2020)}" _n "\label{tab:bin_counts_regionpop_2020}" _n "\begin{tab
> ular}{llr}\toprule" _n "Region & Population size & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local rlab = region_label[`r']
  3.     local plab = pop_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`rlab' & `plab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule" _n "\multicolumn{3}{l}{\footnotesize Sample: 2020, 
> nonmissing general trust, region, and population.} \\\\" _n "\end{tabular}\end{
> table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & !missing(populat
> ion_3bin_2020)
(44,511 observations deleted)

. label values censreg_2020 region_lbl

. label values population_3bin_2020 pop3_lbl

. gen int region_pop3_group = censreg_2020 * 10 + population_3bin_2020

. decode censreg_2020, gen(region_label)

. decode population_3bin_2020, gen(pop3_label)

. contract censreg_2020 region_label population_3bin_2020 pop3_label region_pop3_
> group, freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/bin_counts_regionpop3_2020.tex", writ
> e replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Bin counts by region
> --population (3 bins, 2020)}" _n "\label{tab:bin_counts_regionpop3_2020}" _n "\
> begin{tabular}{llr}\toprule" _n "Region & Population & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local rlab = region_label[`r']
  3.     local p3lab = pop3_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`rlab' & `p3lab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Mean trust by race/ethnicity (2020): one table + one bar chart per trust vari
> able (trust module: rv557=general, rv558=Social Security, rv559=Medicare, rv560
> =banks, rv561=advisors, rv562=mutual funds, rv563=insurance, rv564=media)
. * ---------------------------------------------------------------------
. display "=== Mean trust by race/ethnicity (2020), each trust variable ==="
=== Mean trust by race/ethnicity (2020), each trust variable ===

. capture confirm variable race_eth

. if !_rc {
.     local ntrust 8
.     local tvars "trust_others_2020 trust_social_security_2020 trust_medicare_20
> 20 trust_banks_2020 trust_advisors_2020 trust_mutual_funds_2020 trust_insurance
> _2020 trust_media_2020"
.     * Display names for titles/captions (match trust module)
.     local tname1 "General trust"
.     local tname2 "Social Security"
.     local tname3 "Medicare"
.     local tname4 "Banks"
.     local tname5 "Financial advisors"
.     local tname6 "Mutual funds"
.     local tname7 "Insurance"
.     local tname8 "Media"
.     forvalues i = 1/`ntrust' {
  2.         local tvar : word `i' of `tvars'
  3.         capture confirm variable `tvar'
  4.         if _rc continue
  5.         local tname `tname`i''
  6.         preserve
  7.         keep if !missing(`tvar') & !missing(race_eth)
  8.         label values race_eth race_eth_lbl
  9.         collapse (mean) trust_mean=`tvar' (count) n=`tvar' `wopt', by(race_e
> th)
 10.         decode race_eth, gen(race_label)
 11.         local stub = subinstr("`tvar'", "trust_", "", .)
 12.         local stub = subinstr("`stub'", "_2020", "", .)
 13.         * LaTeX table
.         file open fh using "${DESCRIPTIVE}/Tables/trust_mean_by_race_eth_`stub'
> _2020.tex", write replace
 14.         file write fh "\begin{table}[htbp]\centering" _n ///
>             "\caption{Mean `tname' by race/ethnicity (2020)}" _n ///
>             "\label{tab:trust_mean_by_race_eth_`stub'_2020}" _n ///
>             "\begin{tabular}{lrr}\toprule" _n ///
>             "Race/ethnicity & Mean trust & Obs \\\\ \midrule" _n
 15.         forvalues r = 1/`=_N' {
 16.             local rlab = race_label[`r']
 17.             local t_s = string(trust_mean[`r'], "%9.3f")
 18.             local n_s = string(n[`r'], "%9.0f")
 19.             file write fh "`rlab' & `t_s' & `n_s' \\\\" _n
 20.         }
 21.         file write fh "\bottomrule" _n "\multicolumn{3}{l}{\footnotesize Tru
> st: `tname' (2020); NH = non-Hispanic.} \\\\" _n "\end{tabular}" _n "\end{table
> }" _n
 22.         file close fh
 23.         * Bar chart
.         graph bar trust_mean, over(race_eth, relabel(1 "White (NH)" 2 "Black (N
> H)" 3 "Hispanic" 4 "Other (NH)")) ///
>             title("Mean `tname' by race/ethnicity (2020)") ///
>             ytitle("Mean trust") b1title("Race/ethnicity") ///
>             bar(1, color(navy)) ylabel(, format(%3.2f))
 24.         graph export "${DESCRIPTIVE}/Figures/trust_mean_by_race_eth_`stub'_2
> 020.png", replace
 25.         restore
 26.     }
(44,335 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_others_2020.png saved as PNG format
(44,222 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_social_security_2020.png saved as PNG format
(44,206 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_medicare_2020.png saved as PNG format
(44,245 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_banks_2020.png saved as PNG format
(44,155 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_advisors_2020.png saved as PNG format
(44,163 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_mutual_funds_2020.png saved as PNG format
(44,088 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_insurance_2020.png saved as PNG format
(44,000 observations deleted)
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_mean_b
    > y_race_eth_media_2020.png saved as PNG format
. }

. 
. display "=== Mean trust by region, population, population3 (2020 only) ==="
=== Mean trust by region, population, population3 (2020 only) ===

. preserve

. keep if !missing(trust_others_2020) & !missing(censreg_2020)
(44,334 observations deleted)

. label values censreg_2020 region_lbl

. collapse (mean) trust_mean=trust_others_2020 (count) n=trust_others_2020 `wopt'
> , by(censreg_2020)

. decode censreg_2020, gen(region_label)

. file open fh using "${DESCRIPTIVE}/Tables/trust_mean_by_censreg_2020.tex", writ
> e replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean trust by region
>  (2020)}" _n "\label{tab:trust_mean_by_censreg_2020}" _n "\begin{tabular}{rlrr}
> \toprule" _n "Region (code) & Region & Mean trust & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_2020[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local tm_s = string(trust_mean[`r'], "%9.4f")
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`r_s' & `rlab' & `tm_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize General trust 
> (2020), nonmissing region.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Region counts: 4 columns (Northeast, Midwest, South, West), no Other
. preserve

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & censreg_2020 <= 
> 4
(44,335 observations deleted)

. contract censreg_2020, freq(n)

. label values censreg_2020 region_lbl

. decode censreg_2020, gen(region_label)

. * One row: four region counts in order 1..4
. local n1 0

. local n2 0

. local n3 0

. local n4 0

. forvalues r = 1/`=_N' {
  2.     if censreg_2020[`r'] == 1 local n1 = n[`r']
  3.     if censreg_2020[`r'] == 2 local n2 = n[`r']
  4.     if censreg_2020[`r'] == 3 local n3 = n[`r']
  5.     if censreg_2020[`r'] == 4 local n4 = n[`r']
  6. }

. file open fh using "${DESCRIPTIVE}/Tables/region_counts_4col_2020.tex", write r
> eplace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Region counts (2020,
>  4 regions, no Other)}" _n "\label{tab:region_counts_4col_2020}" _n "\begin{tab
> ular}{cccc}\toprule" _n "Northeast & Midwest & South & West \\\\ \midrule" _n

. file write fh "`n1' & `n2' & `n3' & `n4' \\\\" _n

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Sample: 2020, 
> nonmissing general trust; region codes 1--4 only.} \\\\" _n "\end{tabular}\end{
> table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020) & !missing(population_2020)
(44,511 observations deleted)

. label values population_2020 pop_lbl

. collapse (mean) trust_mean=trust_others_2020 (count) n=trust_others_2020 `wopt'
> , by(population_2020)

. decode population_2020, gen(pop_label)

. file open fh using "${DESCRIPTIVE}/Tables/trust_mean_by_population_2020.tex", w
> rite replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean trust by popula
> tion size (2020)}" _n "\label{tab:trust_mean_by_population_2020}" _n "\begin{ta
> bular}{rlrr}\toprule" _n "Population (code) & Population size & Mean trust & Ob
> s \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local p_s = string(population_2020[`r'], "%9.0f")
  3.     local plab = pop_label[`r']
  4.     local tm_s = string(trust_mean[`r'], "%9.4f")
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`p_s' & `plab' & `tm_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize General trust 
> (2020), nonmissing population size.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. preserve

. keep if !missing(trust_others_2020) & !missing(population_3bin_2020)
(44,511 observations deleted)

. label values population_3bin_2020 pop3_lbl

. collapse (mean) trust_mean=trust_others_2020 (count) n=trust_others_2020 `wopt'
> , by(population_3bin_2020)

. decode population_3bin_2020, gen(pop3_label)

. file open fh using "${DESCRIPTIVE}/Tables/trust_mean_by_population3_2020.tex", 
> write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean trust by popula
> tion (3 bins, 2020)}" _n "\label{tab:trust_mean_by_population3_2020}" _n "\begi
> n{tabular}{rlrr}\toprule" _n "Pop3 (code) & Population & Mean trust & Obs \\\\ 
> \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local p3_s = string(population_3bin_2020[`r'], "%9.0f")
  3.     local p3lab = pop3_label[`r']
  4.     local tm_s = string(trust_mean[`r'], "%9.4f")
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`p3_s' & `p3lab' & `tm_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Small/med/larg
> e; general trust (2020).} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. display "=== Mean trust by townsize3 (region x pop3, 2020 only) ==="
=== Mean trust by townsize3 (region x pop3, 2020 only) ===

. preserve

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & !missing(populat
> ion_3bin_2020)
(44,511 observations deleted)

. label values censreg_2020 region_lbl

. label values population_3bin_2020 pop3_lbl

. gen int region_pop3_group = censreg_2020 * 10 + population_3bin_2020

. collapse (mean) trust_mean=trust_others_2020 (count) n=trust_others_2020 `wopt'
> , by(censreg_2020 population_3bin_2020 region_pop3_group)

. decode censreg_2020, gen(region_label)

. decode population_3bin_2020, gen(pop3_label)

. file open fh using "${DESCRIPTIVE}/Tables/trust_mean_by_regionpop3_2020.tex", w
> rite replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Mean trust by region
> --population (3 bins, 2020)}" _n "\label{tab:trust_mean_by_regionpop3_2020}" _n
>  "\begin{tabular}{rlllrr}\toprule" _n "Region (code) & Region & Pop3 (code) & P
> opulation & Mean trust & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_2020[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local p3_s = string(population_3bin_2020[`r'], "%9.0f")
  5.     local p3lab = pop3_label[`r']
  6.     local tm_s = string(trust_mean[`r'], "%9.4f")
  7.     local n_s = string(n[`r'], "%9.0f")
  8.     file write fh "`r_s' & `rlab' & `p3_s' & `p3lab' & `tm_s' & `n_s' \\\\" 
> _n
  9. }

. file write fh "\bottomrule" _n "\multicolumn{6}{l}{\footnotesize General trust 
> (2020) by region $\times$ population (3 bins).} \\\\" _n "\end{tabular}\end{tab
> le}" _n

. file close fh

. restore

. 
. display "=== Overlap: trust x hometown_size (2020 only) ==="
=== Overlap: trust x hometown_size (2020 only) ===

. preserve

. keep hhidpn trust_others_2020 hometown_size_* 

. reshape long hometown_size_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  14   ->   4           
j variable (12 values)                    ->   year
xij variables:
hometown_size_2000 hometown_size_2002 ... hometown_size_2022->hometown_size_
-----------------------------------------------------------------------------

. keep if year == 2020
(497,574 observations deleted)

. keep if !missing(trust_others_2020) & !missing(hometown_size_)
(44,511 observations deleted)

. contract year hometown_size_, freq(n)

. file open fh using "${DESCRIPTIVE}/Tables/trust_hometownsize_groups_2020.tex", 
> write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Trust and hometown s
> ize overlap (2020)}" _n "\label{tab:trust_hometownsize_groups_2020}" _n "\begin
> {tabular}{rrr}\toprule" _n "Year & Hometown size (code) & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local ht_s = string(hometown_size_[`r'], "%9.0f")
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`yr_s' & `ht_s' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Empty group diagnostics (2020 only)
. * ---------------------------------------------------------------------
. display "=== Empty group diagnostics (2020 only) ==="
=== Empty group diagnostics (2020 only) ===

. 
. * Region groups: expected 5
. preserve

. clear

. input byte censreg_ str12 region_label

     censreg_  region_label
  1. 1 "Northeast"
  2. 2 "Midwest"
  3. 3 "South"
  4. 4 "West"
  5. 5 "Other"
  6. end

. tempfile region_all

. save "`region_all'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000010 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000010 saved as
    .dta format

. restore

. 
. preserve

. keep hhidpn trust_others_2020 censreg_* 

. reshape long censreg_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  14   ->   4           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
-----------------------------------------------------------------------------

. keep if year == 2020 & !missing(trust_others_2020) & !missing(censreg_)
(541,908 observations deleted)

. contract censreg_, freq(n)

. merge 1:1 censreg_ using "`region_all'", nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 5  
    -----------------------------------------

. replace n = 0 if missing(n)
(0 real changes made)

. file open fh using "${DESCRIPTIVE}/Tables/trust_region_groups_2020_with_empty.t
> ex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Region groups with e
> mpty cells (2020)}" _n "\label{tab:trust_region_groups_2020_with_empty}" _n "\b
> egin{tabular}{rlr}\toprule" _n "Region (code) & Region & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`r_s' & `rlab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Region-pop groups: expected 30 (5 regions x 6 pop bins)
. preserve

. clear

. input byte censreg_ str12 region_label

     censreg_  region_label
  1. 1 "Northeast"
  2. 2 "Midwest"
  3. 3 "South"
  4. 4 "West"
  5. 5 "Other"
  6. end

. tempfile region_vals

. save "`region_vals'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000013 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000013 saved as
    .dta format

. restore

. 
. preserve

. clear

. input byte population_2020 str22 pop_label

     pop~2020               pop_label
  1. 1 "Less than 1,000"
  2. 2 "1,000 to 10,000"
  3. 3 "10,000 to 50,000"
  4. 4 "50,000 to 100,000"
  5. 5 "100,000 to 1 million"
  6. 6 "Greater than 1 million"
  7. end

. tempfile pop_vals

. save "`pop_vals'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000015 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000015 saved as
    .dta format

. restore

. 
. preserve

. use "`region_vals'", clear

. cross using "`pop_vals'"

. gen int region_pop_group = censreg_ * 100 + population_2020

. tempfile regionpop_all

. save "`regionpop_all'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000017 not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.000017 saved as
    .dta format

. restore

. 
. preserve

. keep hhidpn trust_others_2020 censreg_* population_2020

. reshape long censreg_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  15   ->   5           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
-----------------------------------------------------------------------------

. keep if year == 2020 & !missing(trust_others_2020) & !missing(censreg_) & !miss
> ing(population_2020)
(542,085 observations deleted)

. contract censreg_ population_2020, freq(n)

. merge 1:1 censreg_ population_2020 using "`regionpop_all'", nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             5
        from master                         0  
        from using                          5  

    Matched                                25  
    -----------------------------------------

. replace n = 0 if missing(n)
(5 real changes made)

. file open fh using "${DESCRIPTIVE}/Tables/trust_regionpop_groups_2020_with_empt
> y.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Region--population g
> roups with empty cells (2020)}" _n "\label{tab:trust_regionpop_groups_2020_with
> _empty}" _n "\begin{tabular}{rllrlr}\toprule" _n "Region (code) & Region & Pop 
> (code) & Population size & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local pop_s = string(population_2020[`r'], "%9.0f")
  5.     local plab = pop_label[`r']
  6.     local n_s = string(n[`r'], "%9.0f")
  7.     file write fh "`r_s' & `rlab' & `pop_s' & `plab' & `n_s' \\\\" _n
  8. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Region-pop3 groups: expected 12 (4 regions x 3 pop bins)
. preserve

. clear

. input byte censreg_ str12 region_label

     censreg_  region_label
  1. 1 "Northeast"
  2. 2 "Midwest"
  3. 3 "South"
  4. 4 "West"
  5. end

. tempfile region_vals3

. save "`region_vals3'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001a not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001a saved as
    .dta format

. restore

. 
. preserve

. clear

. input byte population_3bin_2020 str30 pop3_label

     pop~2020                      pop3_label
  1. 1 "Small town (<10k)"
  2. 2 "Small/med city (10k-100k)"
  3. 3 "Large metro (100k+)"
  4. end

. tempfile pop3_vals

. save "`pop3_vals'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001c not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001c saved as
    .dta format

. restore

. 
. preserve

. use "`region_vals3'", clear

. cross using "`pop3_vals'"

. gen int region_pop3_group = censreg_ * 10 + population_3bin_2020

. tempfile regionpop3_all

. save "`regionpop3_all'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001e not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001e saved as
    .dta format

. restore

. 
. preserve

. keep hhidpn trust_others_2020 censreg_2020 population_3bin_2020

. keep if !missing(trust_others_2020) & !missing(censreg_2020) & !missing(populat
> ion_3bin_2020)
(44,511 observations deleted)

. gen byte censreg_ = censreg_2020

. contract censreg_ population_3bin_2020, freq(n)

. merge 1:1 censreg_ population_3bin_2020 using "`regionpop3_all'", nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             1
        from master                         1  
        from using                          0  

    Matched                                12  
    -----------------------------------------

. replace n = 0 if missing(n)
(0 real changes made)

. file open fh using "${DESCRIPTIVE}/Tables/trust_regionpop3_groups_2020_with_emp
> ty.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Region--population (
> 3 bins) groups with empty cells (2020)}" _n "\label{tab:trust_regionpop3_groups
> _2020_with_empty}" _n "\begin{tabular}{rllrr}\toprule" _n "Region (code) & Regi
> on & Pop3 (code) & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local r_s = string(censreg_[`r'], "%9.0f")
  3.     local rlab = region_label[`r']
  4.     local p3_s = string(population_3bin_2020[`r'], "%9.0f")
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`r_s' & `rlab' & `p3_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Population groups only: expected 6
. preserve

. use "`pop_vals'", clear

. tempfile pop_all

. save "`pop_all'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001h not
    found)
file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001h saved as
    .dta format

. restore

. 
. preserve

. keep hhidpn trust_others_2020 population_2020

. keep if !missing(trust_others_2020) & !missing(population_2020)
(44,511 observations deleted)

. contract population_2020, freq(n)

. merge 1:1 population_2020 using "`pop_all'", nogenerate

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                                 6  
    -----------------------------------------

. replace n = 0 if missing(n)
(0 real changes made)

. file open fh using "${DESCRIPTIVE}/Tables/trust_population_groups_2020_with_emp
> ty.tex", write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Population groups wi
> th empty cells (2020)}" _n "\label{tab:trust_population_groups_2020_with_empty}
> " _n "\begin{tabular}{rlr}\toprule" _n "Population (code) & Population size & O
> bs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local p_s = string(population_2020[`r'], "%9.0f")
  3.     local plab = pop_label[`r']
  4.     local n_s = string(n[`r'], "%9.0f")
  5.     file write fh "`p_s' & `plab' & `n_s' \\\\" _n
  6. }

. file write fh "\bottomrule\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. 
. * Reload full dataset for Trust section (portfolio section reduced it with keep
> )
. use "${PROCESSED}/analysis_ready_processed.dta", clear

. 
. * ---------------------------------------------------------------------
. * Trust correlations and PCA
. * ---------------------------------------------------------------------
. local trustvars "trust_others_2020 trust_social_security_2020 trust_medicare_20
> 20 trust_banks_2020 trust_advisors_2020 trust_mutual_funds_2020 trust_insurance
> _2020 trust_media_2020"

. 
. display "=== Trust correlations (pwcorr) ==="
=== Trust correlations (pwcorr) ===

. pwcorr `trustvars', sig obs

             | t~othe~0 t~y_2020 t~care~0 t~bank~0 t~advi~0 t~utua~0 t~insu~0
-------------+---------------------------------------------------------------
trust_o~2020 |   1.0000 
             |
             |      900
             |
trust_s~2020 |   0.2979   1.0000 
             |   0.0000
             |      748     1013
             |
trus~re_2020 |   0.2213   0.8319   1.0000 
             |   0.0000   0.0000
             |      746      936     1029
             |
trust_b~2020 |   0.3801   0.4712   0.4561   1.0000 
             |   0.0000   0.0000   0.0000
             |      732      842      844      990
             |
trust_a~2020 |   0.3182   0.3007   0.2969   0.5360   1.0000 
             |   0.0000   0.0000   0.0000   0.0000
             |      793      879      886      885     1080
             |
trust_mutu~0 |   0.3270   0.2513   0.2675   0.4078   0.6294   1.0000 
             |   0.0000   0.0000   0.0000   0.0000   0.0000
             |      783      878      892      883      964     1072
             |
trust_i~2020 |   0.3465   0.4113   0.3847   0.4748   0.4758   0.4009   1.0000 
             |   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |      804      932      944      924      993      986     1147
             |
trust~a_2020 |   0.1413   0.3040   0.2710   0.2397   0.2532   0.2301   0.3252 
             |   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |      841      952      967      932     1024     1019     1080
             |

             | t~a_2020
-------------+---------
trust~a_2020 |   1.0000 
             |
             |     1235
             |

. 
. display "=== Trust + added controls correlations ==="
=== Trust + added controls correlations ===

. * Controls of interest for General trust correlations:
. * age, education, gender, immigration, marital, race, plus regression controls
. local ctrlvars age_2020 educ_yrs gender immigrant born_us race_eth married_2020
>  ///
>     depression_2020 health_cond_2020 medicare_2020 medicaid_2020 life_ins_2020 
> ///
>     num_divorce_2020 num_widow_2020

. 
. pwcorr `trustvars' `ctrlvars', sig obs

             | t~othe~0 t~y_2020 t~care~0 t~bank~0 t~advi~0 t~utua~0 t~insu~0
-------------+---------------------------------------------------------------
trust_o~2020 |   1.0000 
             |
             |      900
             |
trust_s~2020 |   0.2979   1.0000 
             |   0.0000
             |      748     1013
             |
trus~re_2020 |   0.2213   0.8319   1.0000 
             |   0.0000   0.0000
             |      746      936     1029
             |
trust_b~2020 |   0.3801   0.4712   0.4561   1.0000 
             |   0.0000   0.0000   0.0000
             |      732      842      844      990
             |
trust_a~2020 |   0.3182   0.3007   0.2969   0.5360   1.0000 
             |   0.0000   0.0000   0.0000   0.0000
             |      793      879      886      885     1080
             |
trust_mutu~0 |   0.3270   0.2513   0.2675   0.4078   0.6294   1.0000 
             |   0.0000   0.0000   0.0000   0.0000   0.0000
             |      783      878      892      883      964     1072
             |
trust_i~2020 |   0.3465   0.4113   0.3847   0.4748   0.4758   0.4009   1.0000 
             |   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |      804      932      944      924      993      986     1147
             |
trust~a_2020 |   0.1413   0.3040   0.2710   0.2397   0.2532   0.2301   0.3252 
             |   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |      841      952      967      932     1024     1019     1080
             |
    age_2020 |   0.2112   0.2295   0.1906   0.1500   0.0192   0.0611   0.0945 
             |   0.0000   0.0000   0.0000   0.0000   0.5277   0.0455   0.0014
             |      900     1013     1029      990     1080     1072     1147
             |
    educ_yrs |   0.0966  -0.1025  -0.1455   0.0178   0.0909   0.1464   0.0210 
             |   0.0038   0.0011   0.0000   0.5768   0.0028   0.0000   0.4791
             |      896     1006     1022      986     1075     1067     1141
             |
      gender |  -0.0153  -0.0569  -0.0379   0.0384   0.0270  -0.0258   0.0686 
             |   0.6472   0.0703   0.2241   0.2272   0.3755   0.3994   0.0202
             |      900     1013     1029      990     1080     1072     1147
             |
   immigrant |  -0.1099   0.0351   0.0610  -0.0860  -0.0311  -0.0047  -0.0135 
             |   0.0010   0.2653   0.0507   0.0068   0.3066   0.8787   0.6491
             |      900     1012     1028      990     1080     1072     1147
             |
     born_us |   0.1099  -0.0351  -0.0610   0.0860   0.0311   0.0047   0.0135 
             |   0.0010   0.2653   0.0507   0.0068   0.3066   0.8787   0.6491
             |      900     1012     1028      990     1080     1072     1147
             |
    race_eth |  -0.1362  -0.0126  -0.0098  -0.1147  -0.1351  -0.1312  -0.0308 
             |   0.0000   0.6885   0.7541   0.0003   0.0000   0.0000   0.2971
             |      899     1012     1028      989     1079     1071     1146
             |
married_2020 |   0.1111  -0.1177  -0.1320   0.0078   0.0471   0.0787   0.0037 
             |   0.0008   0.0002   0.0000   0.8067   0.1221   0.0100   0.9018
             |      899     1013     1028      989     1079     1071     1146
             |
depress~2020 |  -0.1743  -0.0663  -0.0212  -0.0861  -0.1116  -0.1073  -0.0905 
             |   0.0000   0.0348   0.4974   0.0067   0.0002   0.0004   0.0022
             |      900     1013     1029      990     1080     1072     1147
             |
health_~2020 |  -0.0477   0.0576   0.0783  -0.0558  -0.1168  -0.0969  -0.0491 
             |   0.1531   0.0670   0.0120   0.0794   0.0001   0.0015   0.0967
             |      900     1013     1029      990     1080     1072     1147
             |
medicar~2020 |   0.1138   0.2366   0.2279   0.1062  -0.0128  -0.0147   0.0775 
             |   0.0006   0.0000   0.0000   0.0008   0.6744   0.6300   0.0087
             |      896     1009     1025      987     1077     1070     1144
             |
medicai~2020 |  -0.1747   0.1001   0.1527  -0.0891  -0.1226  -0.1612  -0.0670 
             |   0.0000   0.0015   0.0000   0.0053   0.0001   0.0000   0.0241
             |      890     1001     1016      977     1066     1058     1133
             |
life_in~2020 |   0.0823  -0.0563  -0.0831   0.0672   0.0231   0.0917   0.1308 
             |   0.0140   0.0749   0.0080   0.0354   0.4512   0.0028   0.0000
             |      891     1003     1018      980     1068     1062     1136
             |
num_div~2020 |  -0.0764  -0.0539  -0.0170  -0.0133  -0.0851  -0.0760  -0.0590 
             |   0.0219   0.0864   0.5860   0.6769   0.0051   0.0128   0.0458
             |      900     1013     1029      990     1080     1072     1147
             |
num_wid~2020 |   0.0343   0.0894   0.0814   0.0680   0.0422  -0.0078   0.0642 
             |   0.3039   0.0044   0.0090   0.0324   0.1659   0.7999   0.0296
             |      900     1013     1029      990     1080     1072     1147
             |

             | t~a_2020 age_2020 educ_yrs   gender immigr~t  born_us race_eth
-------------+---------------------------------------------------------------
trust~a_2020 |   1.0000 
             |
             |     1235
             |
    age_2020 |   0.0027   1.0000 
             |   0.9254
             |     1235    15723
             |
    educ_yrs |  -0.0304  -0.0371   1.0000 
             |   0.2871   0.0000
             |     1228    15651    44585
             |
      gender |  -0.0273  -0.0057  -0.0100   1.0000 
             |   0.3386   0.4733   0.0352
             |     1235    15723    44585    45234
             |
   immigrant |   0.1217  -0.1210  -0.2001   0.0072   1.0000 
             |   0.0000   0.0000   0.0000   0.1284
             |     1234    15718    44560    44717    44717
             |
     born_us |  -0.1217   0.1210   0.2001  -0.0072  -1.0000   1.0000 
             |   0.0000   0.0000   0.0000   0.1284   1.0000
             |     1234    15718    44560    44717    44717    44717
             |
    race_eth |   0.1309  -0.2426  -0.2157   0.0147   0.4802  -0.4802   1.0000 
             |   0.0000   0.0000   0.0000   0.0019   0.0000   0.0000
             |     1234    15689    44496    44650    44626    44626    44650
             |
married_2020 |  -0.0130  -0.1278   0.0759  -0.1947   0.0875  -0.0875  -0.0119 
             |   0.6475   0.0000   0.0000   0.0000   0.0000   0.0000   0.1378
             |     1234    15685    15613    15685    15680    15680    15651
             |
depress~2020 |  -0.0303  -0.0523  -0.1391   0.1038   0.0126  -0.0126   0.0817 
             |   0.2869   0.0000   0.0000   0.0000   0.1217   0.1217   0.0000
             |     1235    14998    14927    14998    14994    14994    14965
             |
health_~2020 |  -0.0316   0.3006  -0.1172   0.0412  -0.1198   0.1198  -0.0504 
             |   0.2673   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |     1235    15723    15651    15723    15718    15718    15689
             |
medicar~2020 |  -0.0262   0.6777  -0.0342   0.0033  -0.1431   0.1431  -0.1867 
             |   0.3584   0.0000   0.0000   0.6850   0.0000   0.0000   0.0000
             |     1233    15498    15429    15498    15493    15493    15467
             |
medicai~2020 |   0.0748  -0.0770  -0.2269   0.0585   0.0945  -0.0945   0.1879 
             |   0.0089   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |     1221    15383    15315    15383    15379    15379    15355
             |
life_in~2020 |  -0.0498  -0.0332   0.1889  -0.0362  -0.2207   0.2207  -0.1349 
             |   0.0816   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |     1222    15340    15273    15340    15335    15335    15309
             |
num_div~2020 |  -0.0880  -0.0648   0.0370   0.0110  -0.0837   0.0837  -0.0330 
             |   0.0020   0.0000   0.0000   0.1685   0.0000   0.0000   0.0000
             |     1235    15723    15651    15723    15718    15718    15689
             |
num_wid~2020 |  -0.0103   0.3825  -0.0839   0.1709  -0.0651   0.0651  -0.0911 
             |   0.7189   0.0000   0.0000   0.0000   0.0000   0.0000   0.0000
             |     1235    15723    15651    15723    15718    15718    15689
             |

             | mar~2020 dep~2020 hea~2020 m~e_2020 m~id_2~0 lif~2020 num_di~0
-------------+---------------------------------------------------------------
married_2020 |   1.0000 
             |
             |    15685
             |
depress~2020 |  -0.1850   1.0000 
             |   0.0000
             |    14962    14998
             |
health_~2020 |  -0.1479   0.2828   1.0000 
             |   0.0000   0.0000
             |    15685    14998    15723
             |
medicar~2020 |  -0.1017   0.0240   0.3273   1.0000 
             |   0.0000   0.0035   0.0000
             |    15462    14785    15498    15498
             |
medicai~2020 |  -0.1979   0.1786   0.1711   0.0280   1.0000 
             |   0.0000   0.0000   0.0000   0.0005
             |    15349    14675    15383    15334    15383
             |
life_in~2020 |   0.1049  -0.1030  -0.0458  -0.0569  -0.1703   1.0000 
             |   0.0000   0.0000   0.0000   0.0000   0.0000
             |    15304    14651    15340    15264    15150    15340
             |
num_div~2020 |  -0.2052   0.0628   0.0718   0.0177   0.0507  -0.0194   1.0000 
             |   0.0000   0.0000   0.0000   0.0271   0.0000   0.0164
             |    15685    14998    15723    15498    15383    15340    15723
             |
num_wid~2020 |  -0.4058   0.0662   0.1591   0.2497   0.0025  -0.0179  -0.1293 
             |   0.0000   0.0000   0.0000   0.0000   0.7572   0.0265   0.0000
             |    15685    14998    15723    15498    15383    15340    15723
             |

             | num_wi~0
-------------+---------
num_wid~2020 |   1.0000 
             |
             |    15723
             |

. 
. preserve

. tempfile trustctrlcorr

. postfile handle str32 var1 str32 var2 double corr using "`trustctrlcorr'", repl
> ace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001k not
    found)

. correlate `trustvars' `ctrlvars'
(obs=522)

             | t~othe~0 t~y_2020 t~care~0 t~bank~0 t~advi~0 t~utua~0 t~insu~0
-------------+---------------------------------------------------------------
trust_o~2020 |   1.0000
trust_s~2020 |   0.3136   1.0000
trus~re_2020 |   0.2646   0.8382   1.0000
trust_b~2020 |   0.3646   0.4569   0.4114   1.0000
trust_a~2020 |   0.3425   0.3222   0.2980   0.5578   1.0000
trust_mutu~0 |   0.3529   0.2625   0.2651   0.4222   0.6370   1.0000
trust_i~2020 |   0.3973   0.4228   0.3736   0.4609   0.4963   0.4049   1.0000
trust~a_2020 |   0.2051   0.2835   0.2600   0.2673   0.2460   0.2567   0.3199
    age_2020 |   0.2346   0.2735   0.2247   0.1662   0.0444   0.0627   0.1337
    educ_yrs |   0.0971  -0.1327  -0.1635   0.0106   0.0433   0.1131  -0.0257
      gender |  -0.0035  -0.0223  -0.0396   0.0426   0.0827   0.0187   0.0639
   immigrant |  -0.1161   0.0025   0.0073  -0.0960  -0.0034  -0.0176  -0.0902
     born_us |   0.1161  -0.0025  -0.0073   0.0960   0.0034   0.0176   0.0902
    race_eth |  -0.1140  -0.0171  -0.0291  -0.1024  -0.0606  -0.1005  -0.0181
married_2020 |   0.0970  -0.1075  -0.1203   0.0104   0.0859   0.1034   0.0052
depress~2020 |  -0.1673  -0.0363  -0.0001  -0.0892  -0.1054  -0.0875  -0.1065
health_~2020 |  -0.0144   0.0888   0.0856  -0.0934  -0.1041  -0.1063  -0.0760
medicar~2020 |   0.1438   0.2615   0.2418   0.0908  -0.0017  -0.0156   0.1305
medicai~2020 |  -0.1791   0.0815   0.1516  -0.0898  -0.0915  -0.1309  -0.1127
life_in~2020 |   0.0616  -0.0714  -0.1046   0.0923  -0.0062   0.0575   0.0928
num_div~2020 |  -0.0473  -0.0338  -0.0214  -0.0190  -0.0527  -0.0844   0.0054
num_wid~2020 |   0.0266   0.0843   0.0762   0.0919   0.0591  -0.0215   0.1097

             | t~a_2020 age_2020 educ_yrs   gender immigr~t  born_us race_eth
-------------+---------------------------------------------------------------
trust~a_2020 |   1.0000
    age_2020 |   0.0525   1.0000
    educ_yrs |  -0.1170  -0.0532   1.0000
      gender |  -0.0197  -0.0614   0.0408   1.0000
   immigrant |   0.1357  -0.1354  -0.3003  -0.0755   1.0000
     born_us |  -0.1357   0.1354   0.3003   0.0755  -1.0000   1.0000
    race_eth |   0.1414  -0.2396  -0.2233  -0.0207   0.4895  -0.4895   1.0000
married_2020 |   0.0307  -0.0187   0.0710  -0.2141   0.1298  -0.1298  -0.0559
depress~2020 |  -0.0630  -0.1032  -0.0648   0.1150  -0.0098   0.0098   0.0284
health_~2020 |  -0.0364   0.3062  -0.0308   0.0384  -0.0872   0.0872  -0.0602
medicar~2020 |   0.0035   0.6923  -0.0969  -0.0764  -0.0985   0.0985  -0.1938
medicai~2020 |   0.0253  -0.1061  -0.1585   0.0421   0.1000  -0.1000   0.1170
life_in~2020 |  -0.0553   0.0032   0.1775  -0.0352  -0.2663   0.2663  -0.0786
num_div~2020 |  -0.1085  -0.0261   0.0821   0.0169  -0.1122   0.1122  -0.1108
num_wid~2020 |   0.0224   0.2728  -0.0945   0.2120  -0.0710   0.0710  -0.0208

             | mar~2020 dep~2020 hea~2020 m~e_2020 m~id_2~0 lif~2020 num_di~0
-------------+---------------------------------------------------------------
married_2020 |   1.0000
depress~2020 |  -0.2120   1.0000
health_~2020 |  -0.0873   0.2643   1.0000
medicar~2020 |  -0.0330  -0.0314   0.3563   1.0000
medicai~2020 |  -0.2175   0.1754   0.1842  -0.0193   1.0000
life_in~2020 |   0.0753  -0.0683  -0.0418  -0.0894  -0.2152   1.0000
num_div~2020 |  -0.1978   0.0447   0.0607   0.0074   0.0708  -0.0497   1.0000
num_wid~2020 |  -0.3504   0.0707   0.0801   0.2184   0.0202  -0.0249  -0.0681

             | num_wi~0
-------------+---------
num_wid~2020 |   1.0000


. matrix C = r(C)

. local allvars "`trustvars' `ctrlvars'"

. local n : word count `allvars'

. forvalues i = 1/`n' {
  2.     local v1 : word `i' of `allvars'
  3.     forvalues j = 1/`n' {
  4.         local v2 : word `j' of `allvars'
  5.         post handle ("`v1'") ("`v2'") (C[`i',`j'])
  6.     }
  7. }

. postclose handle

. use "`trustctrlcorr'", clear

. * Keep only rows where var1 is General trust (trust_others_2020)
. keep if var1 == "trust_others_2020"
(462 observations deleted)

. * Drop rows where var2 is another trust item; keep only controls
. local trustvars "trust_others_2020 trust_social_security_2020 trust_medicare_20
> 20 trust_banks_2020 trust_advisors_2020 trust_mutual_funds_2020 trust_insurance
> _2020 trust_media_2020"

. foreach t of local trustvars {
  2.     drop if var2 == "`t'"
  3. }
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)
(1 observation deleted)

. 
. * Combined table (all controls)
. file open fh using "${DESCRIPTIVE}/Tables/trust_controls_corr.tex", write repla
> ce

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Correlations of Gene
> ral trust with controls}" _n "\label{tab:trust_controls_corr}" _n "\begin{tabul
> ar}{llr}\toprule" _n "Variable 1 & Variable 2 & Correlation \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local v1 = var1[`r']
  3.     local v2 = var2[`r']
  4.     _vlabel `v1'
  5.     local v1 `r(vlabel)'
  6.     _vlabel `v2'
  7.     local v2 `r(vlabel)'
  8.     local c_s = string(corr[`r'], "%9.4f")
  9.     file write fh "`v1' & `v2' & `c_s' \\\\" _n
 10. }

. file write fh "\bottomrule" _n "\multicolumn{3}{l}{\footnotesize General trust 
> (var1) with each control.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * Export trust correlation matrix as compact matrix (rows = vars, columns = var
> s)
. preserve

. correlate `trustvars'
(obs=536)

             | t~othe~0 t~y_2020 t~care~0 t~bank~0 t~advi~0 t~utua~0 t~insu~0
-------------+---------------------------------------------------------------
trust_o~2020 |   1.0000
trust_s~2020 |   0.3048   1.0000
trus~re_2020 |   0.2563   0.8395   1.0000
trust_b~2020 |   0.3717   0.4531   0.4083   1.0000
trust_a~2020 |   0.3335   0.3297   0.3093   0.5548   1.0000
trust_mutu~0 |   0.3558   0.2607   0.2641   0.4341   0.6311   1.0000
trust_i~2020 |   0.3854   0.4306   0.3800   0.4600   0.5029   0.4054   1.0000
trust~a_2020 |   0.2051   0.2887   0.2694   0.2726   0.2589   0.2570   0.3239

             | t~a_2020
-------------+---------
trust~a_2020 |   1.0000


. matrix C = r(C)

. local n : word count `trustvars'

. local nc = `n' + 1

. file open fh using "${DESCRIPTIVE}/Tables/trust_corr.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n "\caption{Trust variable
> s correlation matrix}" _n "\label{tab:trust_corr}" _n "\resizebox{\textwidth}{!
> }{\begin{tabular}{l"

. forvalues j = 1/`n' {
  2.     file write fh "r"
  3. }

. file write fh "}\toprule" _n " & "

. forvalues j = 1/`n' {
  2.     local v : word `j' of `trustvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     if `j' < `n' file write fh "`vlab' & " _n
  6.     else file write fh "`vlab' \\\\ \midrule" _n
  7. }

. forvalues i = 1/`n' {
  2.     local v : word `i' of `trustvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     file write fh "`vlab'" _n
  6.     forvalues j = 1/`n' {
  7.         local c_s = string(C[`i',`j'], "%5.2f")
  8.         file write fh " & `c_s'" _n
  9.     }
 10.     file write fh " \\\\" _n
 11. }

. file write fh "\bottomrule" _n "\multicolumn{`nc'}{l}{\footnotesize Pairwise co
> rrelations between trust items (2020).} \\\\" _n "\end{tabular}}" _n "\end{tabl
> e}" _n

. file close fh

. restore

. 
. * PCA on trust variables: export components to dataset
. display "=== PCA on trust variables ==="
=== PCA on trust variables ===

. pca `trustvars' if !missing(trust_others_2020)

Principal components/correlation                 Number of obs    =        536
                                                 Number of comp.  =          8
                                                 Trace            =          8
    Rotation: (unrotated = principal)            Rho              =     1.0000

    --------------------------------------------------------------------------
       Component |   Eigenvalue   Difference         Proportion   Cumulative
    -------------+------------------------------------------------------------
           Comp1 |      3.68384      2.48761             0.4605       0.4605
           Comp2 |      1.19623      .374978             0.1495       0.6100
           Comp3 |      .821251     .0868914             0.1027       0.7127
           Comp4 |       .73436      .176377             0.0918       0.8045
           Comp5 |      .557982     .0354894             0.0697       0.8742
           Comp6 |      .522493      .194774             0.0653       0.9395
           Comp7 |      .327719      .171594             0.0410       0.9805
           Comp8 |      .156124            .             0.0195       1.0000
    --------------------------------------------------------------------------

Principal components (eigenvectors) 

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    trust_o~2020 |   0.3002    0.1808   -0.1247    0.8897    0.2278   -0.0260 
    trust_s~2020 |   0.3835   -0.5451   -0.1248   -0.0336    0.0878    0.0697 
    trus~re_2020 |   0.3657   -0.5680   -0.1353   -0.0993    0.1791    0.1246 
    trust_b~2020 |   0.3887    0.1014   -0.1489   -0.1072   -0.1919   -0.8251 
    trust_a~2020 |   0.3844    0.3757   -0.1294   -0.3339    0.0030    0.0227 
    trust_mutu~0 |   0.3480    0.4309   -0.0830   -0.2530    0.4819    0.3360 
    trust_i~2020 |   0.3786    0.0971    0.0740    0.1021   -0.7870    0.4166 
    trust~a_2020 |   0.2565   -0.0317    0.9483    0.0059    0.1410   -0.1060 
    --------------------------------------------------------------------------

    ------------------------------------------------
        Variable |    Comp7     Comp8 | Unexplained 
    -------------+--------------------+-------------
    trust_o~2020 |  -0.1278    0.0346 |           0 
    trust_s~2020 |  -0.0363   -0.7248 |           0 
    trus~re_2020 |  -0.0253    0.6835 |           0 
    trust_b~2020 |   0.2926    0.0428 |           0 
    trust_a~2020 |  -0.7631   -0.0007 |           0 
    trust_mutu~0 |   0.5241   -0.0494 |           0 
    trust_i~2020 |   0.1906    0.0450 |           0 
    trust~a_2020 |  -0.0523    0.0055 |           0 
    ------------------------------------------------

. capture drop trust_pc1 trust_pc2

. predict trust_pc1 trust_pc2 if e(sample)
(score assumed)
(6 components skipped)

Scoring coefficients 
    sum of squares(column-loading) = 1

    --------------------------------------------------------------------------
        Variable |    Comp1     Comp2     Comp3     Comp4     Comp5     Comp6 
    -------------+------------------------------------------------------------
    trust_o~2020 |   0.3002    0.1808   -0.1247    0.8897    0.2278   -0.0260 
    trust_s~2020 |   0.3835   -0.5451   -0.1248   -0.0336    0.0878    0.0697 
    trus~re_2020 |   0.3657   -0.5680   -0.1353   -0.0993    0.1791    0.1246 
    trust_b~2020 |   0.3887    0.1014   -0.1489   -0.1072   -0.1919   -0.8251 
    trust_a~2020 |   0.3844    0.3757   -0.1294   -0.3339    0.0030    0.0227 
    trust_mutu~0 |   0.3480    0.4309   -0.0830   -0.2530    0.4819    0.3360 
    trust_i~2020 |   0.3786    0.0971    0.0740    0.1021   -0.7870    0.4166 
    trust~a_2020 |   0.2565   -0.0317    0.9483    0.0059    0.1410   -0.1060 
    --------------------------------------------------------------------------

    ----------------------------------
        Variable |    Comp7     Comp8 
    -------------+--------------------
    trust_o~2020 |  -0.1278    0.0346 
    trust_s~2020 |  -0.0363   -0.7248 
    trus~re_2020 |  -0.0253    0.6835 
    trust_b~2020 |   0.2926    0.0428 
    trust_a~2020 |  -0.7631   -0.0007 
    trust_mutu~0 |   0.5241   -0.0494 
    trust_i~2020 |   0.1906    0.0450 
    trust~a_2020 |  -0.0523    0.0055 
    ----------------------------------

. 
. * Export PCA loadings (first two components)
. preserve

. tempfile pcload

. postfile handle str32 varname double pc1 pc2 using "`pcload'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001n not
    found)

. matrix L = e(L)

. local n : word count `trustvars'

. forvalues i = 1/`n' {
  2.     local v1 : word `i' of `trustvars'
  3.     post handle ("`v1'") (L[`i',1]) (L[`i',2])
  4. }

. postclose handle

. use "`pcload'", clear

. file open fh using "${DESCRIPTIVE}/Tables/trust_pca_loadings.tex", write replac
> e

. file write fh "\begin{table}[htbp]\centering\small" _n "\setlength{\tabcolsep}{
> 6pt}" _n "\caption{Trust PCA loadings (first two components)}" _n "\label{tab:t
> rust_pca_loadings}" _n "\begin{tabular}{lrr}\toprule" _n "Trust item & PC1 & PC
> 2 \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local vn = varname[`r']
  3.     _vlabel `vn'
  4.     local vn `r(vlabel)'
  5.     local p1_s = string(pc1[`r'], "%9.4f")
  6.     local p2_s = string(pc2[`r'], "%9.4f")
  7.     file write fh "`vn' & `p1_s' & `p2_s' \\\\" _n
  8. }

. file write fh "\bottomrule" _n "\multicolumn{3}{l}{\footnotesize Principal comp
> onents on trust variables (2020).} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * PCA scree plot
. screeplot, title("Trust PCA scree plot")

. graph export "${DESCRIPTIVE}/Figures/trust_pca_scree.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/trust_pca_sc
    > ree.png saved as PNG format

. 
. * ---------------------------------------------------------------------
. * Fin lit correlations with trust (matrix layout)
. * ---------------------------------------------------------------------
. display "=== Fin lit + trust correlations ==="
=== Fin lit + trust correlations ===

. pwcorr interest_2020 inflation_2020 risk_div_2020 trust_others_2020, sig obs

             | int~2020 inf~2020 ris~2020 t~othe~0
-------------+------------------------------------
interes~2020 |   1.0000 
             |
             |     1302
             |
inflati~2020 |   0.0077   1.0000 
             |   0.7843
             |     1252     1273
             |
risk_di~2020 |   0.0711   0.1164   1.0000 
             |   0.0205   0.0002
             |     1062     1047     1072
             |
trust_o~2020 |  -0.0007  -0.0065   0.0257   1.0000 
             |   0.9842   0.8503   0.4926
             |      874      854      716      900
             |

. 
. preserve

. correlate interest_2020 inflation_2020 risk_div_2020 trust_others_2020
(obs=692)

             | int~2020 inf~2020 ris~2020 t~othe~0
-------------+------------------------------------
interes~2020 |   1.0000
inflati~2020 |  -0.0080   1.0000
risk_di~2020 |   0.0344   0.0726   1.0000
trust_o~2020 |   0.0061  -0.0349   0.0352   1.0000


. matrix C = r(C)

. local finvars "interest_2020 inflation_2020 risk_div_2020 trust_others_2020"

. local n : word count `finvars'

. 
. file open fh using "${DESCRIPTIVE}/Tables/finlit_trust_corr.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n ///
>     "\caption{Financial literacy and trust correlations}" _n ///
>     "\label{tab:finlit_trust_corr}" _n ///
>     "\resizebox{\textwidth}{!}{\begin{tabular}{l"

. forvalues j = 1/`n' {
  2.     file write fh "r"
  3. }

. file write fh "}\toprule" _n " & "

. 
. * Column headers (variables)
. forvalues j = 1/`n' {
  2.     local v : word `j' of `finvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     if `j' < `n' file write fh "`vlab' & "
  6.     else file write fh "`vlab' \\\\ \midrule" _n
  7. }

. 
. * Matrix body
. forvalues i = 1/`n' {
  2.     local v : word `i' of `finvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     file write fh "`vlab'"
  6.     forvalues j = 1/`n' {
  7.         local c_s = string(C[`i',`j'], "%5.2f")
  8.         file write fh " & `c_s'"
  9.     }
 10.     file write fh " \\\\" _n
 11. }

. 
. local nc = `n' + 1

. file write fh "\bottomrule" _n "\multicolumn{`nc'}{l}{\footnotesize Interest, i
> nflation, risk diversification, and general trust (2020).} \\\\" _n "\end{tabul
> ar}}" _n "\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * IV correlations with trust (matrix layout)
. * ---------------------------------------------------------------------
. display "=== IV + trust correlations ==="
=== IV + trust correlations ===

. pwcorr par_citizen_2020 par_loyalty_2020 population_2020 trust_others_2020, sig
>  obs

             | par_ci~0 par_lo~0 popula.. t~othe~0
-------------+------------------------------------
par_cit~2020 |   1.0000 
             |
             |     1028
             |
par_loy~2020 |   0.4476   1.0000 
             |   0.0000
             |      851     1019
             |
popu~on_2020 |   0.0618  -0.0015   1.0000 
             |   0.0736   0.9651
             |      840      835     1114
             |
trust_o~2020 |   0.0682   0.0606  -0.0346   1.0000 
             |   0.0712   0.1050   0.3526
             |      700      716      723      900
             |

. 
. preserve

. tempfile ivcorr

. postfile handle str32 var1 str32 var2 double corr using "`ivcorr'", replace
(file /var/folders/17/1rg0y2kj74l9p9g301vbhhkw0000gn/T//S_84306.00001q not
    found)

. correlate par_citizen_2020 par_loyalty_2020 population_2020 trust_others_2020
(obs=467)

             | par_ci~0 par_lo~0 popula.. t~othe~0
-------------+------------------------------------
par_cit~2020 |   1.0000
par_loy~2020 |   0.4152   1.0000
popu~on_2020 |   0.0349   0.0284   1.0000
trust_o~2020 |   0.1096   0.0794  -0.0982   1.0000


. matrix C = r(C)

. local ivvars "par_citizen_2020 par_loyalty_2020 population_2020 trust_others_20
> 20"

. local n : word count `ivvars'

. * Export as compact matrix
. file open fh using "${DESCRIPTIVE}/Tables/iv_trust_corr.tex", write replace

. file write fh "\begin{table}[htbp]\centering\small" _n ///
>     "\caption{IV and trust correlations}" _n ///
>     "\label{tab:iv_trust_corr}" _n ///
>     "\resizebox{\textwidth}{!}{\begin{tabular}{l"

. forvalues j = 1/`n' {
  2.     file write fh "r"
  3. }

. file write fh "}\toprule" _n " & "

. forvalues j = 1/`n' {
  2.     local v : word `j' of `ivvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     if `j' < `n' file write fh "`vlab' & "
  6.     else file write fh "`vlab' \\\\ \midrule" _n
  7. }

. forvalues i = 1/`n' {
  2.     local v : word `i' of `ivvars'
  3.     _vlabel `v'
  4.     local vlab `r(vlabel)'
  5.     file write fh "`vlab'"
  6.     forvalues j = 1/`n' {
  7.         local c_s = string(C[`i',`j'], "%5.2f")
  8.         file write fh " & `c_s'"
  9.     }
 10.     file write fh " \\\\" _n
 11. }

. local nc = `n' + 1

. file write fh "\bottomrule" _n "\multicolumn{`nc'}{l}{\footnotesize Parent citi
> zenship, loyalty, population size, and general trust (2020).} \\\\" _n "\end{ta
> bular}}" _n "\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Depression/health by age
. * ---------------------------------------------------------------------
. display "=== Depression and health conditions by age group ==="
=== Depression and health conditions by age group ===

. preserve

. keep hhidpn age_* depression_2020 health_cond_2020

. reshape long age_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  27   ->   17          
j variable (12 values)                    ->   year
xij variables:
         age_2000 age_2002 ... age_2022   ->   age_
-----------------------------------------------------------------------------

. rename age_ age

. gen int age_group = floor(age/5)*5 if !missing(age)
(318,278 missing values generated)

. tabstat depression_2020 health_cond_2020 `wopt', by(age_group) statistics(n mea
> n sd p50 p95)

Summary statistics: N, Mean, SD, p50, p95
Group variable: age_group 

age_group |  dep~2020  hea~2020
----------+--------------------
       15 |         1         1
          |         3         1
          |         .         .
          |         3         1
          |         3         1
----------+--------------------
       20 |         6         6
          |  2.666667  1.666667
          |  1.632993  1.032796
          |         3         1
          |         5         3
----------+--------------------
       25 |        38        38
          |  2.894737  1.473684
          |  2.391307  1.589439
          |         2         1
          |         6         4
----------+--------------------
       30 |       137       137
          |  1.970803  1.372263
          |  2.225988  1.524348
          |         1         1
          |         6         4
----------+--------------------
       35 |       401       401
          |  1.511222   1.57606
          |  2.058033  1.523097
          |         1         1
          |         6         4
----------+--------------------
       40 |      1022      1033
          |  1.619374  1.787028
          |  2.193601  1.552426
          |         1         1
          |         7         5
----------+--------------------
       45 |      2946      2982
          |  1.578411  1.896378
          |  2.165667  1.515323
          |         1         2
          |         7         5
----------+--------------------
       50 |     13423     13723
          |  1.580273  2.084457
          |  2.117563  1.526645
          |         1         2
          |         7         5
----------+--------------------
       55 |     24547     25204
          |  1.560883  2.264879
          |  2.085535    1.5462
          |         1         2
          |         6         5
----------+--------------------
       60 |     23153     24022
          |  1.480672  2.495129
          |  2.015078  1.543088
          |         1         2
          |         6         5
----------+--------------------
       65 |     19117     20112
          |   1.42062  2.702267
          |  1.947641  1.507563
          |         1         3
          |         6         5
----------+--------------------
       70 |     14170     15205
          |  1.410656  2.867807
          |   1.91287  1.466595
          |         1         3
          |         6         5
----------+--------------------
       75 |      9919     10875
          |  1.403065  2.974805
          |  1.882636  1.428483
          |         1         3
          |         6         5
----------+--------------------
       80 |      6177      6956
          |  1.439534  3.008051
          |   1.89053  1.401835
          |         1         3
          |         6         5
----------+--------------------
       85 |      2711      3215
          |  1.460716  3.044168
          |  1.884445  1.402253
          |         1         3
          |         6         5
----------+--------------------
       90 |       826      1068
          |  1.524213  3.061798
          |  1.919601   1.33229
          |         1         3
          |         6         5
----------+--------------------
       95 |       150       234
          |      1.64  3.141026
          |  1.984098  1.459535
          |         1         3
          |         5         6
----------+--------------------
      100 |        14        27
          |  1.571429  2.444444
          |   2.13809  1.502135
          |         1         2
          |         6         5
----------+--------------------
      105 |         1         1
          |         5         0
          |         .         .
          |         5         0
          |         5         0
----------+--------------------
    Total |    118759    125240
          |  1.486767  2.547916
          |  2.005925  1.540761
          |         1         2
          |         6         5
-------------------------------

. collapse (mean) mean_depression=depression_2020 mean_health=health_cond_2020 (c
> ount) n=depression_2020 `wopt', by(age_group)

. file open fh using "${DESCRIPTIVE}/Tables/depression_health_by_agegroup.tex", w
> rite replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Depression and healt
> h conditions by age group}" _n "\label{tab:depression_health_by_agegroup}" _n "
> \begin{tabular}{lrrr}\toprule" _n "Age (midpoint) & Depression (mean) & Health 
> conditions (mean) & Obs \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local ag_s = string(age_group[`r'], "%9.0f")
  3.     local md_s = string(mean_depression[`r'], "%9.4f")
  4.     local mh_s = string(mean_health[`r'], "%9.4f")
  5.     local n_s = string(n[`r'], "%9.0f")
  6.     file write fh "`ag_s' & `md_s' & `mh_s' & `n_s' \\\\" _n
  7. }

. file write fh "\bottomrule" _n "\multicolumn{4}{l}{\footnotesize Five-year age 
> bins; 2020 outcomes.} \\\\" _n "\end{tabular}\end{table}" _n

. file close fh

. restore

. 
. * ---------------------------------------------------------------------
. * Group coverage: N (observations) in each region and each region-pop group by 
> year
. * ---------------------------------------------------------------------
. display "=== Group coverage: N by region and by year ==="
=== Group coverage: N by region and by year ===

. preserve

. keep hhidpn censreg_*

. reshape long censreg_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  13   ->   3           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
-----------------------------------------------------------------------------

. label values censreg_ region_lbl

. drop if missing(censreg_)
(321,251 observations deleted)

. contract year censreg_, freq(N)

. * Wide table: year x region with N (drop Other)
. reshape wide N, i(year) j(censreg_)
(j = 1 2 3 4 5)

Data                               Long   ->   Wide
-----------------------------------------------------------------------------
Number of observations               60   ->   12          
Number of variables                   3   ->   6           
j variable (5 values)          censreg_   ->   (dropped)
xij variables:
                                      N   ->   N1 N2 ... N5
-----------------------------------------------------------------------------

. rename (N1 N2 N3 N4) (Northeast Midwest South West)

. file open fh using "${DESCRIPTIVE}/Tables/region_group_counts_by_year.tex", wri
> te replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Observations by regi
> on and year}" _n "\label{tab:region_group_counts_by_year}" _n "\begin{tabular}{
> lrrrr}\toprule" _n "Year & Northeast & Midwest & South & West \\\\ \midrule" _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local ne_s = string(Northeast[`r'], "%9.0f")
  4.     local mw_s = string(Midwest[`r'], "%9.0f")
  5.     local so_s = string(South[`r'], "%9.0f")
  6.     local we_s = string(West[`r'], "%9.0f")
  7.     file write fh "`yr_s' & `ne_s' & `mw_s' & `so_s' & `we_s' \\\\" _n
  8. }

. file write fh "\bottomrule" _n "\multicolumn{5}{l}{\footnotesize Person-year ob
> servations by region (region 5 = Other omitted).} \\\\" _n "\end{tabular}\end{t
> able}" _n

. file close fh

. restore

. 
. display "=== Group coverage: N by region-population group and year ==="
=== Group coverage: N by region-population group and year ===

. preserve

. keep hhidpn censreg_* region_pop_group_*

. reshape long censreg_ region_pop_group_, i(hhidpn) j(year)
(j = 2000 2002 2004 2006 2008 2010 2012 2014 2016 2018 2020 2022)

Data                               Wide   ->   Long
-----------------------------------------------------------------------------
Number of observations           45,234   ->   542,808     
Number of variables                  25   ->   4           
j variable (12 values)                    ->   year
xij variables:
censreg_2000 censreg_2002 ... censreg_2022->   censreg_
region_pop_group_2000 region_pop_group_2002 ... region_pop_group_2022->region_pop
> _group_
-----------------------------------------------------------------------------

. contract year region_pop_group_, freq(N)

. drop if missing(region_pop_group_)
(12 observations deleted)

. rename N obs

. file open fh using "${DESCRIPTIVE}/Tables/regionpop_group_counts_by_year.tex", 
> write replace

. file write fh "\begin{table}[htbp]\centering" _n "\caption{Observations by regi
> on--population group and year}" _n "\label{tab:regionpop_group_counts_by_year}"
>  _n "\begin{tabular}{lrr}\toprule" _n "Year & Group (code) & Obs \\\\ \midrule"
>  _n

. forvalues r = 1/`=_N' {
  2.     local yr_s = string(year[`r'], "%9.0f")
  3.     local rpg_s = string(region_pop_group_[`r'], "%9.0f")
  4.     local ob_s = string(obs[`r'], "%9.0f")
  5.     file write fh "`yr_s' & `rpg_s' & `ob_s' \\\\" _n
  6. }

. file write fh "\bottomrule" _n "\multicolumn{3}{l}{\footnotesize Region $\times
> $ population size (6 bins); person-year counts.} \\\\" _n "\end{tabular}\end{ta
> ble}" _n

. file close fh

. restore

. 
. * For analysis: treat region 5 (Other) as missing in prepped censreg variables 
> before saving
. foreach v of varlist censreg_* {
  2.     capture confirm variable `v'
  3.     if !_rc replace `v' = . if `v' == 5
  4. }
(40 real changes made, 40 to missing)
(43 real changes made, 43 to missing)
(55 real changes made, 55 to missing)
(69 real changes made, 69 to missing)
(70 real changes made, 70 to missing)
(70 real changes made, 70 to missing)
(76 real changes made, 76 to missing)
(87 real changes made, 87 to missing)
(81 real changes made, 81 to missing)
(79 real changes made, 79 to missing)
(61 real changes made, 61 to missing)
(60 real changes made, 60 to missing)

. 
. * Save dataset with PCA components (region 5 = missing in saved data)
. save "${PROCESSED}/analysis_ready_processed.dta", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Processing/analysis_ready_proces
    > sed.dta saved

. display "08_descriptive_controls: Saved ${PROCESSED}/analysis_ready_processed.d
> ta with trust_pc1/pc2 (region 5 Other set to missing)"
08_descriptive_controls: Saved /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns
> /Code/Processing/analysis_ready_processed.dta with trust_pc1/pc2 (region 5 Othe
> r set to missing)

. 
. * ---------------------------------------------------------------------
. * Tabstat: regression-focus returns (r1 core, r4 Core+ret., r5 net wealth)
. * ---------------------------------------------------------------------
. display "=== Tabstat: returns r1 (core), r4 (Core+ret.), r5 (net wealth) ==="
=== Tabstat: returns r1 (core), r4 (Core+ret.), r5 (net wealth) ===

. local regretvars ""

. foreach v in r1_annual_2022 r4_annual_2022 r5_annual_2022 {
  2.     capture confirm variable `v'
  3.     if !_rc local regretvars "`regretvars' `v'"
  4. }

. if "`regretvars'" != "" {
.     tabstat `regretvars' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min max
> )

   Stats |  r1_ann..  r4_ann..  r5_ann..
---------+------------------------------
       N |      8330      8031      9183
    Mean |  .3785716  .5208448  .3040901
      SD |  1.836335  1.443754  .8388391
      p1 |        -1        -1  -.825767
      p5 |        -1 -.6818938 -.4483227
     p50 |  .0382838  .1564856  .1474449
     p95 |  2.751666  2.838558   1.54951
     p99 |  7.660254  6.071068  3.530093
     Min |        -1        -1        -1
     Max |  41.09515  25.58872  19.67032
----------------------------------------
. }

. capture confirm variable r1_annual_2002

. if !_rc {
.     tabstat r1_annual_2002 r4_annual_2002 r5_annual_2002 `wopt', statistics(n m
> ean sd p1 p5 p50 p95 p99 min max)

   Stats |  r1_ann..  r4_ann..  r5_ann..
---------+------------------------------
       N |     13839     13167     14209
    Mean |  .3396622  .3441784  .1758168
      SD |  1.541005  1.066634  .6228046
      p1 |        -1       -.9 -.7018664
      p5 | -.8911069 -.6025773 -.4351646
     p50 |  .0079683    .08775  .0740954
     p95 |  2.649658  2.114903  1.056174
     p99 |  6.870338  4.525698  2.642344
     Min |        -1        -1        -1
     Max |  31.90998  15.50959  14.16723
----------------------------------------
. }

. 
. * ---------------------------------------------------------------------
. * Tabstat: regression-focus wealth (core, Core+ret., net wealth)
. * ---------------------------------------------------------------------
. display "=== Tabstat: wealth core, Core+ret., net wealth ==="
=== Tabstat: wealth core, Core+ret., net wealth ===

. capture confirm variable wealth_core_2022

. if !_rc {
.     local wlist22 "wealth_core_2022 wealth_total_2022"
.     capture confirm variable wealth_coreira_2022
.     if !_rc local wlist22 "wealth_core_2022 wealth_coreira_2022 wealth_total_20
> 22"
.     tabstat `wlist22' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  wealth..  wealth..  w~l_2022
---------+------------------------------
       N |     15850     15850      9838
    Mean |  233903.3  357224.3  679248.6
      SD |  911792.4   1091607   1471042
      p1 |         0         0   -140000
      p5 |         0         0    -22000
     p50 |      6000     14102    210000
     p95 |   1050000   1695628   2750000
     p99 |   4000000   4961695   6926000
     Min |         0         0   -965000
     Max |  2.26e+07  2.27e+07  2.65e+07
----------------------------------------
. }

. capture confirm variable wealth_core_2002

. if !_rc {
.     local wlist02 "wealth_core_2002 wealth_total_2002"
.     capture confirm variable wealth_coreira_2002
.     if !_rc local wlist02 "wealth_core_2002 wealth_coreira_2002 wealth_total_20
> 02"
.     tabstat `wlist02' `wopt', statistics(n mean sd p1 p5 p50 p95 p99 min max)

   Stats |  wealth..  wealth..  w~l_2002
---------+------------------------------
       N |     18165     18165     12842
    Mean |  177262.2  222964.5  352057.3
      SD |    623229  666646.7   1168809
      p1 |         0         0    -57000
      p5 |         0         0     -3680
     p50 |     21500     40000    136500
     p95 |  794666.2    978000   1248500
     p99 |   2205000   2508554   3147549
     Min |         0         0  -3832000
     Max |  3.33e+07  3.33e+07  9.07e+07
----------------------------------------
. }

. 
. * ---------------------------------------------------------------------
. * Trust vs income/returns (2022) scatterplots — regression focus: r1, r4, r5 on
> ly
. * ---------------------------------------------------------------------
. display "=== Scatter: trust vs income/returns (2022) ==="
=== Scatter: trust vs income/returns (2022) ===

. capture mkdir "${DESCRIPTIVE}/Figures"

. 
. * Income vs trust scatter: uses final log series from 04 (deflate -> ln(x), x>0
>  -> winsorize p1/p99 on log; zero income dropped)
. * Variables: ln_lab_inc_final_2022, ln_tot_inc_final_2022 (see 04_processing_in
> come.do "Final toggle" block)
. foreach v in ln_lab_inc_final_2022 ln_tot_inc_final_2022 {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local vlabel = cond("`v'"=="ln_lab_inc_final_2022","Final log labor 
> income (2022)","Final log total income (2022)")
  5.         twoway scatter `v' trust_others_2020 if !missing(`v') & !missing(tru
> st_others_2020), ///
>             title("`vlabel' vs general trust") ///
>             xtitle("General trust (2020)") ytitle("`vlabel'")
  6.         graph export "${DESCRIPTIVE}/Figures/`v'_vs_trust_2022.png", replace
  7.     }
  8. }
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ln_lab_inc_f
    > inal_2022_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/ln_tot_inc_f
    > inal_2022_vs_trust_2022.png saved as PNG format

. 
. * Return measures (regression focus: r1 core, r4 Core+ret., r5 net wealth only)
. foreach v in r1_annual_2022 r4_annual_2022 r5_annual_2022 ///
>             r1_annual_win_2022 r4_annual_win_2022 r5_annual_win_2022 {
  2.     capture confirm variable `v'
  3.     if !_rc {
  4.         local vlabel "`v'"
  5.         if "`v'"=="r1_annual_2022" local vlabel "Core (2022)"
  6.         if "`v'"=="r4_annual_2022" local vlabel "Core+ret. (2022)"
  7.         if "`v'"=="r5_annual_2022" local vlabel "Net wealth (2022)"
  8.         if "`v'"=="r1_annual_win_2022" local vlabel "Core (2022, winsorized)
> "
  9.         if "`v'"=="r4_annual_win_2022" local vlabel "Core+ret. (2022, winsor
> ized)"
 10.         if "`v'"=="r5_annual_win_2022" local vlabel "Net wealth (2022, winso
> rized)"
 11.         twoway scatter `v' trust_others_2020 if !missing(`v') & !missing(tru
> st_others_2020), ///
>             title("`vlabel' vs general trust") ///
>             xtitle("General trust (2020)") ytitle("`vlabel'")
 12.         graph export "${DESCRIPTIVE}/Figures/`v'_vs_trust_2022.png", replace
 13.     }
 14. }
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r1_annual_20
    > 22_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r4_annual_20
    > 22_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r5_annual_20
    > 22_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r1_annual_wi
    > n_2022_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r4_annual_wi
    > n_2022_vs_trust_2022.png saved as PNG format
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/r5_annual_wi
    > n_2022_vs_trust_2022.png saved as PNG format

. 
. * ---------------------------------------------------------------------
. * Binscatter: trust vs depression (same style as 06/07 binscatters)
. * ---------------------------------------------------------------------
. display "=== Binscatter: depression vs general trust (2020) ==="
=== Binscatter: depression vs general trust (2020) ===

. capture which binscatter

. if _rc capture ssc install binscatter, replace

. capture confirm variable depression_2020

. local has_dep = (_rc == 0)

. capture confirm variable trust_others_2020

. local has_trust = (_rc == 0)

. if `has_dep' & `has_trust' {
.     capture binscatter depression_2020 trust_others_2020 if !missing(depression
> _2020) & !missing(trust_others_2020), nquantiles(50) ///
>         ytitle("Depression (2020)") xtitle("General trust (2020)") ///
>         title("Binscatter: Depression vs general trust")
.     if _rc == 0 graph export "${DESCRIPTIVE}/Figures/depression_vs_trust_binsca
> tter.png", replace
file /Volumes/SSD
    PRO/Github-forks/Chp2-TrustandReturns/Code/Descriptive/Figures/depression_v
    > s_trust_binscatter.png saved as PNG format
. }

. 
. log close
      name:  <unnamed>
       log:  /Volumes/SSD PRO/Github-forks/Chp2-TrustandReturns/Notes/Logs/08_des
> criptive_controls.log
  log type:  text
 closed on:  19 Feb 2026, 13:56:02
---------------------------------------------------------------------------------
